{"slug":"glsl","extension":"glsl","name":"GLSL Shader File","category":"glsl-shader-file","summary":"","developer_org":"khronos-group","developer_name":"Khronos Group","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/glsl_12331.png","alt":"Screenshot of a .glsl file in Microsoft Visual Studio Code 1.6","caption":"GLSL file open in Microsoft Visual Studio Code 1.6"},"description":["GLSL is a high-level shading language that features syntax similar to the C programming language. It is utilized by OpenGL, which is an application programming interface ( API ) that renders 2D and 3D graphics featured in applications across different platforms.","OpenGL is utilized by various applications, including video games, computer-aided design ( CAD ) applications, and artistic 3D visualization programs. Examples of applications featuring OpenGL include the Doom and Minecraft games, Adobe Photoshop and Premiere Pro, Autodesk AutoCAD and Maya, and Google Earth.","Shaders give depth to 3D graphics by altering their color. It includes applying varying levels of color, light, darkness, hue, saturation, and contrast to vertices, pixels, and textures that make up a graphic.","GLSL shaders are run on a computer's graphics processing unit ( GPU ), which is a processor focused on handling graphics operations. By running on a GPU, shaders reduce the workload of the computer's central processing unit ( CPU ), which can then focus its resources on executing actual code.","There are two prominent types of GLSL shaders:","Several extensions may be used for files storing GLSL shader properties. Some common file extensions include: .VSH file - Stores shader properties for vertices .VERT file - Stores vertex shader properties .FSH file - Stores fragment shader properties .FRAG file - Stores fragment shader properties"]},"images":[{"url":"https://fileinfo.com/img/ss/sm/glsl_12331.png","alt":"Screenshot of a .glsl file in Microsoft Visual Studio Code 1.6","caption":"GLSL file open in Microsoft Visual Studio Code 1.6"}],"updated_at":"2025-08-09","sources":[{"url":"glsl.html","retrieved_at":"2025-08-09"}]}