{"slug":"mkv","extension":"mkv","name":"Matroska Video","summary":"An MKV file is a video file saved in the Matroska multimedia container format that often stores short video clips, TV shows, and movies. It supports several types of audio and video codecs and may include .SRT , .SSA , .USF (Universal Subtitle Format), or VobSub subtitles. Many video players can open MKV files, including Microsoft Windows Media Player 2022 and VideoLAN VLC media player .","developer":"Matroska","developer_slug":"matroska","category":"Video Files","category_slug":"video-files","rating":4.1,"votes":1928,"last_updated":"May 12, 2023","more_information":{"content":["The Matroska multimedia container format is open source and was initially released in December 2002. It is similar to the .AVI , .ASF , and .MOV formats and can contain any number of video, audio, image, and subtitle tracks. Multimedia files that utilize the Matroska container format and store one or more video tracks are known as Matroska Video files and are distinguished by the .mkv file extension.","In addition to storing short video clips, TV shows, and movies, it has become popular in the anime fan-subbing community for saving multimedia with subtitles. The MKV format is especially helpful since it supports multiple audio and subtitle tracks in the same file.","NOTE: The Matroska name comes from the Russian Matryoshka doll, which contains numerous more miniature, nested dolls of the same shape."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/mkv_731.png","srcset":"https://fileinfo.com/img/ss/md/mkv_731.png 760w, https://fileinfo.com/img/ss/sm/mkv_731.png 380w","alt":"Screenshot of a .mkv file in Eltima Elmedia Player","width":"380","height":"253","caption":"MKV file open in Eltima Elmedia Player"}},"how_to_open":{"instructions":["While the MKV video format is not as common as the .MP4 , MOV, and AVI formats, many media players still support opening and playing MKV files, including:"],"programs":[{"name":"Microsoft Media Player","url":"../software/microsoft/media_player.html"},{"name":"VideoLAN VLC media player","url":"../software/videolan/vlc_media_player.html"},{"name":"MPlayer","url":"../software/mplayer/mplayer.html"}]},"scraped_at":"2025-08-09T21:58:54.798847","source":{"url":"https://fileinfo.com/extension/mkv","file":"mkv.html"}}