{"slug":"pvs","extension":"pvs","name":"Parallels Desktop Configuration File","category":"parallels-desktop-configuration-file","summary":"","developer_org":"parallels","developer_name":"Parallels","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/pvs_2449.png","alt":"Screenshot of a .pvs file in Parallels Desktop for Mac 20","caption":"PVS file open in Parallels Desktop for Mac 20"},"description":["Parallels Desktop for Mac is an app that allows you to run Windows, Linux, Android, and other versions of macOS on your Mac. When you create a virtual machine (VM) with Parallels Desktop for Mac, the software creates a PVM file to store its contents.","The PVM file is a macOS package that contains all the files Parallels Desktop needs to run a virtual machine, including .HDD , .LOG , .ISO , and .DAT files. Also, Parallels Desktop for Mac creates a config.pvs file that stores the configuration settings for the VM. Settings include the location and size of the virtual drive, memory allocation, network settings, and peripheral connections.","You can find the PVS configuration file for a VM inside the VM's PVM file, which Parallels Desktop for Mac saves in the following location by default:","Macintosh HD/​Users/​[username]/​Documents/​Parallels/​","Once you locate the PVM file, right-click the file and select Show Package Contents to view the package's files, including the config.pvs file, with Apple Finder."]},"common_filenames":[{"filename":"config.pvs","description":"config.pvs - Default name given to PVS files found within PVM files."}],"images":[{"url":"https://fileinfo.com/img/ss/sm/pvs_2449.png","alt":"Screenshot of a .pvs file in Parallels Desktop for Mac 20","caption":"PVS file open in Parallels Desktop for Mac 20"},{"url":"https://fileinfo.com/img/ss/sm/pvs_2449-2.png","alt":"PVS file open in Microsoft Visual Studio Code","caption":"PVS file open in Microsoft Visual Studio Code"}],"updated_at":"2025-08-09","sources":[{"url":"pvs.html","retrieved_at":"2025-08-09"}]}