{"slug":"rar","extension":"rar","name":"WinRAR Compressed Archive","summary":"A RAR file is an archive that contains one or more files compressed with RAR compression. It is compressed with a higher compression ratio than typical ZIP compression and incorporates a proprietary compression algorithm utilized by other compressors, including 7-Zip for its .7Z files. Since RAR archives store files in a reduced size, users often compress files to transfer or store them.","developer":"Eugene Roshal","developer_slug":"eugene-roshal","category":"Compressed Files","category_slug":"compressed-files","rating":4.2,"votes":4482,"last_updated":"November 16, 2023","more_information":{"content":["Eugene Roshal developed the RAR format (which stands for \"Roshal ARchive\") and introduced it in 1993 with the release of the WinRAR compression program. Since its introduction, the format has become a standard compression format with .ZIP and 7Z. While WinRAR typically creates RAR files, various utilities may compress (and extract) them.","Typically, RAR files store a collection of files or large files, such as a camera raw or video file. For example, a co-worker may compress some large videos in a RAR file, attach it to an email, and send it to you. Another example is that you might download 3D CAD files compressed in a RAR archive from a CAD website.","NOTE: The RAR compressor may also create spanned (or multi-volume) archives split across several compressed files. These files typically have file extensions from .r00 to .r99 , or they may all have the standard .rar extension."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/rar_91.png","srcset":"https://fileinfo.com/img/ss/md/rar_91.png 760w, https://fileinfo.com/img/ss/sm/rar_91.png 380w","alt":"Screenshot of a .rar file in RARLAB WinRAR 7","width":"380","height":"253","caption":"RAR file open in RARLAB WinRAR 7"}},"how_to_open":{"instructions":["You can open RAR files with RARLAB WinRAR (Windows) and RARLAB RAR (Android). For example, to open a RAR file with RARLAB WinRAR, select File → Open archive .","Various third-party decompression utilities also support RAR files, including the following applications:","If your RAR archive is split into a multi-volume archive (e.g. you possess a .rar file, an .r01 file, an .r02 file, and so on), you can extract all the files included within the multi-volume archive by opening the archive's primary RAR file with a decompression utility. Note that, for this to work, all the files contained within the multi-volume archive must be stored in the same folder. Also, you must possess every file included in the archive (e.g. if you have an .r03 file and an .r05 file but not an .r04 file, you may have trouble extracting your files).","Some RAR archives may be password-protected. To open these archives, you must enter the password used to create the archive when prompted."],"programs":[{"name":"Corel WinZip","url":"../software/corel/winzip.html"},{"name":"Corel WinZip Mac","url":"../software/corel/winzip_mac.html"},{"name":"B1 Free Archiver","url":"../software/catalina_group/b1_free_archiver.html"},{"name":"PeaZip","url":"../software/peazip/peazip.html"}]},"scraped_at":"2025-08-09T21:58:54.860639","source":{"url":"https://fileinfo.com/extension/rar","file":"rar.html"}}