{"slug":"xlsx","extension":"xlsx","name":"Microsoft Excel Spreadsheet","summary":"An XLSX file is an Excel spreadsheet created by Microsoft Excel or exported by another spreadsheet program, such as OpenOffice Calc or Apple Numbers. It stores data in worksheets, which contain cells arranged in a grid of rows and columns, and may also contain charts, mathematical functions, styles, and formatting. XLSX files are commonly used to store financial data and to save simple or complex mathematical models.","developer":"Microsoft","developer_slug":"microsoft","category":"Spreadsheet Files","category_slug":"spreadsheet-files","rating":3.9,"votes":985,"last_updated":"March 3, 2022","more_information":{"content":["Microsoft introduced the Excel Open XML Spreadsheet (XLSX) format when it released Excel 2007. Since then, XLSX files have become one of the most common file types for saving data in spreadsheets, and as such, are now typically referred to as just Excel spreadsheets.","In Excel 2007, XLSX files replaced .XLS files as the standard file for saving spreadsheets in Excel. Unlike XLS files, which store spreadsheet data in a single binary file, XLSX files are saved in the Open XML format, which stores data as separate files and folders in a compressed Zip package. The archive includes the [Content_Types].xml file, which describes the spreadsheet, and an .XML file for each worksheet within the spreadsheet.","Each cell in an XLSX spreadsheet may be formatted individually. For example, cells may have a number, text, currency, or another format, as well as color, border style, custom font, and size. Cells may also reference other cells to compute a resulting value.","NOTE: To explore the contents of an XLSX file, you can change the .xlsx extension to .zip and then decompress the resulting file with any Zip decompression utility."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/xlsx_1567.png","srcset":"https://fileinfo.com/img/ss/md/xlsx_1567.png 760w, https://fileinfo.com/img/ss/sm/xlsx_1567.png 380w","alt":"Screenshot of a .xlsx file in Microsoft Excel 365","width":"380","height":"253","caption":"XLSX file open in Microsoft Excel 365"}},"how_to_open":{"instructions":["You can open XLSX files with Microsoft Excel in Windows and macOS. Excel is the best option for opening XLSX files because it fully supports the formatting of Excel spreadsheets, which includes images, graphs, and spacing of data fields. Excel is also available for Android and iOS devices.","Many other spreadsheet programs can open and edit XLSX files, but they may not fully support the formatting of the original spreadsheets. Alternative programs include Corel Quattro Pro (Windows), Apple Numbers (Mac), and OpenOffice Calc (multiplatform).","You can also open XLSX files with various web programs. Google Sheets is a great free option that allows you to upload an XLSX file and view, edit, save, and convert the spreadsheet."]},"scraped_at":"2025-08-09T21:58:54.658814","source":{"url":"https://fileinfo.com/extension/xlsx","file":"xlsx.html"}}