{"slug":"hxml","extension":"hxml","name":"Haxe Project File","category":"haxe-project-file","summary":"","developer_org":"haxe-foundation","developer_name":"Haxe Foundation","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/hxml_12283.png","alt":"Screenshot of a .hxml file in Microsoft Visual Studio Code","caption":"HXML file open in Microsoft Visual Studio Code"},"description":["Haxe is an open-source , general-purpose programming language used to create video games, web applications, mobile applications, and cross-platform desktop applications. Notably, Haxe is used in the HaxeFlixel game engine, which is an open-source game engine used to develop 2D games.","When developers create a Haxe project, they create an associated HXML file. The HXML file contains settings Haxe's compiler uses to compile the developer's project (translate it into a different programming language). In all cases, HXML files contain a list of classes to be compiled and output files to produce. HXML files may also contain additional configuration options, such as a specification that each class be compiled in its own output file (using the --each and --next commands), or that the compiler removes any dead code it finds during the compilation process (using the --dce command).","It is also possible to nest several HXML files for several projects within one overarching HXML file. This type of HXML file includes lines of text referencing other HXML files, instead of Haxe classes. Nesting XHML files makes it easier for developers to compile complex programs that require code from multiple Haxe projects, because the developers can run one HXML file instead of many separate files.","NOTE: The HXML format replaced the .HXPROJ format."]},"common_filenames":[{"filename":"Build.hxml","description":"Build.hxml - The default name developers assign to most HXML files. This name describes the file's function (to build a Haxe project)."}],"images":[{"url":"https://fileinfo.com/img/ss/sm/hxml_12283.png","alt":"Screenshot of a .hxml file in Microsoft Visual Studio Code","caption":"HXML file open in Microsoft Visual Studio Code"}],"updated_at":"2025-08-09","sources":[{"url":"hxml.html","retrieved_at":"2025-08-09"}]}