{"slug":"songdata","extension":"songdata","name":"jOeSU Level Data","category":"joesu-level-data","summary":"","developer_org":"stoozey","developer_name":"stoozey","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/songdata_11644.png","alt":"Screenshot of a .songdata file in jOeSU","caption":"SONGDATA file open in jOeSU"},"description":["Much like Guitar Hero, osu!, and other rhythm-based games, jOeSU asks players to perform an action in time with music. In jOeSU, players must press either the W, A, S, or D key on their keyboard in time with prompts that appear during a song. The game's base SONGDATA files are each associated with a particular song (noted by the song name included in their filename), and they contain a list of numeric information that jOeSU uses to show prompts to players.","jOeSU players can create their own levels using the game's level editor. When they do, jOeSU saves the level as a folder within the player's Documents directory. These folders contain two SONGDATA files. data.songdata contains information on the prompts that should be shown during the custom level, and info.songdata contains information about the level's creator, speed, and difficulty. Players can share custom levels among themselves by uploading the folders containing their custom levels to jOeSU's online forum."]},"common_filenames":[{"filename":"s[songname].songdata","description":"s[songname].songdata - A base SONGDATA file included with jOeSU. Its filename includes the title of the song it is used with."},{"filename":"data.songdata","description":"data.songdata - A SONGDATA file created by jOeSU's level editor. It contains prompt information for a custom level."},{"filename":"info.songdata","description":"info.songdata - A SONGDATA file created by jOeSU's level editor. It contains metadata about a custom level, including the level's creator, speed, and difficulty."}],"images":[{"url":"https://fileinfo.com/img/ss/sm/songdata_11644.png","alt":"Screenshot of a .songdata file in jOeSU","caption":"SONGDATA file open in jOeSU"}],"updated_at":"2025-08-09","sources":[{"url":"songdata.html","retrieved_at":"2025-08-09"}]}