{"slug":"apkm","extension":"apkm","name":"Android App Bundle Mirror","category":"android-app-bundle-mirror","summary":"","developer_org":"apkmirror","developer_name":"APKMirror","more_information":{"description":["In 2018, Google introduced a new way for developers to upload Android apps to the Google Play Store, called app bundles. App bundles, or AAB files, contain every app package, or APK file, needed to install an Android app on any Android device. When a user downloads an app from the Google Play Store, Google's servers browse the AAB file and deliver only the APK files the user needs to install the app on their specific device. This process, which reduces Android app install sizes and times, is known as Dynamic Delivery.","When Google introduced app bundles and Dynamic Delivery, they made it harder for users who download and install apps outside the Google Play Store to continue doing so. For example, the site APKMirror previously provided users with mirrored APK files they could use to install apps outside the Google Play Store, but APKMirror could not provide mirrored AAB files.","To solve this problem, in 2020, APKMirror created the APKMirror Installer app and the APKM file format. Together, APKMirror Installer and the APKM files available at APKMirror's website allowed users to install bundle-style apps from outside the Google Play Store.","However, users who were used to being able to open, install, and explore APK files they'd downloaded from APKMirror without a specialized app took issue with the APKM file format. Specifically, they took issue with the fact that APKM files were encrypted , and thus could not be used by other third-party Android app installers. They also took issue with the fact that APKM-based apps installed more slowly than other Android apps. The APK Mirror team noted these concerns and told users that they are considering switching to a more open, Zip-based file format."]},"updated_at":"2025-08-09","sources":[{"url":"apkm.html","retrieved_at":"2025-08-09"}]}