{"slug":"art80","extension":"art80","name":"BERNINA ARTlink 8 Embroidery File","category":"bernina-artlink-8-embroidery-file","summary":"","developer_org":"bernina","developer_name":"BERNINA","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/art80_11986.png","alt":"Screenshot of a .art80 file in BERNINA ARTlink 8","caption":"ART80 file open in BERNINA ARTlink 8"},"description":["BERNINA introduced the ART80 format when it released ARTlink 8. It is the default file type used by version 8 of ARTlink to save designs that can be re-opened and modified by the software.","The first several versions of ARTlink save designs as ART files, by default. But beginning with version 5 of ARTlink, the software saves designs with file extensions that reflect the version of the software. For example, ARTlink 5 saves designs as .ART50 files, ARTlink 6 saves designs as .ART60 files, and ARTlink 7 saves designs as .ART70 files.","To create an ART80 file with ARTlink, select File → Save or Save As... and choose the ART80 file type from the \"Save as type\" dropdown menu. When finished with the design, you can export it to various embroidery formats.","To export an ART80 file to another embroidery format with ARTlink, select File → Export Machine File... , then choose the format. Conversion options include .ART , .EXP , .PES , .SEW , .JEF , .VP3 , .VIP , .PEC , .SHV and .HUS .","After exporting the design, you can transfer it to an embroidery machine to stitch the design onto fabric. To transfer a converted design, insert a USB storage device in your computer, then copy the converted design file to the connected storage device via File Explorer in Windows. You can also transfer the file to a connected storage device directly from within ARTlink by selecting File → Write to Card/Machine... .","After successfully transferring the file, eject the storage device from your computer and insert it into the storage port on the embroidery machine. Then, load the design onto the machine and embroider it onto the material."]},"images":[{"url":"https://fileinfo.com/img/ss/sm/art80_11986.png","alt":"Screenshot of a .art80 file in BERNINA ARTlink 8","caption":"ART80 file open in BERNINA ARTlink 8"}],"updated_at":"2025-08-09","sources":[{"url":"art80.html","retrieved_at":"2025-08-09"}]}