{"slug":"c","extension":"c","name":"C/C++ Source Code File","summary":"A C file is a source code file for a C or C++ program. It may include an entire program's source code or may be one of many source files referenced within a programming project. Users can edit C files with source code and plain text editors, then compile them with a C/C++ compiler for the target platform before the code can be run.","developer":"ANSI/ISO","developer_slug":"ansi-iso","category":"Developer Files","category_slug":"developer-files","rating":4.1,"votes":250,"last_updated":"March 8, 2023","more_information":{"content":["Dennis Ritchie originally developed the C programming language to create Unix utilities in Bell Labs in the late 1960s and early 1970s. Since the 1970s, the popularity of C has grown, and many users have learned and used the language to develop operating systems, database management systems, games, and more. In addition, the American National Standards Institute (ANSI) and the International Organization for Standardization (ISO) have also standardized the C programming language since 1989.","The language has also influenced many programming languages, including C++, PHP, Perl, Python, Java, and JavaScript. For example, C++ is an extension of the C programming language and was released in the mid-1980s. Developers use the language to create many of today's software programs. The C++ language may be stored in C, .CC , .CPP , .CXX , and C++ source code files."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/c_248.png","srcset":"https://fileinfo.com/img/ss/md/c_248.png 760w, https://fileinfo.com/img/ss/sm/c_248.png 380w","alt":"Screenshot of a .c file in Microsoft Visual Studio Code 1.33","width":"380","height":"253","caption":"C file open in Microsoft Visual Studio Code 1.33"}},"how_to_open":{"instructions":["You can open and edit C files with various source code editors, including Microsoft Visual Studio Code (multiplatform), Code Blocks (multiplatform), and Apple Xcode (macOS). These applications offer helpful features, such as syntax highlighting and auto-completion for viewing and editing C/C++ code.","You can also open and edit CPP files with a plain text editor, such as Microsoft Notepad (bundled with Windows) or Apple TextEdit (bundled with macOS). However, these text editors do not provide helpful source code editing features.","You can compile the C/C++ code stored in C files to code that can be run on a computer with various free and commercial compilers . Some compilers include Microsoft Visual Studio (Windows), GNU Compiler Collection (multiplatform), Eclipse IDE for C Developers (multiplatform), and Apple Xcode (macOS)."]},"scraped_at":"2025-08-09T21:58:55.013851","source":{"url":"https://fileinfo.com/extension/c","file":"c.html"}}