{"slug":"jpg_thumb","extension":"jpg_thumb","name":"Twitter Thumbnail JPEG Image","category":"twitter-thumbnail-jpeg-image","summary":"","developer_org":"n-a","developer_name":"N/A","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/jpg_thumb_12487.png","alt":"Screenshot of a .jpg_thumb file in Google Chrome","caption":"JPG_THUMB file open in Google Chrome"},"description":["Twitter is a social networking service where users can share messages that contain text, images, and videos. The service may re-size images hosted on its media server with a JSON entity size specification based on how users view the image in a web browser.","For example, if a user is viewing an image in its thumbnail size, Twitter appends the thumbnail specification to the image's URL when a user opens it, creating a URL that ends in .jpg:thumb . When a Chrome user accesses a thumbnail image stored on Twitter's media server in a new tab, the URL may look like this:","https:/​/​pbs.twimg.com/​media/​FHkhb5mWUAwoInu.jpg:thumb","If the user downloads the image from this page, Chrome changes the jpg:thumb text to .jpg_thumb (colons cannot be used in filenames) and saves the image as a JPG_THUMB file.","Since Twitter displays images in small, medium, large, and original sizes, you may encounter other sizes of JPEG images when downloading them with Chrome. You can tell the size of the image by the extension of the file. For instance, a small-sized image is saved as a .JPG_SMALL file, a medium-sized image is saved as a .JPG_MEDIUM file, and a large-sized image is saved as a .JPG_LARGE file.","NOTE: To prevent the creation of JPG_THUMB files, Twitter altered how it specifies sizes. You will now see the following URL structure:","https:/​/​pbs.twimg.com/​media/​FIe0c-0WYAA__vY?format=jpg&name=thumb"]},"images":[{"url":"https://fileinfo.com/img/ss/sm/jpg_thumb_12487.png","alt":"Screenshot of a .jpg_thumb file in Google Chrome","caption":"JPG_THUMB file open in Google Chrome"}],"updated_at":"2025-08-09","sources":[{"url":"jpg_thumb.html","retrieved_at":"2025-08-09"}]}