{"slug":"mjml","extension":"mjml","name":"Mailjet Markup Language File","category":"mailjet-markup-language-file","summary":"","developer_org":"mailjet","developer_name":"Mailjet","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/mjml_13496.png","alt":"Screenshot of a .mjml file in Mailjet MJML","caption":"MJML file open in Mailjet MJML"},"description":["MJML is a markup language that web developers can use to create responsive emails and templates. It features HTML-like syntax and elements, as well as a standard component library that developers can draw from to reduce the time they spend coding responsive email elements.","Often, developers save the emails, templates, and elements they've created using MJML as MJML files. For example, when a developer creates a new project in the MJML app, MJML saves that project's base content in a file named index.mjml . If a developer creates a new project that contains a header and footer, MJML saves the project's header and footer elements in files named header.mjml and footer.mjml . (In this case, the developer's index.mjml file will contain references to their header.mjml and footer.mjml files.)","While developers most often create MJML files from within the MJML app, they can use any text editor to create MJML files. Mailjet maintains plug-ins for Microsoft Visual Studio Code, Github Atom, and Sublime Text, to make it easier for developers to create MJML files in those apps."]},"common_filenames":[{"filename":"index.html","description":"index.html - Defines the main contents of an MJML email."},{"filename":"header.html","description":"header.html - Defines an MJML email header."},{"filename":"footer.html","description":"footer.html - Defines an MJML email footer."}],"images":[{"url":"https://fileinfo.com/img/ss/sm/mjml_13496.png","alt":"Screenshot of a .mjml file in Mailjet MJML","caption":"MJML file open in Mailjet MJML"}],"updated_at":"2025-08-09","sources":[{"url":"mjml.html","retrieved_at":"2025-08-09"}]}