{"slug":"png","extension":"png","name":"Portable Network Graphic","summary":"A PNG file is an image saved in the Portable Network Graphic ( PNG ) format, commonly used to store web graphics, digital photographs, and images with transparent backgrounds. It is a raster graphic similar to a .JPG image but is compressed with lossless compression and supports transparency.","developer":"PNG Development Group","developer_slug":"png-development-group","category":"Raster Image Files","category_slug":"raster-image-files","rating":4.1,"votes":1764,"last_updated":"April 20, 2023","more_information":{"content":["PNG is one of the most common image formats, along with JPEG , GIF , TIFF , and EPS . Examples of when you might encounter a PNG file include:","PNG was created in 1995 to be a free alternative to the GIF format for transferring images on the web. It improved upon the limitations of the GIF format, which supported a limited number of colors and included a patent license. Additionally, while GIF images only support fully opaque or fully transparent pixels, PNG images may include an 8-bit transparency channel, which allows the image colors to fade from opaque to transparent.","Other PNG features include support for indexed (palette-based) 24-bit RGB or 32-bit RGBA (RGB with a fourth alpha channel) color images. The format also supports full-color, non-indexed RGB or RGBA images and grayscale images.","While the PNG format became more widely used than GIF, PNG is a single-image format, whereas GIF supports multiple images. The GIF format allowed users to save simple animations as GIF files and led to the format's resurgence online, especially on social media. In response to this limitation, the PNG Development Group created the Multiple-image Network Graphics ( .MNG ) format in 2001, but it was not widely adopted like the GIF format."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/png_79-2.jpg","srcset":"https://fileinfo.com/img/ss/md/png_79-2.jpg 760w, https://fileinfo.com/img/ss/sm/png_79-2.jpg 380w","alt":"Screenshot of a .png file in Microsoft Photos 2021","width":"380","height":"253","caption":"PNG file open in Microsoft Photos 2021"}},"how_to_open":{"instructions":["You can open PNG images with many free and commercial programs, including most image editors, video editors, and web browsers. Windows and macOS also come bundled with programs that support PNG images, such as Microsoft Photos and Apple Preview ."]},"scraped_at":"2025-08-09T21:58:54.726967","source":{"url":"https://fileinfo.com/extension/png","file":"png.html"}}