{"slug":"ppt","extension":"ppt","name":"Microsoft PowerPoint Presentation (Legacy)","summary":"A PPT file is an editable slide show created by Microsoft PowerPoint or exported by another presentation program, such as OpenOffice Impress or Apple Keynote. It may include formatted text, bullet points, images, movies, sound effects, and music. Users commonly build PPT files from templates with PowerPoint, but they may also create them from scratch.","developer":"Microsoft","developer_slug":"microsoft","category":"Data Files","category_slug":"data-files","rating":4,"votes":674,"last_updated":"June 7, 2022","more_information":{"content":["When creating, saving, and presenting presentations, you may encounter PPT files in home, school, and business environments. Microsoft introduced the PowerPoint Presentation (PPT) binary format in 1987 when it released PowerPoint. PPT was the primary file type used to save PowerPoint presentations until Microsoft replaced it in PowerPoint 2007 with the Open XML Presentation ( .PPTX ) file format.","While you will most likely see PPTX files more often than PPT files, some users with older versions of PowerPoint may still save their presentations as PPT files. In addition, you may receive PPT files from friends, family members, or co-workers via email or download them from a website or cloud storage service."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/ppt_81.png","srcset":"https://fileinfo.com/img/ss/md/ppt_81.png 760w, https://fileinfo.com/img/ss/sm/ppt_81.png 380w","alt":"Screenshot of a .ppt file in Microsoft PowerPoint 365","width":"380","height":"253","caption":"PPT file open in Microsoft PowerPoint 365"}},"how_to_open":{"instructions":["You can open PPT files with Microsoft PowerPoint in Windows and macOS. PowerPoint is the best application for opening PPT files because it fully supports the formatting of the presentations, including the placement of text, slide transitions and effects, and images and shapes in the presentation. PowerPoint is also available for Android and iOS devices.","Many presentation programs can open and edit PPT files, but they may not fully support the formatting of the presentation files. Alternative programs include Corel Presentations (Windows), Apple Keynote (Mac), and Apache OpenOffice Impress (multiplatform). If you are a Mac user simply looking to view a PPT file, you can use Apple Preview , which comes bundled with macOS.","You can also open PPT files with various web programs. For example, Google Slides is a free option you can access with a Google account. The web tool allows you to upload a PPT file and view, edit, save, and convert the presentation."]},"scraped_at":"2025-08-09T21:58:54.684370","source":{"url":"https://fileinfo.com/extension/ppt","file":"ppt.html"}}