{"slug":"sys","extension":"sys","name":"Windows System File","category":"windows-system-file","summary":"","developer_org":"motorola","developer_name":"Motorola","more_information":{"description":["System files are most commonly found within the C:\\​Windows directory of a Windows installation. If you have Windows Vista or a later version installed the bulk of your SYS files will be located in the following directories:","You may also encounter SYS files when trying to correct a device driver issue in Windows. The device driver, which is a program that enables Windows to interact with hardware, such as a keyboard, printer, or monitor, may have been deleted, become corrupt, or need to be updated.","Ideally, you should update device drivers via Windows Update to fix these issues. You can do this by selecting Settings → Update & Security → Windows Update → Check for updates → View optional updates → Driver updates .","However, you may need to manually update a device driver with an update package you downloaded from the device manufacturer's website. In this case, you can use the Device Manager included with Windows.","After extracting the package's contents (typically stored in a .ZIP archive) with the appropriate decompression utility, you will most likely encounter an .INF file accompanied by one or more SYS files. Follow these instructions to update the device driver with Device Manager:","NOTE: Since \"sys\" is short for \"system,\" SYS files are commonly pronounced as \"siss\" files."]},"common_filenames":[{"filename":"IO.SYS","description":"IO.SYS - This file stores the default DOS device drivers and the DOS initialization program. It is used by DOS and Windows 9x."},{"filename":"MSDOS.SYS","description":"MSDOS.SYS - This file contains the core operating system code for DOS, known as the DOS kernel ."},{"filename":"CONFIG.SYS","description":"CONFIG.SYS - This file contains the primary configuration information used by DOS."}],"updated_at":"2025-08-09","sources":[{"url":"sys.html","retrieved_at":"2025-08-09"}]}