{"slug":"tar","extension":"tar","name":"Tape Archive","summary":"A TAR file is an archive saved in the Tape Archive format. It contains multiple files that have been packaged together for easier storage and sharing. Notably, unlike .ZIP files and many other types of archives, TAR files are not compressed .","developer":"AT&T Labs","developer_slug":"at-t-labs","category":"Data Files","category_slug":"data-files","rating":3.7,"votes":141,"last_updated":"June 15, 2023","more_information":{"content":["AT&T Bell Laboratories developed the tar archiving utility and TAR archive format in 1979. Originally, tar was used to write data to tape drives, which are data storage devices that read and write data on magnetic tape. Thus, the archives tar created were referred to as Tape Archives.","These days, Linux and other Unix-like users are the primary source of TAR files. For example, Linux users often distribute software packages as TAR files, to make those programs easier to download and install. Many of these users refer to TAR files as tarballs, a nickname that references real-life tar balls' sticky, object-gathering nature.","While TAR files themselves are not compressed, users often compress them using tar or other compression utilities. This reduces a TAR file's file size, making it even easier to store and share. Primarily, users compress TAR files using Gzip compression, turning them into .TGZ or .TAR.GZ files.","In Windows, you can create a TAR file with 7-Zip . To do so:","In macOS and Linux, you can use the tar command-line command to create a TAR file. For example, you can enter the following command to create a TAR file:","tar -cf YourArchiveName.tar ~/path/to/your/files-or-folder","If you want to compress the TAR file you create in this process (creating a .TAR.GZ file), instead enter the following command:","tar -czf YourArchiveName.tar.gz ~/path/to/your/files-or-folder"],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/tar_105.png","srcset":"https://fileinfo.com/img/ss/md/tar_105.png 760w, https://fileinfo.com/img/ss/sm/tar_105.png 380w","alt":"Screenshot of a .tar file in 7-Zip","width":"380","height":"253","caption":"TAR file open in 7-Zip"}},"how_to_open":{"instructions":["You can open a TAR file, and extract the files it contains, with several common archive utilities, including:","Android users can open TAR files with ZDevs ZArchiver. iOS users can open TAR files with ComcSoft Corporation iZip."],"programs":[{"name":"7-Zip","url":"../software/igor_pavlov/7-zip.html"},{"name":"Apple Archive Utility","url":"../software/apple/archive_utility.html"},{"name":"PeaZip","url":"../software/peazip/peazip.html"},{"name":"B1 Free Archiver","url":"../software/catalina_group/b1_free_archiver.html"}]},"scraped_at":"2025-08-09T21:58:54.873154","source":{"url":"https://fileinfo.com/extension/tar","file":"tar.html"}}