{"slug":"tax2023","extension":"tax2023","name":"TurboTax 2023 Tax Return","category":"turbotax-2023-tax-return","summary":"","developer_org":"intuit","developer_name":"Intuit","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/tax2023_13658.png","alt":"Screenshot of a .tax2023 file in Intuit TurboTax 2023","caption":"TAX2023 file open in Intuit TurboTax 2023"},"description":["The 2023 desktop version of TurboTax is available in different editions based on your needs: Basic, Deluxe, Premier, and Home & Business. Each edition provides features tailored to your needs, and they all save tax returns as TAX2023 files.","With the Desktop Version : While preparing your tax return in the desktop version of TurboTax, you can save your progress as a TAX2023 file by selecting File → Save... and choosing your save options. To safeguard your tax return information with TurboTax, you can encrypt it with password protection while preparing it. With the Web Version : In TurboTax Online, you can download a TAX2023 file by clicking Tax Tools → Tools and selecting Save your 2023 return to your computer . This option initiates the download of the TAX2023 file ( taxReturn.tax2023 ). NOTE: Any modifications you make to the tax return in TurboTax Online after downloading the TAX2023 file will not update in the file since the app does not sync the changes. To update the file with changes, you must export the tax return again.","NOTE: Any modifications you make to the tax return in TurboTax Online after downloading the TAX2023 file will not update in the file since the app does not sync the changes. To update the file with changes, you must export the tax return again."]},"common_filenames":[{"filename":"Tax Return 23.tax2023","description":"Tax Return 23.tax2023 - Default name the desktop version of TurboTax in macOS gives to a new TAX2023 file."},{"filename":"taxReturn.tax2023","description":"taxReturn.tax2023 - Default name TurboTax Online gives to a TAX2023 file when downloading it to a computer."}],"images":[{"url":"https://fileinfo.com/img/ss/sm/tax2023_13658.png","alt":"Screenshot of a .tax2023 file in Intuit TurboTax 2023","caption":"TAX2023 file open in Intuit TurboTax 2023"}],"updated_at":"2025-08-09","sources":[{"url":"tax2023.html","retrieved_at":"2025-08-09"}]}