{"slug":"vscodeignore","extension":"vscodeignore","name":"Visual Studio Code Extension Ignore File","category":"visual-studio-code-extension-ignore-file","summary":"","developer_org":"microsoft","developer_name":"Microsoft","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/vscodeignore_12330.png","alt":"Screenshot of a .vscodeignore file in Microsft Visual Studio Code","caption":"VSCODEIGNORE file open in Microsft Visual Studio Code"},"description":["Microsoft Visual Studio Code is a popular cross-platform code editor. Developers who want to extend Visual Studio Code's capabilities can search for and install Visual Studio Code extensions, which contain one or more additional Visual Studio Code features. For the most part, developers search for and install extensions from Visual Studio Code's Extension Marketplace.","Any developer can create and publish an extension to the Visual Studio Code Extension Marketplace. To do so, a developer must first develop their extension in Visual Studio Code. Then, the developer must publish their extension to the Marketplace, using the Visual Studio Code Extensions command-line tool.","Often, a developer's extension project includes files that do not need to be part of the extension's final, published VSIX package. For example, a developer who developed their extension in TypeScript will likely want to exclude .TS files from the extension's VSIX package. To exclude files from an extension's VSIX file, a developer must create a VSCODEIGNORE file and place it within their extension project.","After creating a VSCODEIGNORE file, a developer can open the file and specify what source code files should be excluded when Visual Studio Code Extensions packages their extension. Developers specify file exclusions using a list of glob patterns. Any files that match a pattern are excluded from the extension's VSIX file."]},"images":[{"url":"https://fileinfo.com/img/ss/sm/vscodeignore_12330.png","alt":"Screenshot of a .vscodeignore file in Microsft Visual Studio Code","caption":"VSCODEIGNORE file open in Microsft Visual Studio Code"}],"updated_at":"2025-08-09","sources":[{"url":"vscodeignore.html","retrieved_at":"2025-08-09"}]}