{"slug":"vsixmanifest","extension":"vsixmanifest","name":"Visual Studio Extension Manifest","category":"visual-studio-extension-manifest","summary":"","developer_org":"microsoft","developer_name":"Microsoft","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/vsixmanifest_9025.png","alt":"Screenshot of a .vsixmanifest file in Microsoft Visual Studio Code","caption":"VSIXMANIFEST file open in Microsoft Visual Studio Code"},"description":["Microsoft Visual Studio and Visual Studio Code are IDEs that developers use to create programs. Both IDEs allow developers to install extensions that contain additional features. These extensions are saved as VSIX files. (However, VSIX files intended for use with Visual Studio are not compatible with Visual Studio Code, and vice-versa.)","Each VSIX file contains a VSIXMANIFEST file that describes that extension's name, function, publisher, assets, and installation information (including any dependencies and prerequisites). Typically, developers installing an extension will never need to view that extension's VSIXMANIFEST file. However, developers can extract a VSIX file's VSIXMANIFEST and open it in Visual Studio, Visual Studio Code, or any other text editor, to view the metadata it contains.","NOTE: When creating your own Visual Studio or Visual Studio Code extension, you must create a VSIXMANIFEST file and package it with that extension."]},"common_filenames":[{"filename":"Extension.vsixmanifest","description":"Extension.vsixmanifest - The name assigned to finalized VSIXMANIFEST files."},{"filename":"Source.extension.vsixmanifest","description":"Source.extension.vsixmanifest - The name assigned to in-development VSIXMANIFEST files."}],"images":[{"url":"https://fileinfo.com/img/ss/sm/vsixmanifest_9025.png","alt":"Screenshot of a .vsixmanifest file in Microsoft Visual Studio Code","caption":"VSIXMANIFEST file open in Microsoft Visual Studio Code"}],"updated_at":"2025-08-09","sources":[{"url":"vsixmanifest.html","retrieved_at":"2025-08-09"}]}