{"slug":"yaml","extension":"yaml","name":"YAML Document","summary":"A YAML file is a text document that contains data formatted using YAML (YAML Ain't Markup Language), a human-readable data format used for data serialization. It is used for reading and writing data independent of a specific programming language. YAML files are often configuration files, used to define the settings of a program or application.","developer":"N/A","developer_slug":"n-a","category":"Developer Files","category_slug":"developer-files","rating":3.7,"votes":60,"last_updated":"March 31, 2021","more_information":{"content":["Because the YAML format is not language-specific, YAML files can be included and referenced within programs written in any language that supports YAML libraries, such as C/C++, Ruby, Python, Java, Perl, C#, and PHP. The YAML acronym originally stood for Yet Another Markup Language, but as the YAML format evolved, the acronym adopted its current, recursive meaning.","If a program uses a YAML file as a settings file, you can edit the program's settings by opening and editing the YAML file in a text or source code editor. Most settings-related YAML files include comments that explain how the file can be used to adjust a program's settings.","NOTE: While the programmer community recommends saving YAML files with the YAML extension, you might also encounter YAML files saved using the .YML extension."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/yaml_8750.png","srcset":"https://fileinfo.com/img/ss/md/yaml_8750.png 760w, https://fileinfo.com/img/ss/sm/yaml_8750.png 380w","alt":"Screenshot of a .yaml file in GitHub Atom","width":"380","height":"253","caption":"YAML file open in GitHub Atom"}},"how_to_open":{"instructions":["You can open a YAML file in any text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (Mac). However, if you intend to edit a YAML file, you should open it using a source code editor, such as NotePad++ (Windows) or GitHub Atom (cross-platform). These applications provide helpful source code editing tools and highlight YAML syntax correctly."]},"scraped_at":"2025-08-09T21:58:55.282375","source":{"url":"https://fileinfo.com/extension/yaml","file":"yaml.html"}}