[{"slug":"css","extension":"css","name":"Cascading Style Sheet","summary":"A CSS file is a cascading style sheet ( CSS ) file used to format the contents of a webpage. It contains customized global properties for how to display HTML elements. For example, CSS files can define the size, color, font, line spacing, indentation, borders, and location of HTML elements.","developer":"W3C","developer_slug":"w3c","category":"Web Files","category_slug":"web-files","rating":4,"votes":213,"last_updated":"August 19, 2021","how_to_open":{"instructions":["You can open and edit CSS files with various web development applications and source code editors. Examples of programs that support CSS files include Adobe Dreamweaver (Windows and macOS), Adobe ColdFusion Builder (Windows and macOS), and Microsoft Visual Studio Code (multiplatform).","Since CSS files are saved in plain text, you can also open them with text editors, including Microsoft Notepad (bundled with Windows) and Apple TextEdit (bundled with macOS). However, you should use web development tools or source code editors to edit CSS files, if possible, because they provide more advanced features, such as syntax highlighting."]},"scraped_at":"2025-08-09T21:58:54.955203","source":{"url":"https://fileinfo.com/extension/css","file":"css.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"htm","extension":"htm","name":"Hypertext Markup Language File","summary":"An HTM file is a webpage written using Hypertext Markup Language ( HTML ). It contains tags and text that define the webpage's layout and content. HTM files are the same as .HTML files.","developer":"WHATWG","developer_slug":"whatwg","category":"Web Files","category_slug":"web-files","rating":3.8,"votes":267,"last_updated":"March 31, 2023","how_to_open":{"instructions":["You can open an HTM file with Microsoft Visual Studio Code (multiplatform) or any other text or source code editor, to view the HTML it contains. Opening an HTM file in a source code editor will highlight the file's HTML syntax, which makes reviewing and editing the file easier.","You can also open an HTM file in any web browser, such as Google Chrome (multiplatform), Microsoft Edge (multiplatform), or Apple Safari (Mac, iOS), to preview the webpage it contains."]},"scraped_at":"2025-08-09T21:58:54.949221","source":{"url":"https://fileinfo.com/extension/htm","file":"htm.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"html","extension":"html","name":"Hypertext Markup Language File","summary":"An HTML file contains Hypertext Markup Language ( HTML ) that formats the structure of a webpage. It is stored in a standard text format and contains tags that define the page layout and content of the webpage, including the text, tables, images, and hyperlinks displayed on the webpage. HTML files are widely used online and displayed in web browsers.","developer":"WHATWG","developer_slug":"whatwg","category":"Web Files","category_slug":"web-files","rating":3.5,"votes":1837,"last_updated":"January 12, 2022","how_to_open":{"instructions":["You can open and edit HTML files with various source code editors and web development applications. Microsoft Visual Studio Code (multiplatform) is a helpful source code editor and Adobe Dreamweaver (multiplatform) is a popular web development application.","Since HTML language is saved in plain text, you can also open and edit HTML files with a basic text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (Mac). However, these text editors do not come with features included with source code editors and web development apps that make it easier for developers to code.","You can preview an HTML webpage by opening it with a web browser, such as Google Chrome (multiplatform), Microsoft Edge (multiplatform), Mozilla Firefox (multiplatform), or Apple Safari (Mac and iOS)."]},"scraped_at":"2025-08-09T21:58:54.941881","source":{"url":"https://fileinfo.com/extension/html","file":"html.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"js","extension":"js","name":"JavaScript File","summary":"A JS file is a plain text file that contains JavaScript code. It is used to execute JavaScript instructions in a webpage. JS files may include functions that open and close windows, validate form fields, enable rollover images, or create dropdown menus.","developer":"ECMA International","developer_slug":"ecma-international","category":"Web Files","category_slug":"web-files","rating":4,"votes":312,"last_updated":"April 22, 2022","how_to_open":{"instructions":["You can open and edit a JS file in any text or source code editor. Source code editors, such as Microsoft Visual Studio Code and GitHub Atom contain helpful syntax-highlighting and code-editing tools that make reading and editing JS files easier."]},"scraped_at":"2025-08-09T21:58:54.963595","source":{"url":"https://fileinfo.com/extension/js","file":"js.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"json","extension":"json","name":"JavaScript Object Notation File","summary":"A JSON file is a file that stores simple data structures and objects in JavaScript Object Notation (JSON) format, which is a standard data interchange format. It is primarily used for transmitting data between a web application and a server. JSON files are lightweight, text-based, human-readable, and can be edited using a text editor.","developer":"Douglas Crockford","developer_slug":"douglas-crockford","category":"Web Files","category_slug":"web-files","rating":3.8,"votes":3505,"last_updated":"November 2, 2023","how_to_open":{"instructions":["Because JSON files are plain text files, you can open them in any text editor, including:","You can also open a JSON file in the Google Chrome and Mozilla Firefox web browsers by dragging and dropping the file into your browser window."],"programs":[{"name":"Microsoft Visual Studio Code","url":"../software/microsoft/visual_studio_code.html"},{"name":"Microsoft Notepad","url":"../software/microsoft/notepad.html"},{"name":"Apple TextEdit","url":"../software/apple/textedit.html"},{"name":"Vim","url":"../software/vim/vim.html"}]},"scraped_at":"2025-08-09T21:58:54.970150","source":{"url":"https://fileinfo.com/extension/json","file":"json.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"php","extension":"php","name":"PHP Source Code File","summary":"A PHP file is a webpage that contains PHP (Hypertext Preprocessor) code. It may include PHP functions that can process online forms, get the date and time, or access information from a database, such as a MySQL database.","developer":"The PHP Group","developer_slug":"the-php-group","category":"Web Files","category_slug":"web-files","rating":4.1,"votes":644,"last_updated":"August 19, 2021","how_to_open":{"instructions":["You can open and edit PHP files with various source code editors and PHP-dedicated applications with IDEs . Examples of these programs include Eclipse PHP Development Tools (Windows and macOS), MPSoftware phpDesigner (Windows), Adobe Dreamweaver (Windows and macOS), Zend Studio (multiplatform), and Microsoft Visual Studio Code (multiplatform).","Since PHP files are saved in plain text, you can also open them with text editors, including Microsoft Notepad (bundled with Windows) and Apple TextEdit (bundled with macOS)."]},"scraped_at":"2025-08-09T21:58:54.988457","source":{"url":"https://fileinfo.com/extension/php","file":"php.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"xd","extension":"xd","name":"Adobe XD Document","summary":"An XD file is a website or mobile application mockup created using Adobe XD, a user interface (UI) and user experience (UX) design tool. It contains one or more artboards, which themselves contain layer-based graphic design elements, such as images, shapes, and text. XD files are used to prototype the look, feel, and workflows of websites and mobile applications, before developers begin developing those sites or applications.","developer":"Adobe Systems","developer_slug":"adobe-systems","category":"Web Files","category_slug":"web-files","rating":4.2,"votes":27,"last_updated":"September 21, 2022","how_to_open":{"instructions":["You can open an XD file in Adobe XD (cross-platform). To do so, select File → Open from Your Computer... from the program's menu bar. Then, navigate to and open your XD file.","Those who do not have access to Adobe XD can open XD files in PSDETCH (web), Photopea (web), or Bohemian Coding Sketch (Mac) to view the artboards and elements their XD file contains.","To convert an XD file to a .PNG , .SVG , .PDF , or .JPG file, you can:"]},"scraped_at":"2025-08-09T21:58:55.163836","source":{"url":"https://fileinfo.com/extension/xd","file":"xd.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false}]