{"slug":"cr2","extension":"cr2","name":"Canon Raw 2 Image","category":"canon-raw-2-image","summary":"","developer_org":"bondware","developer_name":"Bondware","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/cr2_1859.png","alt":"Screenshot of a .cr2 file in Adobe Photoshop","caption":"CR2 file open in Adobe Photoshop"},"description":["Typically, professional-grade digital cameras save photos as camera raw files. Camera raw files contain an unprocessed copy of all the data a camera captured when taking a photo. Retaining all this data allows photographers to, among other things, edit their photos more precisely and print them at higher quality. (In contrast, non-professional cameras usually process and compress photos before storing them as .JPG files.)","Each manufacturer's digital cameras save photos in their own particular camera raw formats . Most Canon cameras released between 2004 and 2018 save photos in the CR2 format (extended from TIFF ). This format replaced Canon's previous camera raw format, .CRW , with the release of the EOS 20D. It has itself been replaced by the .CR3 format, with the release of the EOS M50.","Professional and hobbyist photographers often import CR2 files into Canon photo-editing software and other photo editors, like Adobe Photoshop. They then use these programs to edit and/or print the photos their CR2 files contain. So, if you're looking to edit or print a high-quality photo, you may want to keep your photo saved in the CR2 format and open it with a professional image editor.","On the other hand, if you want to share the photo a CR2 file contains, you'll likely want to convert it to JPG or .PNG . Doing so will reduce the file's size considerably, making it easier to share. Just be aware that converting a CR2 file will discard some of the camera raw data the file contains. Thus, you may want to create a copy of your CR2 file before converting it, if you plan to edit or print your photo in the future."]},"images":[{"url":"https://fileinfo.com/img/ss/sm/cr2_1859.png","alt":"Screenshot of a .cr2 file in Adobe Photoshop","caption":"CR2 file open in Adobe Photoshop"}],"updated_at":"2025-08-09","sources":[{"url":"cr2.html","retrieved_at":"2025-08-09"}]}