{"slug":"crypt10","extension":"crypt10","name":"WhatsApp Encrypted Database File","category":"whatsapp-encrypted-database-file","summary":"","developer_org":"whatsapp","developer_name":"WhatsApp","more_information":{"description":["WhatsApp is a common messaging app used worldwide on various devices, including computer and mobile devices running Android and iOS. Among its features, the app provides database encryption to secure your messages.","Throughout its different versions, WhatsApp has encrypted databases with different algorithms. The Android version of WhatsApp encrypted databases ( .DB files) and appends a .crypt file extension to the DB file, creating a .db.crypt file.","Additionally, a number follows the extension to signify the version of the algorithm. Besides .crypt10 , other extensions include .CRYPT7 , .CRYPT8 , and .CRYPT12 files.","You can find CRYPT10 database files on the SD card of Android devices with WhatsApp Messenger installed. For example, you can find the CRYPT10 file (or other WhatsApp encrypted database file) in the following location:","/​sdcard/​WhatsApp/​Databases","Additionally, you may find multiple CRYPT10 database files in the \"Databases\" folder, with YYYY-MM-DD dates included in their filenames. WhatsApp adds these dates to signify when the app created the backup files.","You can delete these dated backup files to free up space on your SD card without affecting your WhatsApp messages. However, you should always keep the most recently dated one or two CRYPT10 files if you need to restore your WhatsApp message history."]},"common_filenames":[{"filename":"msgstore.db.crypt10","description":"msgstore.db.crypt10 - Name of the file that contains the encrypted message history."},{"filename":"msgstore-YYYY-MM-DD.db.crypt10","description":"msgstore-YYYY-MM-DD.db.crypt10 - Name of a recent WhatsApp message backup file. The YYYY-MM-DD indicates the date in which the backup was created."},{"filename":"YYYY-MM-DD","description":"msgstore-YYYY-MM-DD.db.crypt10 - Name of a recent WhatsApp message backup file. The YYYY-MM-DD indicates the date in which the backup was created."}],"updated_at":"2025-08-09","sources":[{"url":"crypt10.html","retrieved_at":"2025-08-09"}]}