{"slug":"deb","extension":"deb","name":"Debian Software Package","summary":"A DEB file is a software package used by the Debian Linux distribution and its variants, such as Ubuntu. DEB files are used primarily to install or update Unix applications. Each DEB file is a standard Unix archive that contains two .TAR archives: one for installer control information and another for installable data.","developer":"Debian Project","developer_slug":"debian-project","category":"Compressed Files","category_slug":"compressed-files","rating":4,"votes":453,"last_updated":"February 2, 2022","more_information":{"content":["Debian, Ubuntu, and other supported Linux distribution users install and manage DEB files using either the Debian package management system (dpkg) or APT package management software. Users can also decompress DEB files to view their contents before installation. The TAR archives that DEB files contain are commonly compressed using bzip or gzip compression.","Some Debian packages are available as .UDEB files, which are also known as udebs or \"micro debs.\" UDEB files are structured similarly to DEB files, but they contain only the essential files a program needs to function."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/deb_1949.png","srcset":"https://fileinfo.com/img/ss/md/deb_1949.png 760w, https://fileinfo.com/img/ss/sm/deb_1949.png 380w","alt":"Screenshot of a .deb file in File Viewer Plus 4","width":"380","height":"253","caption":"DEB file open in File Viewer Plus 4"}},"how_to_open":{"instructions":["You can install the software stored in a DEB file in a supported Linux distribution, such as Debian or Ubuntu, using the dpkg command. For example, to install an example.deb file, enter dpkg -i /path/to/example.deb on the Linux command line.","iOS device users who have jailbroken their device can install the software a DEB file contains using Cydia (iOS) or iFunbox (Windows, Mac).","You can also extract the contents of a DEB file with decompression utility, such as 7-Zip (Windows), B1 Free Archiver (multiplatform), or PeaZip (Windows, Linux)."]},"scraped_at":"2025-08-09T21:58:54.917933","source":{"url":"https://fileinfo.com/extension/deb","file":"deb.html"}}