{"slug":"idml","extension":"idml","name":"Adobe InDesign Markup Language File","category":"adobe-indesign-markup-language-file","summary":"","developer_org":"adobe-systems","developer_name":"Adobe Systems","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/idml_4804.png","alt":"Screenshot of a .idml file in Adobe InDesign 2021","caption":"IDML file open in Adobe InDesign 2021"},"description":["Adobe designed the InDesign Markup Language to provide an interchangeable format for Adobe InDesign documents and a way for third-party tools to modify and assemble InDesign documents. The company introduced IDML files when it released InDesign CS4, replacing .INX files, which are more challenging to create and edit. However, InDesign still supports backward compatibility with INX files.","To create an IDML file with InDesign select File → Save As... and choose \"InDesign CS4 or later (IDML)\" from the \"Format\" dropdown list.","IDML packages contain a hierarchy of XML files and directories. The root directory of the archive contains a designmap.xml file, which specifies high-level document properties, as well as the document layout. The archive also contains the following folders, which are used to store parts of the document: Resources : Contains document elements, such as colors, fonts, and paragraph styles; includes Graphics.xml , Fonts.xml , Styles.xml , and Preferences.xml . Spreads : Stores document spreads. Stories : Contains all document stories. XML : Stores document elements and settings; includes BackingStory.xml , Tags.xml , and Mapping.xml . MasterSpreads : Contains MaterSpreads.xml , which specifies all master spreads displayed on document pages, such as rectangles, ellipses, groups, polygons, buttons, and text frames. META-INF : Stores the standard container.xml file for UCF packages."]},"images":[{"url":"https://fileinfo.com/img/ss/sm/idml_4804.png","alt":"Screenshot of a .idml file in Adobe InDesign 2021","caption":"IDML file open in Adobe InDesign 2021"}],"updated_at":"2025-08-09","sources":[{"url":"idml.html","retrieved_at":"2025-08-09"}]}