{"slug":"jpeg","extension":"jpeg","name":"JPEG Image","summary":"A JPEG file is an image saved in a compressed graphic format standardized by the Joint Photographic Experts Group ( JPEG ). It supports up to 24-bit color and utilizes lossy compression, which may noticeably reduce the image quality if high amounts are applied. Users commonly save digital photos and web graphics as JPEG files.","developer":"Joint Photographic Experts Group","developer_slug":"joint-photographic-experts-group","category":"Raster Image Files","category_slug":"raster-image-files","rating":4,"votes":610,"last_updated":"April 19, 2022","more_information":{"content":["In the early 1980s, no technology allowed users to easily compress and share digital images. In 1982, the JPEG workgroup began designing a compression standard for reducing the size of image files, making them easier to share while retaining as much of their quality as possible.","In 1992, the workgroup created the JPEG file format, and many technologies adopted the format. Since then, it has become the most common image compression standard and allows users to produce sharable, high-quality image files.","The JPEG format utilizes a lossy compression algorithm to reduce the size of images. The compression algorithm destroys some data within the original image file; however, the data loss is mostly unnoticeable to the human eye. The format also stores metadata that describes the contents of its file, such as the color space, color profile, and image dimension information.","NOTE: Image files saved in the JPEG format are more commonly appended with the .JPG extension than the JPEG extension."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/jpeg_43-2.jpg","srcset":"https://fileinfo.com/img/ss/md/jpeg_43-2.jpg 760w, https://fileinfo.com/img/ss/sm/jpeg_43-2.jpg 380w","alt":"Screenshot of a .jpeg file in Microsoft Photos 2021","width":"380","height":"253","caption":"JPEG file open in Microsoft Photos 2021"}},"how_to_open":{"instructions":["You can open a JPEG file with a large number of free and commercial image viewing and editing applications available for desktop and mobile platforms. Some options include:","NOTE: You can also view a JPEG file with a web browser by dragging and dropping it into the browser window."],"programs":[{"name":"Microsoft Photos","url":"../software/microsoft/photos.html"},{"name":"Apple Preview","url":"../software/apple/preview.html"},{"name":"Adobe Photoshop","url":"../software/adobe/photoshop.html"},{"name":"Corel PaintShop Pro","url":"../software/corel/paintshop_pro.html"},{"name":"Google Photos","url":"../software/google/photos.html"}]},"scraped_at":"2025-08-09T21:58:54.716626","source":{"url":"https://fileinfo.com/extension/jpeg","file":"jpeg.html"}}