{"slug":"mp3","extension":"mp3","name":"MP3 Audio","summary":"An MP3 file is an audio file saved in a compressed audio format developed by the Moving Picture Experts Group ( MPEG ) that uses \"Layer 3\" audio compression ( MP3 ). MP3 files are commonly used to store audio tracks, podcasts, lectures, sermons, and audiobooks.","developer":"Moving Picture Experts Group","developer_slug":"moving-picture-experts-group","category":"Audio Files","category_slug":"audio-files","rating":4.1,"votes":1647,"last_updated":"March 22, 2022","more_information":{"content":["The MP3 format was developed in the early 1990s and released in 1993 by MPEG. The format soon became the standard for storing music since it could compress audio to a fraction of the size of other common audio file formats at the time (roughly 1/10 the size of an uncompressed .WAV or .AIF file). This was especially important due to the limited storage space computer hard drives provided at the time.","While the format compressed audio to much smaller file sizes than competing formats, it still provided near-CD quality sound (stereo, 16-bit). The quality of an MP3 file depended (and still does) largely on the bit rate used for compression. Common bit rates are 128, 160, 192, and 256 kbps. Higher bit rates result in higher-quality files that also require more disk space.","MP3 technology helped usher in a new era of music distribution in the 1990s and 2000s by allowing users to more easily and quickly download music online. This led to a rise in music piracy through sites like Napster and online music stores, such as Apple iTunes and Rhapsody.","Users would then play back MP3 files with audio software on their computer or burn the audio to CDs that could be played back in a CD player. As technology progressed users began downloading and transferring MP3 files to portable music players, such as Apple iPods and Microsoft Zune devices.","MP3 files are still used today for distributing audio online, such as songs or narrations. However, other more efficient audio compression formats, particularly .M4A , have since been released and adopted by online music stores and audio players."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/mp3_58.png","srcset":"https://fileinfo.com/img/ss/md/mp3_58.png 760w, https://fileinfo.com/img/ss/sm/mp3_58.png 380w","alt":"Screenshot of a .mp3 file in VideoLAN VLC media player","width":"380","height":"253","caption":"MP3 file open in VideoLAN VLC media player"}},"how_to_open":{"instructions":["You can open an MP3 file with most audio players. In Windows, you can use Microsoft Media Player , which is bundled with the operating system. In macOS, you can use Apple Music , which is bundled with that operating system.","A variety of other free and commercial audio players provide different playback features and conversion capabilities. Some of these audio players include VideoLAN VLC media player (multiplatform), Nullsoft Winamp (Windows), Eltima Elmedia Player (macOS), and olimsoft OPlayer (Android)."]},"scraped_at":"2025-08-09T21:58:54.806047","source":{"url":"https://fileinfo.com/extension/mp3","file":"mp3.html"}}