{"slug":"ods","extension":"ods","name":"OpenDocument Spreadsheet","summary":"An ODS file is a spreadsheet created by Calc, a spreadsheet program included with the LibreOffice and Apache OpenOffice suites. It stores data in cells organized into rows and columns, similar to .XLSX spreadsheets, and it may also contain charts, mathematical functions, and formatting. Several programs can open, edit, save, and convert ODS files, including the Calc apps in the LibreOffice and Apache OpenOffice suites and Microsoft Excel.","developer":"OASIS","developer_slug":"oasis","category":"Spreadsheet Files","category_slug":"spreadsheet-files","rating":3.5,"votes":280,"last_updated":"May 12, 2023","more_information":{"content":["LibreOffice and Apache OpenOffice are open-source alternatives to Microsoft Office . Calc is included with LibreOffice and Apache OpenOffice and the equivalent to Microsoft Excel .","The software allows users to create spreadsheets to save project trackers, budgets, to-do lists, and other spreadsheet types. Calc saves users' spreadsheets as ODS files by default. To create an ODS file in Calc, select File → New → Spreadsheet , then select File → Save As .","ODS files are formatted using the OASIS OpenDocument XML-based standard, which The Organization for the Advancement of Structured Information Standards (OASIS) maintains. LibreOffice, OpenOffice, and other variants, all of which save spreadsheets as ODS files, use this standard."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/ods_1215.png","srcset":"https://fileinfo.com/img/ss/md/ods_1215.png 760w, https://fileinfo.com/img/ss/sm/ods_1215.png 380w","alt":"Screenshot of a .ods file in Apache OpenOffice Calc 4","width":"380","height":"253","caption":"ODS file open in Apache OpenOffice Calc 4"}},"how_to_open":{"instructions":["You can open an ODS file with OpenOffice Calc and LibreOffice Calc . Calc is the best option for opening ODS files because it fully supports the formatting of OpenDocument spreadsheets, which may include the spacing of data fields, graphs, etc.","Various other spreadsheet applications can open and edit ODS files, but they may not fully support the formatting of the original spreadsheets. Alternative programs include Microsoft Excel and Google Sheets ."]},"scraped_at":"2025-08-09T21:58:54.669655","source":{"url":"https://fileinfo.com/extension/ods","file":"ods.html"}}