{"slug":"ogg","extension":"ogg","name":"Ogg Vorbis Audio","summary":"An OGG file is an audio file, similar to an .MP3 file, that typically stores music. It contains audio data saved in the Ogg container format and compressed with Vorbis audio compression. OGG files may also include song metadata , such as artist information and track data.","developer":"Xiph.Org","developer_slug":"xiph.org","category":"Audio Files","category_slug":"audio-files","rating":3.9,"votes":315,"last_updated":"March 30, 2022","more_information":{"content":["The Ogg container format is a multimedia format that supports multiple streams of video, audio, text, and metadata. The individual streams may be compressed with different compression methods, including Theora (video), Vorbis (audio), Opus (audio), FLAC (audio), and OggPCM (audio).","Before 2007, OGG files were used to store various types of media, but since then the Xiph.Org Foundation recommends that OGG files store only audio data. Now, you will most likely encounter only OGG files that store audio data compressed with Vorbis compression.","However, OGG files can also use other types of audio compression, including FLAC and Speex. These files cannot officially be referred to as Vorbis files, since they use a different compression scheme. Also, they are typically saved as .OGA files."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/ogg_413.png","srcset":"https://fileinfo.com/img/ss/md/ogg_413.png 760w, https://fileinfo.com/img/ss/sm/ogg_413.png 380w","alt":"Screenshot of a .ogg file in Adobe Audition 2021","width":"380","height":"253","caption":"OGG file open in Adobe Audition 2021"}},"how_to_open":{"instructions":["You can open OGG files with various audio players. Examples of software you can play OGG files with include Microsoft Media Player (bundled with Windows), VideoLAN VLC media player (multiplatform), Nullsoft Winamp (Windows), MPlayer (multiplatform), and Adobe Audition (multiplatform)."]},"scraped_at":"2025-08-09T21:58:54.838684","source":{"url":"https://fileinfo.com/extension/ogg","file":"ogg.html"}}