{"slug":"php","extension":"php","name":"PHP Source Code File","summary":"A PHP file is a webpage that contains PHP (Hypertext Preprocessor) code. It may include PHP functions that can process online forms, get the date and time, or access information from a database, such as a MySQL database.","developer":"The PHP Group","developer_slug":"the-php-group","category":"Web Files","category_slug":"web-files","rating":4.1,"votes":644,"last_updated":"August 19, 2021","more_information":{"content":["PHP files are typically only used by web developers who are creating or modifying them when developing webpages with extended functionality. However, average users may download PHP files from a webpage using a web browser, such as Google Chrome or Mozilla Firefox.","The PHP code within the webpage is processed (parsed) by a PHP engine on the web server, which dynamically generates HTML . The HTML, which contains the webpage content, is then sent to the user's web browser. Therefore, the user never sees the actual PHP code contained in the webpage, even when viewing the page source."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/php_130.png","srcset":"https://fileinfo.com/img/ss/md/php_130.png 760w, https://fileinfo.com/img/ss/sm/php_130.png 380w","alt":"Screenshot of a .php file in Adobe Dreamweaver 2021","width":"380","height":"253","caption":"PHP file open in Adobe Dreamweaver 2021"}},"how_to_open":{"instructions":["You can open and edit PHP files with various source code editors and PHP-dedicated applications with IDEs . Examples of these programs include Eclipse PHP Development Tools (Windows and macOS), MPSoftware phpDesigner (Windows), Adobe Dreamweaver (Windows and macOS), Zend Studio (multiplatform), and Microsoft Visual Studio Code (multiplatform).","Since PHP files are saved in plain text, you can also open them with text editors, including Microsoft Notepad (bundled with Windows) and Apple TextEdit (bundled with macOS)."]},"scraped_at":"2025-08-09T21:58:54.988457","source":{"url":"https://fileinfo.com/extension/php","file":"php.html"}}