{"slug":"pjpg","extension":"pjpg","name":"Progressive JPEG Image","category":"progressive-jpeg-image","summary":"","developer_org":"n-a","developer_name":"N/A","more_information":{"screenshot":{"url":"https://fileinfo.com/img/ss/sm/pjpg_6125.jpg","alt":"Screenshot of a .pjpg file in Apple Preview 11","caption":"PJPG file open in Apple Preview 11"},"description":["The purpose of the PJPEG format is to provide a lower-resolution preview of an image as a web browser loads it through multiple passes, progressively increasing the image quality as it loads the scans (typically 3 to 5). PJPEG differs from the standard Baseline JPEG format, which stores a complete, top-to-bottom scan of the image (the final scan in the PJPEG format).","For example, when browsing the web with a slow internet connection, you could possibly wait 30 seconds for an image on a webpage saved in the Baseline JPEG format to load line by line in a blank space on the page. However, a web browser loading an image saved in the PJPEG format loads scans of the image that progressively increase in quality with each pass, allowing you to quickly see a low-resolution version of the image (likely blurry and pixelated) that improves (becomes sharper and less pixelated) as the browser loads progressive PJPEG image scans.","Progressive JPEG save dialog in Adobe Photoshop 2023 Various image editors allow you to save JPEG images in the Progressive JPEG format. For example, Adobe Photoshop can export images in the Progressive JPEG format and allows you to choose the number of scans (3 to 5). To do this: Select File → Save a Copy . Coose JPEG from the \"Format\" dropdown menu and click Save . Select Progressive under the \"Format Options,\" choose the number of scans, then click OK . NOTE: Although Photoshop saves the image in the Progressive JPEG format, it saves it as a JPG file, not a PJPG file.","Various image editors allow you to save JPEG images in the Progressive JPEG format. For example, Adobe Photoshop can export images in the Progressive JPEG format and allows you to choose the number of scans (3 to 5). To do this:","NOTE: Although Photoshop saves the image in the Progressive JPEG format, it saves it as a JPG file, not a PJPG file."]},"images":[{"url":"https://fileinfo.com/img/ss/sm/pjpg_6125.jpg","alt":"Screenshot of a .pjpg file in Apple Preview 11","caption":"PJPG file open in Apple Preview 11"},{"url":"https://fileinfo.com/img/ss/sm/pjpg_6125-2.png","alt":"Progressive JPEG save dialog in Adobe Photoshop 2023","caption":"Progressive JPEG save dialog in Adobe Photoshop 2023"}],"updated_at":"2025-08-09","sources":[{"url":"pjpg.html","retrieved_at":"2025-08-09"}]}