{"slug":"tex","extension":"tex","name":"LaTeX Source Document","summary":"A TEX file is a source document prepared by LaTeX, a high-quality typesetting system. It may include text, symbols, mathematical expressions, and graphics. Academic and professional users in computer science, electrical engineering, statistics, economics, and physics often utilize TEX files when typesetting articles, books, and other publications.","developer":"Donald Knuth","developer_slug":"donald-knuth","category":"Text Files","category_slug":"text-files","rating":3.7,"votes":128,"last_updated":"June 23, 2022","more_information":{"content":["LaTeX documents, such as TEX files, contain plain text with tags and other LaTeX syntax that define the document's structure, such as a letter, book, or article. This formatting differs from the inline text formatting utilized in word processor documents like .DOCX and .ODT files.","Common word processors, such as Microsoft Word, OpenOffice Writer, and Corel WordPerfect, are often referred to as WYSIWYG programs. These word processors enable you to see how your text appears as you create it.","LaTeX applications, such as TeXworks and Texmaker, may be referred to as \"WYSIWYM,\" which stands for \"what you see is what you mean.\" Instead of seeing the text formatted in the document, a LaTeX processing system handles the visual formatting based on the tags and other LaTeX syntax defining the document's structure. Therefore, a LaTeX document may look different depending on the LaTeX application used to display the file.","NOTE: TEX files may also be saved with the .ltx ( .LTX file) or .latex ( .LATEX file) extension."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/tex_311.png","srcset":"https://fileinfo.com/img/ss/md/tex_311.png 760w, https://fileinfo.com/img/ss/sm/tex_311.png 380w","alt":"Screenshot of a .tex file in TeXworks 0.6.6","width":"380","height":"253","caption":"TEX file open in TeXworks 0.6.6"}},"how_to_open":{"instructions":["You can open TEX files with various LaTeX applications, such as TeXworks (multiplatform), MiKTeX (multiplatform), and Texmaker (multiplatform).","Since TEX files store documents in plain text, you can also open and edit the files with a text editor, such as Microsoft Notepad (bundled with Windows) or Apple TextEdit (bundled with macOS). However, these text editors do not provide helpful LaTeX syntax highlighting features available with LaTeX applications."]},"scraped_at":"2025-08-09T21:58:55.233892","source":{"url":"https://fileinfo.com/extension/tex","file":"tex.html"}}