{"slug":"xls","extension":"xls","name":"Microsoft Excel Spreadsheet (Legacy)","summary":"An XLS file is a spreadsheet file created by Microsoft Excel or exported by another spreadsheet program, such as OpenOffice Calc or Apple Numbers. It contains one or more worksheets that store data in a table format and may include mathematical functions, charts, styles, and formatting. Microsoft replaced XLS files with .XLSX files when it released Excel 2007, but Excel and other spreadsheet applications can still open XLS files.","developer":"Microsoft","developer_slug":"microsoft","category":"Spreadsheet Files","category_slug":"spreadsheet-files","rating":3.8,"votes":801,"last_updated":"June 14, 2023","more_information":{"content":["Microsoft introduced the Excel Spreadsheet (XLS) binary format in 1987 when it released Excel. The XLS format stores one or more worksheets comprising a spreadsheet and a table with rows and columns of cells . Additionally, the cells in a table may contain manually-entered data or the results computed from the data of other cells.","After Microsoft introduced XLS files in 1987, the file type became one of the most common types for saving spreadsheets until the release of Excel 2007, when Microsoft released Excel 2007, introducing the Microsoft Excel Open XML Spreadsheet (XLSX) format. Spreadsheet files saved in the XLSX format bear the .xlsx file extension, replacing the .xls file extension.","While XLS files are no longer as common as they once were, you may still encounter them in home, school, and business environments when organizing, analyzing, manipulating, or visualizing data. For example, a co-worker may send you an XLS spreadsheet storing financial data from the 1990s."],"screenshot":{"url":"https://fileinfo.com/img/ss/sm/xls_121.png","srcset":"https://fileinfo.com/img/ss/md/xls_121.png 760w, https://fileinfo.com/img/ss/sm/xls_121.png 380w","alt":"Screenshot of a .xls file in Microsoft Excel 365","width":"380","height":"253","caption":"XLS file open in Microsoft Excel 365"}},"how_to_open":{"instructions":["You can open XLS files with Microsoft Excel in Windows and macOS. Excel is the best program for opening XLS files because it fully supports the formatting of Excel spreadsheets, which includes data fields and graphs. Excel is also available for Android and iOS devices.","Many other spreadsheet programs can open and edit XLS files, but they may not fully support the formatting of XLS spreadsheets. Alternative programs include Corel Quattro Pro (Windows), Apple Numbers (Mac), and OpenOffice Calc (cross-platform).","You can also open XLS files with various web programs. Google Sheets is a great free option that allows you to upload an XLS file and view, edit, save, and convert the spreadsheet."]},"scraped_at":"2025-08-09T21:58:54.650864","source":{"url":"https://fileinfo.com/extension/xls","file":"xls.html"}}