[{"slug":"csv","extension":"csv","name":"Comma-Separated Values File","summary":"A CSV file is a comma-separated values file commonly used by spreadsheet programs such as Microsoft Excel or OpenOffice Calc. It contains plain text data sets separated by commas, with each new line in the CSV file representing a new database row and each database row consisting of one or more fields separated by a comma.","developer":"N/A","developer_slug":"n-a","category":"Data Files","category_slug":"data-files","rating":3.3,"votes":1790,"last_updated":"November 2, 2023","how_to_open":{"instructions":["You can open CSV files with a large number of applications, including Microsoft Excel (multiplatform), OpenOffice Calc (multiplatform), Corel Quattro Pro (Windows), and Apple Numbers . You can upload CSV files to Google Sheets and view, edit, save, and convert the files. And you can open CSV files with various mobile apps, including Microsoft Excel (Android and iOS), Apple Numbers (iOS), and Google Sheets (Android and iOS).","Since CSV files are saved as plain text you can open them with a plain text editor, such as Microsoft Notepad (Windows) and Apple TextEdit (macOS)."]},"scraped_at":"2025-08-09T21:58:54.676863","source":{"url":"https://fileinfo.com/extension/csv","file":"csv.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"fig","extension":"fig","name":"MATLAB Figure File","summary":"A FIG file contains a figure created by The MathWorks MATLAB, an application for mathematical computations and data analysis. It stores one or more plots or graphs, which MATLAB uses to visualize data. FIG files store information in a format similar to the MAT-file ( .MAT ) binary data container format.","developer":"The MathWorks","developer_slug":"the-mathworks","category":"Data Files","category_slug":"data-files","rating":3.8,"votes":16,"last_updated":"May 5, 2023","how_to_open":{"instructions":["You can open a FIG file with The MathWorks MATLAB (multiplatform). To open a FIG file, click a plot in the \"PLOTS\" tab, then select File → Open . You can also open a FIG file using the openfig(filename) function."]},"scraped_at":"2025-08-09T21:58:55.157531","source":{"url":"https://fileinfo.com/extension/fig","file":"fig.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"log","extension":"log","name":"Log File","summary":"A LOG file is a log used by various operating systems and programs. It typically contains a plain text log of certain events with their timestamps. LOG files may be created by the operating system to keep track of system events or by a software installation program to list location and names of installed files.","developer":"N/A","developer_slug":"n-a","category":"Data Files","category_slug":"data-files","rating":3.7,"votes":377,"last_updated":"July 21, 2016","scraped_at":"2025-08-09T21:58:55.239328","source":{"url":"https://fileinfo.com/extension/log","file":"log.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"odp","extension":"odp","name":"OpenDocument Presentation","summary":"An ODP file is a presentation created by Impress, a presentation program included with the LibreOffice and Apache OpenOffice suites. It contains a series of slides that may contain text, images, media, and transition effects. ODP files are similar to .PPTX files.","developer":"OASIS","developer_slug":"oasis","category":"Data Files","category_slug":"data-files","rating":3.8,"votes":71,"last_updated":"June 23, 2022","how_to_open":{"instructions":["You can open an ODP file with various presentation programs, including OpenOffice Impress (cross-platform), Microsoft PowerPoint (cross-platform), LibreOffice (cross-platform), and Google Slides (Web, iOS, Android, Chrome OS).","You can also convert your ODP file to a PPTX file in all those programs. Note that you may lose some formatting when you open an ODP file in a program other than OpenOffice or LibreOffice or convert an ODP file to another presentation format."]},"scraped_at":"2025-08-09T21:58:54.700650","source":{"url":"https://fileinfo.com/extension/odp","file":"odp.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"ppt","extension":"ppt","name":"Microsoft PowerPoint Presentation (Legacy)","summary":"A PPT file is an editable slide show created by Microsoft PowerPoint or exported by another presentation program, such as OpenOffice Impress or Apple Keynote. It may include formatted text, bullet points, images, movies, sound effects, and music. Users commonly build PPT files from templates with PowerPoint, but they may also create them from scratch.","developer":"Microsoft","developer_slug":"microsoft","category":"Data Files","category_slug":"data-files","rating":4,"votes":674,"last_updated":"June 7, 2022","how_to_open":{"instructions":["You can open PPT files with Microsoft PowerPoint in Windows and macOS. PowerPoint is the best application for opening PPT files because it fully supports the formatting of the presentations, including the placement of text, slide transitions and effects, and images and shapes in the presentation. PowerPoint is also available for Android and iOS devices.","Many presentation programs can open and edit PPT files, but they may not fully support the formatting of the presentation files. Alternative programs include Corel Presentations (Windows), Apple Keynote (Mac), and Apache OpenOffice Impress (multiplatform). If you are a Mac user simply looking to view a PPT file, you can use Apple Preview , which comes bundled with macOS.","You can also open PPT files with various web programs. For example, Google Slides is a free option you can access with a Google account. The web tool allows you to upload a PPT file and view, edit, save, and convert the presentation."]},"scraped_at":"2025-08-09T21:58:54.684370","source":{"url":"https://fileinfo.com/extension/ppt","file":"ppt.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"pptx","extension":"pptx","name":"Microsoft PowerPoint Presentation","summary":"A PPTX file is a presentation file created by Microsoft PowerPoint or exported by another presentation program, such as OpenOffice Impress or Apple Keynote. It contains a collection of slides, including their text, images, formatting, animations, drawn objects, and other media. PPTX files are commonly used in business meetings, marketing applications, and academic classroom settings.","developer":"Microsoft","developer_slug":"microsoft","category":"Data Files","category_slug":"data-files","rating":4.1,"votes":1145,"last_updated":"March 3, 2022","how_to_open":{"instructions":["You can open PPTX files with Microsoft PowerPoint in Windows and macOS. PowerPoint is the best program for opening PPTX files because it fully supports the formatting of the presentations, which includes the placement of text, slide transitions and effects, images, and shapes. The app is also available for Android and iOS devices.","There are a large number of other presentation programs that can open and edit PPTX files but they may not fully support the formatting of the presentation files. Alternative programs include Corel Presentations (Windows), Apple Keynote (Mac), and Apache OpenOffice Impress (multiplatform).","You can also open PPTX files with various web programs. Google Slides is a free option that allows you to upload a PPTX file and view, edit, save, and convert the presentation."]},"scraped_at":"2025-08-09T21:58:54.692505","source":{"url":"https://fileinfo.com/extension/pptx","file":"pptx.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"tar","extension":"tar","name":"Tape Archive","summary":"A TAR file is an archive saved in the Tape Archive format. It contains multiple files that have been packaged together for easier storage and sharing. Notably, unlike .ZIP files and many other types of archives, TAR files are not compressed .","developer":"AT&T Labs","developer_slug":"at-t-labs","category":"Data Files","category_slug":"data-files","rating":3.7,"votes":141,"last_updated":"June 15, 2023","how_to_open":{"instructions":["You can open a TAR file, and extract the files it contains, with several common archive utilities, including:","Android users can open TAR files with ZDevs ZArchiver. iOS users can open TAR files with ComcSoft Corporation iZip."],"programs":[{"name":"7-Zip","url":"../software/igor_pavlov/7-zip.html"},{"name":"Apple Archive Utility","url":"../software/apple/archive_utility.html"},{"name":"PeaZip","url":"../software/peazip/peazip.html"},{"name":"B1 Free Archiver","url":"../software/catalina_group/b1_free_archiver.html"}]},"scraped_at":"2025-08-09T21:58:54.873154","source":{"url":"https://fileinfo.com/extension/tar","file":"tar.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"xml","extension":"xml","name":"XML File","summary":"An XML file is an XML (Extensible Markup Language) data file. It contains a formatted dataset that is intended to be processed by a website, web application, or software program. XML files can be thought of as text-based databases.","developer":"WC3","developer_slug":"wc3","category":"Data Files","category_slug":"data-files","rating":3.6,"votes":750,"last_updated":"March 13, 2021","how_to_open":{"instructions":["You can open an XML file with any text editor or web browser . However, those who intend to edit an XML file should open it with an XML editor. XML editors provide helpful syntax highlighting, editing, and validation tools that make working with XML files easier.","Some popular XML editors include:"],"programs":[{"name":"SyncRO Soft oXygen XML Editor","url":"../software/syncro_soft/oxygen_xml_editor.html"},{"name":"Microsoft XML Notepad","url":"../software/microsoft/xml_notepad.html"},{"name":"Bare Bones BBEdit","url":"../software/bare_bones/bbedit.html"}]},"scraped_at":"2025-08-09T21:58:54.978741","source":{"url":"https://fileinfo.com/extension/xml","file":"xml.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false}]