[{"slug":"dmg","extension":"dmg","name":"Apple Disk Image","summary":"A DMG file is a mountable disk image primarily used to distribute software to the macOS operating system. Mac users typically download the file from the Internet and then double-click it to install an application on their computer.","developer":"Apple","developer_slug":"apple","category":"Disk Image Files","category_slug":"disk-image-files","rating":4.2,"votes":3410,"last_updated":"September 15, 2022","how_to_open":{"instructions":["You can open a DMG file by double-clicking the file. After clicking the file, the DiskImageMounter utility bundled with macOS verifies the disk image's integrity. After confirming the disk image, the utility mounts the virtual disk and places it on your desktop and in an Apple Finder window as if it was a CD or a USB flash drive inserted into the computer.","You can double-click the program icon (actually an APP file) in the Finder window to run the app. Or, you can drag the program icon to the Applications folder icon in that same window to move it to the Applications directory on your computer, then double-click the app directly from the Applications directory to run it.","You no longer need the DMG file after installing the software stored in the DMG file. Therefore, you can delete the DMG file after installing the software.","DMG files are Mac-specific and not intended for use in Windows. Therefore, if you download a DMG file from a website, check the site for a Windows version of the software (most likely distributed as an .EXE or .MSI file).","Although you cannot install software distributed via DMG files in Windows, several Windows applications can extract their contents, including 7-Zip and PeaZip . You can also attempt to convert the DMG file to an .IMG file with the DMG2IMG utility."]},"scraped_at":"2025-08-09T21:58:54.898639","source":{"url":"https://fileinfo.com/extension/dmg","file":"dmg.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"img","extension":"img","name":"Disc Image Data File","summary":"An IMG file is a disk image file created by various disk imaging applications, such as H+H Software Virtual CD. It stores an exact copy of the data on a CD or DVD and is used for backups and burning new discs.","developer":"N/A","developer_slug":"n-a","category":"Disk Image Files","category_slug":"disk-image-files","rating":4.1,"votes":254,"last_updated":"February 22, 2021","how_to_open":{"instructions":["You can use IMG files to create discs in several Windows programs, including:","When using a CloneCD IMG file to create a disc, you must also supply the CCD and SUB files associated with the CloneCD IMG file."],"programs":[{"name":"H+H Software Virtual CD","url":"../software/hh_software/virtual_cd.html"},{"name":"Lightning UK ImgBurn","url":"../software/lightning_uk/imgburn.html"},{"name":"MagicISO","url":"../software/magiciso/magiciso.html"}]},"scraped_at":"2025-08-09T21:58:55.189921","source":{"url":"https://fileinfo.com/extension/img","file":"img.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"iso","extension":"iso","name":"Disk Image File","summary":"An ISO file is a disk image that contains an exact duplicate of data from a source disk, such as an optical disc or hard drive . Computer users typically use ISO files to duplicate CD, DVD, or Blu-ray discs for sharing or backup purposes or download ISO files from a website to install software on a computer (e.g., downloading and installing the Windows 11 operating system). Additionally, users can mount ISO files, extract files from ISO files, and burn ISO files to optical discs.","developer":"International Organization for Standardization","developer_slug":"international-organization-for-standardization","category":"Disk Image Files","category_slug":"disk-image-files","rating":4.2,"votes":871,"last_updated":"June 15, 2023","how_to_open":{"instructions":["You can open ISO files in various ways, including mounting an ISO file and extracting files from an ISO file.","Mounting an ISO file is a software process that makes the folders and files in the ISO file readable by the computer (as if you inserted an actual CD or USB flash drive in the computer). In Windows 8 and later, you can mount an ISO file without third-party software by choosing the file and then selecting Manage → Mount in File Explorer.","In macOS, you can mount an ISO file by double-clicking the file. After clicking the file, the DiskImageMounter utility bundled with macOS verifies the disk image's integrity and mounts it after confirming the disk image.","You can extract files from an ISO archive to access individual files, such as .BIN or .CFG files. You can use various archive utilities, including Corel WinZip , 7-Zip , and RARLAB WinRAR to extract files from an ISO file.","While burning ISO files to discs is no longer as common as it once was, you may still want to burn an ISO file to a disc to create a physical backup or share data or media. In Windows 7 and later, you can right-click an ISO file and select Burn Disk Image . You can also burn ISO files to discs with third-party software, such as Roxio Toast and PowerISO ."]},"scraped_at":"2025-08-09T21:58:55.176118","source":{"url":"https://fileinfo.com/extension/iso","file":"iso.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"vdi","extension":"vdi","name":"VirtualBox Virtual Disk Image","summary":"A VDI file is a virtual disk image used by Oracle VM VirtualBox, an open-source desktop virtualization program. It is used to create a VirtualBox virtual machine . Virtual machines allow users to run additional operating systems and programs on their PCs.","developer":"Oracle","developer_slug":"oracle","category":"Disk Image Files","category_slug":"disk-image-files","rating":4,"votes":79,"last_updated":"April 22, 2021","how_to_open":{"instructions":["You can open a VDI file in Oracle VM VirtualBox (cross-platform) as part of creating a new virtual machine. To do so:"]},"scraped_at":"2025-08-09T21:58:55.203680","source":{"url":"https://fileinfo.com/extension/vdi","file":"vdi.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"vmdk","extension":"vmdk","name":"Virtual Machine Disk File","summary":"A VMDK file is a virtual disk that stores the contents of a virtual machine created by VMware Workstation or VMware Fusion. It is typically stored within a virtual machine package ( .VMWAREVM file), and the VMware software accesses it similarly to a physical hard disk. VMDK files may be set at a fixed size or configured to grow over time using VMware's Virtual Disk Manager.","developer":"VMware","developer_slug":"vmware","category":"Disk Image Files","category_slug":"disk-image-files","rating":4.1,"votes":45,"last_updated":"September 14, 2023","how_to_open":{"instructions":["You can open a VMDK file with VMware software, such as Workstation and Fusion . Both apps open the VMDK file automatically when starting up a virtual machine. However, you can also run a virtual machine by double-clicking the VMDK file.","Additionally, you can mount a VMDK file as a virtual disk with WinMount. Once WinMount mounts the VMDK file, you can delete, copy, and modify files in the virtual disk."]},"scraped_at":"2025-08-09T21:58:55.194909","source":{"url":"https://fileinfo.com/extension/vmdk","file":"vmdk.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false}]