[{"slug":"cfg","extension":"cfg","name":"Configuration File","summary":"A CFG file is a generic preference file that stores settings and configuration information. It is used by various programs, which means different CFG files may store data in different formats. CFG files typically should not be opened manually but may be saved in a text format that can be viewed in a text editor.","developer":"N/A","developer_slug":"n-a","category":"Settings Files","category_slug":"settings-files","rating":4.2,"votes":929,"last_updated":"August 24, 2016","how_to_open":{"instructions":["Windows users can open and edit celestia.cfg with Celestia Config Manager, a program designed specifically to allow Celestia users to manage their settings. Other users who want to open and edit celestia.cfg can do so with any text editor. Note, however, that editing celestia.cfg improperly can cause Celestia to function incorrectly."]},"scraped_at":"2025-08-09T21:58:55.269190","source":{"url":"https://fileinfo.com/extension/cfg","file":"cfg.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"conf","extension":"conf","name":"Unix Configuration File","summary":"A CONF file is a configuration or \"config\" file used on Unix and Linux based systems. It stores settings used to configure system processes and applications. CONF files are similar to .CFG files found on Windows and Macintosh systems.","developer":"N/A","developer_slug":"n-a","category":"Settings Files","category_slug":"settings-files","rating":3.9,"votes":220,"last_updated":"November 29, 2017","scraped_at":"2025-08-09T21:58:55.276187","source":{"url":"https://fileinfo.com/extension/conf","file":"conf.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"ini","extension":"ini","name":"Windows Initialization File","summary":"An INI file is a configuration file used by Windows programs to initialize program settings. It contains sections for settings and preferences (delimited by a string in square brackets) with each section containing one or more name and value parameters.","developer":"N/A","developer_slug":"n-a","category":"Settings Files","category_slug":"settings-files","rating":3.8,"votes":243,"last_updated":"February 26, 2019","how_to_open":{"instructions":["You can open INI files with FMJ-Software Awave Studio in Windows. Since INI files contain plain text, you can also open, view, and modify them with a text editor, such as Microsoft Notepad (Windows), Apple TextEdit , and gedit (Linux). However, incorrectly modifying an INI file will break it."]},"scraped_at":"2025-08-09T21:58:55.248025","source":{"url":"https://fileinfo.com/extension/ini","file":"ini.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"pkg","extension":"pkg","name":"Symbian Package File","summary":"A PKG file is a configuration file required to build a Symbian OS installer ( .SIS file). It contains plain text information that defines how a SIS creation program, such as CreateSIS and Easy SIS Creator, builds a SIS file. For example, PKG files typically define an application's supported languages, vendor name, software dependencies, files to copy, and digital signature details.","developer":"Nokia","developer_slug":"nokia","category":"Settings Files","category_slug":"settings-files","rating":4.2,"votes":642,"last_updated":"May 18, 2022","how_to_open":{"instructions":["Since PKG files are plain text files, you can open and edit them in any text editor, such as Microsoft Notepad (Windows) or Apple TextEdit (Mac). If you cannot open your PKG file in a text editor, you likely have a different type of PKG file. Other file types, such as macOS Installers and PlayStation Store Download Packages, also use the .pkg extension."]},"scraped_at":"2025-08-09T21:58:54.912262","source":{"url":"https://fileinfo.com/extension/pkg","file":"pkg.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false}]