{
  "name": "Audio",
  "slug": "audio",
  "count": 42,
  "items": [
    {
      "slug": "3gpp",
      "extension": "3gpp",
      "name": "3GPP Media File",
      "category": "audio",
      "summary": "A 3GPP file is a multimedia file saved in the 3GPP format developed by the 3rd Generation Partnership Project. It stores video and audio and is primarily used to transmit video over the Internet and save videos on 3G mobile phones.",
      "popularity": 0
    },
    {
      "slug": "aac",
      "extension": "aac",
      "name": "Advanced Audio Coding File",
      "category": "audio",
      "summary": "An AAC file is an audio file similar to an .MP3 file but compressed with Advanced Audio Coding (AAC), a lossy digital audio compression standard. The lossy compression maintains quality nearly indistinguishable from the original audio source, making it optimal for compressing music data.",
      "popularity": 0
    },
    {
      "slug": "adp",
      "extension": "adp",
      "name": "Access Data Project",
      "category": "audio",
      "summary": "An ADP file is a Microsoft Access project file. It contains settings that Access uses to connect to a Microsoft SQL Server database. ADP files are commonly referred to as Access Data Projects.",
      "popularity": 0
    },
    {
      "slug": "adts",
      "extension": "adts",
      "name": "Audio Data Transport Stream File",
      "category": "audio",
      "summary": "Audio file created in the Audio Data Transport Stream (ADTS) format; stores a series of audio frames, each of which includes a segment of the overall audio data to be transported; often used for streaming .AAC audio on the Internet.",
      "popularity": 0
    },
    {
      "slug": "aif",
      "extension": "aif",
      "name": "What are AIF files and how to open them",
      "category": "audio",
      "summary": "Having problems opening an AIF file?",
      "popularity": 0
    },
    {
      "slug": "aifc",
      "extension": "aifc",
      "name": "Compressed Audio Interchange File",
      "category": "audio",
      "summary": "An AIFC file is a compressed .AIFF file commonly used by media players and gaming consoles to store sounds. It is saved in the Audio Interchange File Format (AIFF) and compressed with one of several codecs, such as ULAW, ALAW, or G722 compression.",
      "popularity": 0
    },
    {
      "slug": "aiff",
      "extension": "aiff",
      "name": "What are AIFF files and how to open them",
      "category": "audio",
      "summary": "Having problems opening an AIFF file?",
      "popularity": 0
    },
    {
      "slug": "amr",
      "extension": "amr",
      "name": "Adaptive Multi-Rate Codec File",
      "category": "audio",
      "summary": "An AMR file is an audio file saved in a compressed format developed by Ericsson. It is optimized for storing spoken audio and is used by many 3G cell phones to store voice recordings, which include MMS messages. Various media players can open AMR files, including VideoLAN VLC media player and Apple QuickTime Player.",
      "popularity": 0
    },
    {
      "slug": "au",
      "extension": "au",
      "name": "What are AU files and how to open them",
      "category": "audio",
      "summary": "Having problems opening an AU file?",
      "popularity": 0
    },
    {
      "slug": "caf",
      "extension": "caf",
      "name": "Core Audio File",
      "category": "audio",
      "summary": "A CAF file is an audio file saved in the Core Audio Format (CAF), a digital audio format based on Apple's Core Audio technology. It stores audio data, text annotations, markers, channel layouts, and other information. CAF files are similar to .AIFF and .WAVE files, but do not have a 4GB size limit and can store any number of audio channels.",
      "popularity": 0
    },
    {
      "slug": "dra",
      "extension": "dra",
      "name": "What are DRA files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a DRA file?",
      "popularity": 0
    },
    {
      "slug": "dts",
      "extension": "dts",
      "name": "What are DTS files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a DTS file?",
      "popularity": 0
    },
    {
      "slug": "dtshd",
      "extension": "dtshd",
      "name": "What are DTSHD files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a DTSHD file?",
      "popularity": 0
    },
    {
      "slug": "flac",
      "extension": "flac",
      "name": "Free Lossless Audio Codec File",
      "category": "audio",
      "summary": "A FLAC file is an audio file compressed in the Free Lossless Audio Codec (FLAC) format, which is an open-source lossless audio compression format. It is similar to an .MP3 file, but is compressed without losing any quality or original audio data.",
      "popularity": 0
    },
    {
      "slug": "kar",
      "extension": "kar",
      "name": "What are KAR files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a KAR file?",
      "popularity": 0
    },
    {
      "slug": "lvp",
      "extension": "lvp",
      "name": "Avaya Voice Player Audio File",
      "category": "audio",
      "summary": "Compressed audio format used by the Avaya Voice Player for making voice recordings; often used as a Web browser helper application for playing Avaya Voice files, but can also turn e-mail software into a voicemail system; designed to work with the Intuity Audix Multimedia Messaging System.",
      "popularity": 0
    },
    {
      "slug": "m2a",
      "extension": "m2a",
      "name": "MPEG-1 Layer 2 Audio File",
      "category": "audio",
      "summary": "Audio file that has been compressed with MPEG-1 Layer II audio compression; used primarily by video-editing programs; may be exported along with a corresponding .M2V video file; also known as an Apple MPEG-1/2 Audio file.",
      "popularity": 0
    },
    {
      "slug": "m3u",
      "extension": "m3u",
      "name": "What are M3U files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a M3U file?",
      "popularity": 0
    },
    {
      "slug": "m4a",
      "extension": "m4a",
      "name": "MPEG-4 Audio",
      "category": "audio",
      "summary": "An M4A file is an audio file that may store various types of audio content, such as songs, podcasts, and audiobooks. It is saved in the MPEG-4 format and encoded with either the Advanced Audio Coding (AAC) codec or the Apple Lossless Audio Codec (ALAC). Various media players, including Microsoft Windows Media Player 2022 (Windows) and Apple Music (macOS) can open M4A files.",
      "popularity": 0
    },
    {
      "slug": "m4b",
      "extension": "m4b",
      "name": "What are M4B files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a M4B file?",
      "popularity": 0
    },
    {
      "slug": "mid",
      "extension": "mid",
      "name": "What are MID files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a MID file?",
      "popularity": 0
    },
    {
      "slug": "midi",
      "extension": "midi",
      "name": "MIDI Music Data",
      "category": "audio",
      "summary": "A MIDI file contains electronic music data saved in the Musical Instrument Digital Interface (MIDI) format. The MIDI format defines notes that are played, when they are played, how long they are held, and their velocities (how hard they are pressed). Many music applications can load MIDI files, along with MIDI hardware devices.",
      "popularity": 0
    },
    {
      "slug": "mka",
      "extension": "mka",
      "name": "What are MKA files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a MKA file?",
      "popularity": 0
    },
    {
      "slug": "mp2",
      "extension": "mp2",
      "name": "What are MP2 files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a MP2 file?",
      "popularity": 0
    },
    {
      "slug": "mp3",
      "extension": "mp3",
      "name": "MP3 Audio",
      "category": "audio",
      "summary": "An MP3 file is an audio file saved in a compressed audio format developed by the Moving Picture Experts Group (MPEG) that uses \"Layer 3\" audio compression (MP3). MP3 files are commonly used to store audio tracks, podcasts, lectures, sermons, and audiobooks.",
      "popularity": 0
    },
    {
      "slug": "mpga",
      "extension": "mpga",
      "name": "MPEG-1 Layer 3 Audio File",
      "category": "audio",
      "summary": "Compressed audio file encoded with MPEG-1 Layer 3 compression; compresses the audio using lossy compression that maintains most of the original sound quality.",
      "popularity": 0
    },
    {
      "slug": "oga",
      "extension": "oga",
      "name": "What are OGA files and how to open them",
      "category": "audio",
      "summary": "Having problems opening an OGA file?",
      "popularity": 0
    },
    {
      "slug": "ogg",
      "extension": "ogg",
      "name": "What are OGG files and how to open them",
      "category": "audio",
      "summary": "Having problems opening an OGG file?",
      "popularity": 0
    },
    {
      "slug": "opus",
      "extension": "opus",
      "name": "What are OPUS files and how to open them",
      "category": "audio",
      "summary": "Having problems opening an OPUS file?",
      "popularity": 0
    },
    {
      "slug": "ra",
      "extension": "ra",
      "name": "RealAudio File",
      "category": "audio",
      "summary": "Audio file used by RealPlayer, an audio and video streaming program; may reference a streaming audio file online or may contain audio data; can use various codecs to compress audio with variable bit rates; uses a proprietary Real compression algorithm.",
      "popularity": 0
    },
    {
      "slug": "ram",
      "extension": "ram",
      "name": "Real Audio Metadata File",
      "category": "audio",
      "summary": "Link file used by RealPlayer, a program used for streaming Internet audio and video; saved in plain text and contains a hyperlink to a corresponding .RA file, which can be streamed; includes a \"pnm\" or \"rtsp\" URL, which are the protocols used to access and play RealAudio data.",
      "popularity": 0
    },
    {
      "slug": "rip",
      "extension": "rip",
      "name": "Hit'n'Mix Audio Mashup File",
      "category": "audio",
      "summary": "Audio project file created by Hit'n'Mix, a program used to create audio mashups from song files; contains audio segments that have been ripped and split from an .MP3, .CDA, or .WAV audio file; used by both home DJs (disc jockeys) and mashup pioneers; can be exported to .MP3 format.",
      "popularity": 0
    },
    {
      "slug": "rmi",
      "extension": "rmi",
      "name": "RMID MIDI File",
      "category": "audio",
      "summary": "MIDI file stored in the Resource Interchange File Format (RIFF); technically, a MIDI file wrapped in an RIFF container; the format was originally introduced by Microsoft and later extended by MIDI.org; often referred to as a RIFF RMID file.",
      "popularity": 0
    },
    {
      "slug": "rmp",
      "extension": "rmp",
      "name": "RealPlayer Metadata Package File",
      "category": "audio",
      "summary": "Playlist file primarily used by RealPlayer, a multimedia playback application; stores a music playlist using XML formatting; commonly used for sharing song playlists with others over the Internet; also used by music distributors when publishing music information.",
      "popularity": 0
    },
    {
      "slug": "s3m",
      "extension": "s3m",
      "name": "ScreamTracker 3 Module",
      "category": "audio",
      "summary": "Audio module format used by Scream Tracker 3.0 and later; contains sound samples and music patterns, which define what notes are played back by the samples; similar to a .MOD file, but allows up to 16 tracks.",
      "popularity": 0
    },
    {
      "slug": "snd",
      "extension": "snd",
      "name": "Sound File",
      "category": "audio",
      "summary": "An SND file is a generic sound file. Various programs use sounds saved as SND files. SND files can be saved in a variety of audio formats, which often (but not always) differ from program to program.",
      "popularity": 0
    },
    {
      "slug": "spx",
      "extension": "spx",
      "name": "What are SPX files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a SPX file?",
      "popularity": 0
    },
    {
      "slug": "wav",
      "extension": "wav",
      "name": "WAVE Audio",
      "category": "audio",
      "summary": "A WAV file is an audio file saved in the Waveform Audio (WAVE) format. It contains a song, interview, voice memo, or other piece of digital audio. Because WAV files are quite common, you can play them with most media players, including those bundled with Windows, macOS, and other operating systems.",
      "popularity": 0
    },
    {
      "slug": "wax",
      "extension": "wax",
      "name": "Windows Media Audio Redirect",
      "category": "audio",
      "summary": "Audio shortcut file used by Windows Media Player, the default Windows multimedia playback program; saves a shortcut to a Windows Media audio (.WMA) file on the Internet; saved in a plain text format and contains the URL location of the audio file, but not the audio data itself.",
      "popularity": 0
    },
    {
      "slug": "weba",
      "extension": "weba",
      "name": "What are WEBA files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a WEBA file?",
      "popularity": 0
    },
    {
      "slug": "wma",
      "extension": "wma",
      "name": "What are WMA files and how to open them",
      "category": "audio",
      "summary": "Having problems opening a WMA file?",
      "popularity": 0
    },
    {
      "slug": "xm",
      "extension": "xm",
      "name": "Fasttracker 2 Extended Module",
      "category": "audio",
      "summary": "An XM file is a music module created by Triton Fasttracker 2, an audio tracker program. It contains MIDI data and sound samples that comprise a song. XM files are similar to .S3M and .MOD files but are saved in the Fasttracker Extended Module (XM) format.",
      "popularity": 0
    }
  ]
}