{
  "name": "Image_raster",
  "slug": "image-raster",
  "count": 75,
  "items": [
    {
      "slug": "3ds",
      "extension": "3ds",
      "name": "Trimmed 3DS ROM",
      "category": "image_raster",
      "summary": "A TRIM.3DS file is a trimmed .3DS ROM file created by GodMode9, a file browser for the Nintendo 3DS console. It contains a copy of the data from an original 3DS game cartridge but with all unnecessary filler information removed.",
      "popularity": 0
    },
    {
      "slug": "apng",
      "extension": "apng",
      "name": "Animated Portable Network Graphic",
      "category": "image_raster",
      "summary": "Unofficial extension to the Animated Portable Network Graphic (APNG) format; contains multiple frames (.PNG images) used for an animation sequence; similar to an animated .GIF file, but also supports 24-bit images and 8-bit transparency.",
      "popularity": 0
    },
    {
      "slug": "avif",
      "extension": "avif",
      "name": "What are AVIF files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening an AVIF file?",
      "popularity": 0
    },
    {
      "slug": "bmp",
      "extension": "bmp",
      "name": "Bitmap Image",
      "category": "image_raster",
      "summary": "A BMP file is an image saved in the Bitmap (BMP) raster image format developed by Microsoft. It contains uncompressed image data that supports monochrome and color images at variable color bit depths and image metadata. Users commonly save digital photos as BMP files.",
      "popularity": 0
    },
    {
      "slug": "btf",
      "extension": "btf",
      "name": "NationsBank Check Images",
      "category": "image_raster",
      "summary": "Contains check images and ASCII text; image data may be compressed using G4, JPEG, ABIC, or IOCA/ABIC compression; the text describes the issue date, paid date, amount, etc. for each check in the file.",
      "popularity": 0
    },
    {
      "slug": "btif",
      "extension": "btif",
      "name": "NationsBank Check Image File",
      "category": "image_raster",
      "summary": "Check image format used by NationsBank that contains compressed image data and ASCII text; includes information that describes the check issue date, paid date, and amount of each check in the file.",
      "popularity": 0
    },
    {
      "slug": "cgm",
      "extension": "cgm",
      "name": "What are CGM files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a CGM file?",
      "popularity": 0
    },
    {
      "slug": "cmx",
      "extension": "cmx",
      "name": "Corel Presentation Exchange Image",
      "category": "image_raster",
      "summary": "A CMX file is an image saved in the Corel Metafile Exchange (CMX) format and created by a Corel drawing or image editing program, such as CorelDRAW. It contains bitmap or vector image data, supporting colors in the RGB, CMYK, and Pantone color models. CMX files also store metadata that describes the image.",
      "popularity": 0
    },
    {
      "slug": "dds",
      "extension": "dds",
      "name": "What are DDS files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a DDS file?",
      "popularity": 0
    },
    {
      "slug": "dib",
      "extension": "dib",
      "name": "Device-Independent Bitmap Image",
      "category": "image_raster",
      "summary": "A DIB file is a raster image saved in the Device-Independent Bitmap format. It is similar to a .BMP bitmap image but has different header information. DIB files may be compressed or uncompressed; most are uncompressed.",
      "popularity": 0
    },
    {
      "slug": "djv",
      "extension": "djv",
      "name": "What are DJV files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a DJV file?",
      "popularity": 0
    },
    {
      "slug": "djvu",
      "extension": "djvu",
      "name": "DjVu Image",
      "category": "image_raster",
      "summary": "A DJVU file is a scanned document saved in the DjVu image format. It may contain text, images, and/or drawings. The DjVu format was developed by AT&T and marketed by LizardTech.",
      "popularity": 0
    },
    {
      "slug": "dng",
      "extension": "dng",
      "name": "What are DNG files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a DNG file?",
      "popularity": 0
    },
    {
      "slug": "dpx",
      "extension": "dpx",
      "name": "What are DPX files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a DPX file?",
      "popularity": 0
    },
    {
      "slug": "dwg",
      "extension": "dwg",
      "name": "AutoCAD Drawing",
      "category": "image_raster",
      "summary": "A DWG file is a 2D or 3D drawing created by Autodesk AutoCAD or exported by another CAD program. It contains vector image data, which defines the shapes and lines in a drawing, and metadata, which includes details like layer information, dimensions, and additional drawing properties.",
      "popularity": 0
    },
    {
      "slug": "dxf",
      "extension": "dxf",
      "name": "Drawing Exchange Format File",
      "category": "image_raster",
      "summary": "A DXF file is a data file saved in a format developed by Autodesk and used for CAD (computer-aided design) vector image files, such as AutoCAD documents. DXF files are similar to .DWG files but are more compatible with other programs since they are ASCII (text) based.",
      "popularity": 0
    },
    {
      "slug": "exr",
      "extension": "exr",
      "name": "OpenEXR Image",
      "category": "image_raster",
      "summary": "An EXR file is a raster image stored in the OpenEXR format, a high dynamic-range (HDR) image format developed by Academy Software Foundation (ASWF). The EXR format supports multi-layer images, lossy and lossless compression, and 16-bit and 32-bit pixels.",
      "popularity": 0
    },
    {
      "slug": "fbs",
      "extension": "fbs",
      "name": "What are FBS files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a FBS file?",
      "popularity": 0
    },
    {
      "slug": "fh",
      "extension": "fh",
      "name": "Symantec Backup Exec File",
      "category": "image_raster",
      "summary": "\"File history\" backup file created by Backup Exec, a backup application for small to medium-sized businesses; stores backup data for a physical or virtual computer system; saved as part of a \"Catalog,\" which is a collection of files backed up at a specific time.",
      "popularity": 0
    },
    {
      "slug": "fh7",
      "extension": "fh7",
      "name": "FreeHand 7 Drawing File",
      "category": "image_raster",
      "summary": "File created by Adobe FreeHand 7, a program used for creating two-dimensional vector graphics; contains vector image data for points, lines, graphics, and colors; used for creating prints or Web designs.",
      "popularity": 0
    },
    {
      "slug": "fits",
      "extension": "fits",
      "name": "Flexible Image Transport System File",
      "category": "image_raster",
      "summary": "Bitmap graphic created in the FITS (Flexible Image Transport System) format, which was originally specified by the International Astronomical Union (IAU); may contain both binary data and ASCII text; used as a standard format for storing astronomical data.",
      "popularity": 0
    },
    {
      "slug": "fpx",
      "extension": "fpx",
      "name": "FlashPix Bitmap Image File",
      "category": "image_raster",
      "summary": "Picture saved in the Kodak FlashPix format, a bitmap image format optimized for digital photography; used by the \"Picture Easy Software\" application included with Kodak digital cameras.",
      "popularity": 0
    },
    {
      "slug": "fst",
      "extension": "fst",
      "name": "FL Studio State File",
      "category": "image_raster",
      "summary": "State file created and used by FL Studio, a music production application that enables users to compose arrange, record, and edit music; contains generator, mixer, and effects presets along with channel settings.",
      "popularity": 0
    },
    {
      "slug": "g3",
      "extension": "g3",
      "name": "CCITT Group 3 Fax Image",
      "category": "image_raster",
      "summary": "A G3 file is a compressed, black-and-white image created by a fax machine. Various fax machines save images as G3 files before transmitting them to other fax machines. Compressing the images in this way makes them easier to transmit (by reducing their file sizes).",
      "popularity": 0
    },
    {
      "slug": "gif",
      "extension": "gif",
      "name": "What are GIF files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a GIF file?",
      "popularity": 0
    },
    {
      "slug": "heic",
      "extension": "heic",
      "name": "High Efficiency Image Format",
      "category": "image_raster",
      "summary": "An HEIC file contains one or more images saved in the High Efficiency Image Format (HEIF), a file format most commonly used to store photos on iOS devices. It stores an image or sequence of images likely created by an iPhone or iPad's Camera app, as well as metadata describing each image. HEIC files are most commonly saved with the .heic extension but may also be saved as .HEIF files.",
      "popularity": 0
    },
    {
      "slug": "heif",
      "extension": "heif",
      "name": "High Efficiency Image Format",
      "category": "image_raster",
      "summary": "An HEIF file is an image saved in the High Efficiency Image Format (HEIF), a lossy compressed format. It may contain still images, image collections, image bursts, and image sequences. HEIF files also store metadata that describes each image.",
      "popularity": 0
    },
    {
      "slug": "ico",
      "extension": "ico",
      "name": "What are ICO files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening an ICO file?",
      "popularity": 0
    },
    {
      "slug": "jfif",
      "extension": "jfif",
      "name": "What are JFIF files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a JFIF file?",
      "popularity": 0
    },
    {
      "slug": "jls",
      "extension": "jls",
      "name": "JPEG-LS Image",
      "category": "image_raster",
      "summary": "A JLS file is an image saved in the JPEG-LS file format. It contains a lossy or lossless compressed image. JLS files are typically created by medical imaging devices and digital cameras.",
      "popularity": 0
    },
    {
      "slug": "jng",
      "extension": "jng",
      "name": "JPEG Network Graphic",
      "category": "image_raster",
      "summary": "A JNG file is an image saved in the JPEG Network Graphic (JNG) format. Like .PNG images, JNG images can contain transparent sections. However, like .JPG images, JNG images are compressed using lossy compression.",
      "popularity": 0
    },
    {
      "slug": "jp2",
      "extension": "jp2",
      "name": "JPEG 2000 Core Image",
      "category": "image_raster",
      "summary": "A JP2 file is a compressed bitmap image saved in the JPEG 2000 (JP2) Core Coding format. It supports any color bit depth and image metadata and may be compressed with lossy or lossless compression. Users often save digital photos and medical images, such as CT and MRI scans, as JP2 files.",
      "popularity": 0
    },
    {
      "slug": "jpe",
      "extension": "jpe",
      "name": "JPEG Image",
      "category": "image_raster",
      "summary": "24-bit compressed JPEG graphic format that is commonly used for Web graphics; best suited for photos or images that contain lots of colors; also used by most digital cameras for saving digital photos.",
      "popularity": 0
    },
    {
      "slug": "jpeg",
      "extension": "jpeg",
      "name": "JPEG Image",
      "category": "image_raster",
      "summary": "A JPEG file is an image saved in a compressed graphic format standardized by the Joint Photographic Experts Group (JPEG). It supports up to 24-bit color and utilizes lossy compression, which may noticeably reduce the image quality if high amounts are applied. Users commonly save digital photos and web graphics as JPEG files.",
      "popularity": 0
    },
    {
      "slug": "jpf",
      "extension": "jpf",
      "name": "JPEG 2000 Image",
      "category": "image_raster",
      "summary": "A JPF file is an image saved in the JPEG 2000 (JP2) format, which is a successor to the .JPEG image format. It supports image transparency and may incorporate lossy or lossless compression. JPF files may also store metadata that describes the image.",
      "popularity": 0
    },
    {
      "slug": "jpg",
      "extension": "jpg",
      "name": "JPEG Image",
      "category": "image_raster",
      "summary": "A JPG file is an image saved in the JPEG format. JPG files commonly contain digital photographs, drawings, or graphics. On most devices, you can double-click or double-tap a JPG file to open it in your default image viewer.",
      "popularity": 0
    },
    {
      "slug": "jpg2",
      "extension": "jpg2",
      "name": "JPEG 2000 Image",
      "category": "image_raster",
      "summary": "Compressed bitmap image created using the JPEG 2000 standard, which incorporates a wavelet compression algorithm to compress images better than the standard JPEG format; more commonly seen with the .JP2 and .JPX file extensions.",
      "popularity": 0
    },
    {
      "slug": "jph",
      "extension": "jph",
      "name": "JProbe Memory Snapshot",
      "category": "image_raster",
      "summary": "Snapshot of memory usage generated by JProbe, an enterprise-class Java profiling program; created by JProbe's memory debugger; used for identifying the root cause of a program's performance and stability problems.",
      "popularity": 0
    },
    {
      "slug": "jpx",
      "extension": "jpx",
      "name": "JPEG 2000 Image File",
      "category": "image_raster",
      "summary": "A JPX file is an image saved in the part-2 extension to the JPEG 2000 format. It stores image data compressed with lossy or lossless compression and supports image transparency and retains alpha and spot channels. JPX files may also contain additional metadata that describes the contents of the file.",
      "popularity": 0
    },
    {
      "slug": "jxl",
      "extension": "jxl",
      "name": "What are JXL files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a JXL file?",
      "popularity": 0
    },
    {
      "slug": "jxr",
      "extension": "jxr",
      "name": "What are JXR files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a JXR file?",
      "popularity": 0
    },
    {
      "slug": "jxs",
      "extension": "jxs",
      "name": "What are JXS files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a JXS file?",
      "popularity": 0
    },
    {
      "slug": "ktx",
      "extension": "ktx",
      "name": "What are KTX files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a KTX file?",
      "popularity": 0
    },
    {
      "slug": "ktx2",
      "extension": "ktx2",
      "name": "Khronos Texture 2.0",
      "category": "image_raster",
      "summary": "A KTX2 file stores GPU texture data in the Khronos Texture 2.0 (KTX2) container format. It contains image data for a texture asset compressed with Basis Universal (BasisU) supercompression that can be transcoded to different formats depending on the support provided by the target devices. KTX2 files also include parameters required for loading stored textures into 3D APIs, such as Vulkan and OpenGL.",
      "popularity": 0
    },
    {
      "slug": "mdi",
      "extension": "mdi",
      "name": "Microsoft Document Imaging File",
      "category": "image_raster",
      "summary": "An MDI file is a document saved in a high-resolution, tag-based graphics format developed from the TIFF format. It is created by Microsoft Office to save scanned documents and may be turned into a Word (.DOC) document using OCR (optical character recognition) software.",
      "popularity": 0
    },
    {
      "slug": "npx",
      "extension": "npx",
      "name": "What are NPX files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a NPX file?",
      "popularity": 0
    },
    {
      "slug": "pbm",
      "extension": "pbm",
      "name": "Portable Bitmap Image",
      "category": "image_raster",
      "summary": "A PBM file is a black-and-white image saved in the Portable Bitmap format. It consists of a plain text header and a grid of 0s and 1s that specify the color of each of the image's pixels. 0s represent white pixels; 1s represent black pixels.",
      "popularity": 0
    },
    {
      "slug": "pct",
      "extension": "pct",
      "name": "What are PCT files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a PCT file?",
      "popularity": 0
    },
    {
      "slug": "pcx",
      "extension": "pcx",
      "name": "What are PCX files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a PCX file?",
      "popularity": 0
    },
    {
      "slug": "pgm",
      "extension": "pgm",
      "name": "Portable Gray Map Image",
      "category": "image_raster",
      "summary": "A PGM file is a grayscale image file saved in the portable gray map (PGM) format and encoded with one or two bytes (8 or 16 bits) per pixel. It contains header information and a grid of numbers representing different shades of gray, from black (0) to white (up to 65,536). PGM files are typically stored in ASCII text format but also have a binary representation.",
      "popularity": 0
    },
    {
      "slug": "pic",
      "extension": "pic",
      "name": "Generic Picture File",
      "category": "image_raster",
      "summary": "Bitmap image created by IBM Lotus or a variety of other applications; possible programs include Advanced Art Studio, Micrografx Draw, and SoftImage 3D; should not be confused with the .PICT format.",
      "popularity": 0
    },
    {
      "slug": "png",
      "extension": "png",
      "name": "Portable Network Graphic",
      "category": "image_raster",
      "summary": "A PNG file is an image saved in the Portable Network Graphic (PNG) format, commonly used to store web graphics, digital photographs, and images with transparent backgrounds. It is a raster graphic similar to a .JPG image but is compressed with lossless compression and supports transparency.",
      "popularity": 0
    },
    {
      "slug": "pnm",
      "extension": "pnm",
      "name": "Portable Any Map Image",
      "category": "image_raster",
      "summary": "Bitmap image created in the Portable Any Map format, which was designed to handle several types of portable monochrome, grayscale, and color images; may include raster graphic data in a .PBM, .PGM, or .PPM format; may be stored using binary data or ASCII text.",
      "popularity": 0
    },
    {
      "slug": "ppm",
      "extension": "ppm",
      "name": "What are PPM files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a PPM file?",
      "popularity": 0
    },
    {
      "slug": "psd",
      "extension": "psd",
      "name": "Adobe Photoshop Document",
      "category": "image_raster",
      "summary": "A PSD file is the native image format used by Adobe Photoshop, a professional image-editing program used for enhancing digital photos and creating web graphics. PSD files may include image layers, adjustment layers, annotations, file information, keywords, and other Photoshop-specific elements. They are commonly created and shared among graphics professionals.",
      "popularity": 0
    },
    {
      "slug": "ras",
      "extension": "ras",
      "name": "What are RAS files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a RAS file?",
      "popularity": 0
    },
    {
      "slug": "rgb",
      "extension": "rgb",
      "name": "What are RGB files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a RGB file?",
      "popularity": 0
    },
    {
      "slug": "sgi",
      "extension": "sgi",
      "name": "Silicon Graphics Image",
      "category": "image_raster",
      "summary": "An SGI file is an image saved in the Silicon Graphics Image (SGI) format. It is typically a color image, shown using three color channels. SGI files contain images that were meant to be shown on Silicon Graphics workstations.",
      "popularity": 0
    },
    {
      "slug": "sid",
      "extension": "sid",
      "name": "Steam Game Data Backup File",
      "category": "image_raster",
      "summary": "Backup file created by Steam, an application used to download and manage Valve video games on desktop computers; contains compressed game data created by the Steam backup feature (steambackup.exe program); used to backup games to DVDs or other external media.",
      "popularity": 0
    },
    {
      "slug": "sub",
      "extension": "sub",
      "name": "MicroDVD Subtitle File",
      "category": "image_raster",
      "summary": "A SUB file is a MicroDVD subtitle file, which is meant to be used to play subtitles over an accompanying video file. It includes subtitle text and cue points for when each subtitle should be displayed. SUB files can be used as subtitle files in a variety of media players.",
      "popularity": 0
    },
    {
      "slug": "svg",
      "extension": "svg",
      "name": "What are SVG files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a SVG file?",
      "popularity": 0
    },
    {
      "slug": "svgz",
      "extension": "svgz",
      "name": "What are SVGZ files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a SVGZ file?",
      "popularity": 0
    },
    {
      "slug": "tap",
      "extension": "tap",
      "name": "What are TAP files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a TAP file?",
      "popularity": 0
    },
    {
      "slug": "tfx",
      "extension": "tfx",
      "name": "Pro Tools Eleven Rack Plugin Preset File",
      "category": "image_raster",
      "summary": "A TFX file is a settings file used by the Eleven Rack guitar processor used by the Avid Pro Tools digital audio workstation (DAW). It contains settings for Eleven Rack rigs, which extend the functionality of Pro Tools with electric guitar processing effects. TFX files can be exported and imported by Pro Tools users to change the presets of Eleven Rack.",
      "popularity": 0
    },
    {
      "slug": "tga",
      "extension": "tga",
      "name": "What are TGA files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a TGA file?",
      "popularity": 0
    },
    {
      "slug": "tif",
      "extension": "tif",
      "name": "What are TIF files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a TIF file?",
      "popularity": 0
    },
    {
      "slug": "tiff",
      "extension": "tiff",
      "name": "Tagged Image File Format",
      "category": "image_raster",
      "summary": "A TIFF file is a graphics container that stores raster images in the Tagged Image File Format (TIFF). It contains high-quality graphics that support color depths from 1 to 24-bit and supports both lossy and lossless compression. TIFF files also support multiple layers and pages.",
      "popularity": 0
    },
    {
      "slug": "vtf",
      "extension": "vtf",
      "name": "What are VTF files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a VTF file?",
      "popularity": 0
    },
    {
      "slug": "wbmp",
      "extension": "wbmp",
      "name": "What are WBMP files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a WBMP file?",
      "popularity": 0
    },
    {
      "slug": "wdp",
      "extension": "wdp",
      "name": "What are WDP files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening a WDP file?",
      "popularity": 0
    },
    {
      "slug": "webp",
      "extension": "webp",
      "name": "WebP Image",
      "category": "image_raster",
      "summary": "A WEBP file is an image saved in the WebP (pronounced \"Weppy\") raster image format developed by Google for web graphics. The WebP format reduces file size more than standard JPEG compression while maintaining similar or better image quality. It supports both lossy and lossless compression and includes an alpha channel for transparency, similar to the PNG format.",
      "popularity": 0
    },
    {
      "slug": "xbm",
      "extension": "xbm",
      "name": "What are XBM files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening an XBM file?",
      "popularity": 0
    },
    {
      "slug": "xif",
      "extension": "xif",
      "name": "What are XIF files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening an XIF file?",
      "popularity": 0
    },
    {
      "slug": "xpm",
      "extension": "xpm",
      "name": "X11 Pixmap Graphic",
      "category": "image_raster",
      "summary": "Bitmap image used by the X Windows System, a (GUI) used to run networked client-server computers; supports monochrome, gray-scale, and color pixmap data; stores pixmaps as static character arrays in the C programming language.",
      "popularity": 0
    },
    {
      "slug": "xwd",
      "extension": "xwd",
      "name": "What are XWD files and how to open them",
      "category": "image_raster",
      "summary": "Having problems opening an XWD file?",
      "popularity": 0
    }
  ]
}