{
  "name": "Video",
  "slug": "video",
  "count": 42,
  "items": [
    {
      "slug": "3g2",
      "extension": "3g2",
      "name": "What are 3G2 files and how to open them",
      "category": "video",
      "summary": "Having problems opening a 3G2 file?",
      "popularity": 0
    },
    {
      "slug": "3gp",
      "extension": "3gp",
      "name": "What are 3GP files and how to open them",
      "category": "video",
      "summary": "Having problems opening a 3GP file?",
      "popularity": 0
    },
    {
      "slug": "asf",
      "extension": "asf",
      "name": "What are ASF files and how to open them",
      "category": "video",
      "summary": "Having problems opening an ASF file?",
      "popularity": 0
    },
    {
      "slug": "asx",
      "extension": "asx",
      "name": "Microsoft ASF Redirector File",
      "category": "video",
      "summary": "Multimedia playlist or shortcut to an audio/video file (often an .ASF file); references one or more URLs that point to the locations of the audio and video files; used for storing multimedia playlists.",
      "popularity": 0
    },
    {
      "slug": "avi",
      "extension": "avi",
      "name": "Microsoft DV-AVI Video File",
      "category": "video",
      "summary": "Video file format created by Microsoft to handle digital video in .AVI files; stores DV video from a digital camcorder in an AVI file container; may be one of two types:",
      "popularity": 0
    },
    {
      "slug": "dvb",
      "extension": "dvb",
      "name": "AutoCAD VBA Project File",
      "category": "video",
      "summary": "A DVB file is a VBA project created by AutoCAD VBA, a module used to write applications for automating tasks in AutoCAD. It contains a Microsoft Visual Basic for Applications (VBA) program, which is known as a macro that includes components and code for automating a task.",
      "popularity": 0
    },
    {
      "slug": "f4v",
      "extension": "f4v",
      "name": "Flash MP4 Video File",
      "category": "video",
      "summary": "An F4V file is a video file saved in the video container format used by Adobe Flash. It stores video encoded in the H.264 codec, audio in the AAC+/HE-AAC/AAC v1/AAC v2 formats, and metadata. F4V files are primarily used to stream movies and TV shows online.",
      "popularity": 0
    },
    {
      "slug": "fli",
      "extension": "fli",
      "name": "FLIC Animation",
      "category": "video",
      "summary": "An FLI file is a movie or animation created by Autodesk animation software, such as Animator Pro. FLI files use lossless compression, which reduces the file size but maintains the original quality.",
      "popularity": 0
    },
    {
      "slug": "flv",
      "extension": "flv",
      "name": "Flash Video",
      "category": "video",
      "summary": "An FLV file is a video saved in the Adobe Flash Video (FLV) container format. It stores a short header, synchronized audio and video data streams (encoded the same way as streams in the standard Flash .SWF format), and metadata packets.",
      "popularity": 0
    },
    {
      "slug": "fvt",
      "extension": "fvt",
      "name": "FAST Search & Transfer Video File",
      "category": "video",
      "summary": "An FVT file is a video file saved in the Fast Search & Transfer (FAST) format, a multimedia compression and streaming technology introduced in 1997. It contains video compressed using a proprietary video compression scheme and audio compressed using Linear predictive coding (LPC). FVT files are used for live video streaming over wireless networks and local and on-demand video playback.",
      "popularity": 0
    },
    {
      "slug": "h261",
      "extension": "h261",
      "name": "H.261 Video",
      "category": "video",
      "summary": "An H261 file is a video saved using the H.261 video compression standard. It likely contains footage recorded during a video conference. H261 files are quite rare, so most popular media players cannot play them.",
      "popularity": 0
    },
    {
      "slug": "h263",
      "extension": "h263",
      "name": "H.263 Video",
      "category": "video",
      "summary": "An H263 file is a video saved using the H.263 video compression standard. It contains footage recorded during a video conference. H263 files are quite rare, so most popular media players cannot play them.",
      "popularity": 0
    },
    {
      "slug": "h264",
      "extension": "h264",
      "name": "H.264 Encoded Video File",
      "category": "video",
      "summary": "An H264 file is a video file encoded with H.264 compression, which is a popular format for high-definition video. It is often used as the video format for AVCHD camcorders, HDTV, Blu-ray, and HD DVD. H264 generally refers to a video file that is an .MP4 file.",
      "popularity": 0
    },
    {
      "slug": "m1v",
      "extension": "m1v",
      "name": "MPEG-1 Video File",
      "category": "video",
      "summary": "An M1V file is a video file saved in a format based on the Moving Picture Experts Group Phase 1 (MPEG-1) format. It stores video, audio, and metadata interleaved together and compressed with lossy compression. M1V files are typically used for saving home videos, TV shows, and movies.",
      "popularity": 0
    },
    {
      "slug": "m2t",
      "extension": "m2t",
      "name": "What are M2T files and how to open them",
      "category": "video",
      "summary": "Having problems opening a M2T file?",
      "popularity": 0
    },
    {
      "slug": "m2ts",
      "extension": "m2ts",
      "name": "Blu-ray BDAV Video File",
      "category": "video",
      "summary": "Video file saved in the high-definition Blu-ray BDAV format; used for saving video data on Blu-ray discs; based on the MPEG-2 transport stream and supports 720p and 1080i formats.",
      "popularity": 0
    },
    {
      "slug": "m2v",
      "extension": "m2v",
      "name": "What are M2V files and how to open them",
      "category": "video",
      "summary": "Having problems opening a M2V file?",
      "popularity": 0
    },
    {
      "slug": "m4s",
      "extension": "m4s",
      "name": "MPEG-DASH Video Segment",
      "category": "video",
      "summary": "An M4S file is a segment of a video streamed using the MPEG-DASH video streaming technique. It contains binary data that represents a video segment. M4S files that are the first segment of a video also contain initialization data, which allows media players to recognize and begin playing the video.",
      "popularity": 0
    },
    {
      "slug": "m4u",
      "extension": "m4u",
      "name": "MPEG-4 Playlist",
      "category": "video",
      "summary": "Playlist used by some video player programs; contains links to MPEG-4 movies and video clips, but does not contain the video files themselves; similar to an .M3U file, which stores a playlist for .MP3 files.",
      "popularity": 0
    },
    {
      "slug": "m4v",
      "extension": "m4v",
      "name": "iTunes Video File",
      "category": "video",
      "summary": "An M4V file is an MPEG-4 file used to store video downloaded from the Apple iTunes store, such as TV episodes, music videos, and full-length movies. It is similar to the .MP4 file, but may be copy-protected using Apple's FairPlay DRM copyright protection.",
      "popularity": 0
    },
    {
      "slug": "mj2",
      "extension": "mj2",
      "name": "Motion JPEG 2000 Video",
      "category": "video",
      "summary": "An MJ2 file is a video saved in the Motion JPEG 2000 (Part 3) format. It contains a sequence of JPEG 2000 images (.JP2 files) and may also contain audio. MJ2 files are similar to .MP4 and .MOV files.",
      "popularity": 0
    },
    {
      "slug": "mk3d",
      "extension": "mk3d",
      "name": "What are MK3D files and how to open them",
      "category": "video",
      "summary": "Having problems opening a MK3D file?",
      "popularity": 0
    },
    {
      "slug": "mks",
      "extension": "mks",
      "name": "Matroska Elementary Stream File",
      "category": "video",
      "summary": "Subtitle container format developed by Matroska; contains only subtitles unlike the MKV format which can also contain video with the subtitles.",
      "popularity": 0
    },
    {
      "slug": "mkv",
      "extension": "mkv",
      "name": "Matroska Video",
      "category": "video",
      "summary": "An MKV file is a video file saved in the Matroska multimedia container format that often stores short video clips, TV shows, and movies. It supports several types of audio and video codecs and may include .SRT, .SSA, .USF (Universal Subtitle Format), or VobSub subtitles. Many video players can open MKV files, including Microsoft Windows Media Player 2022 and VideoLAN VLC media player.",
      "popularity": 0
    },
    {
      "slug": "mng",
      "extension": "mng",
      "name": "What are MNG files and how to open them",
      "category": "video",
      "summary": "Having problems opening a MNG file?",
      "popularity": 0
    },
    {
      "slug": "mov",
      "extension": "mov",
      "name": "Apple QuickTime Movie",
      "category": "video",
      "summary": "A MOV file is one of the most common video file types, often storing a movie, TV show, short video clip, or home movie. It is saved in the QuickTime File Format (QTFF), a multimedia container format developed by Apple. Video editors often save video as MOV files due to their support for high-quality video.",
      "popularity": 0
    },
    {
      "slug": "movie",
      "extension": "movie",
      "name": "QuickTime Movie File",
      "category": "video",
      "summary": "Movie saved or formatted in Apple's proprietary QuickTime format; may use one of many types of codecs to compress the file, including the H.264 video codec, which uses a high-efficiency compression algorithm; H.264 support was introduced with QuickTime 7.0, which was released with Mac OS X 10.4 Tiger and is also available with QuickTime for Windows.",
      "popularity": 0
    },
    {
      "slug": "mp4v",
      "extension": "mp4v",
      "name": "MPEG-4 Video",
      "category": "video",
      "summary": "Video file format developed by MPEG (the Moving Picture Experts Group); may contain still images, video objects, and audio objects; also supports text, graphics, and synthetic sounds.",
      "popularity": 0
    },
    {
      "slug": "mpe",
      "extension": "mpe",
      "name": "MPEG Movie File",
      "category": "video",
      "summary": "Video encoded in MPEG format, a commonly compression applied to digital video files; MPEG-2 is the most commonly used type of MPEG compression.",
      "popularity": 0
    },
    {
      "slug": "mpeg",
      "extension": "mpeg",
      "name": "MPEG Video",
      "category": "video",
      "summary": "An MPEG file is a video file saved in a digital video format standardized by the Moving Picture Experts Group (MPEG). It contains video and audio data compressed with MPEG-1 or MPEG-2 compression and is often used to share videos over the Internet.",
      "popularity": 0
    },
    {
      "slug": "mpg",
      "extension": "mpg",
      "name": "MPEG Video",
      "category": "video",
      "summary": "An MPG file is a common video file that uses a digital video format standardized by the Moving Picture Experts Group (MPEG). It stores video, audio, and metadata interleaved together. MPG files are often used for creating movies that are distributed on the Internet.",
      "popularity": 0
    },
    {
      "slug": "ogv",
      "extension": "ogv",
      "name": "Ogg Video",
      "category": "video",
      "summary": "An OGV file is a video file saved in the Xiph.Org open-source Ogg container format. It contains video streams encoded with one or more codecs, such as Theora, Dirac, or Daala, and may or may not store audio streams. Users often utilize OGV files to save video content for publishing on webpages.",
      "popularity": 0
    },
    {
      "slug": "qt",
      "extension": "qt",
      "name": "Apple QuickTime Movie",
      "category": "video",
      "summary": "A QT file is a movie file saved in the QuickTime File Format (QTFF), a multimedia container format developed by Apple. It contains one or more audio, video, or text (subtitle) tracks and typically uses the MPEG-4 codec for compression. QT files most often store movies and video clips.",
      "popularity": 0
    },
    {
      "slug": "smv",
      "extension": "smv",
      "name": "VideoLink Mail Video File",
      "category": "video",
      "summary": "Video format used for recording video conferences and transmitting videos via e-mail; supported by several types of Chinese portable media players such as the TRIO Onyx Portable Media Player and the Global Sources Direct MP4 Player; also supported by the Philips GoGear Vibe media player.",
      "popularity": 0
    },
    {
      "slug": "ts",
      "extension": "ts",
      "name": "TypeScript Declaration File",
      "category": "video",
      "summary": "A D.TS file is a declaration file used by a TypeScript program. It contains a description of objects and functions contained in an associated JavaScript library. It allows a TypeScript program to use a JavaScript API.",
      "popularity": 0
    },
    {
      "slug": "viv",
      "extension": "viv",
      "name": "What are VIV files and how to open them",
      "category": "video",
      "summary": "Having problems opening a VIV file?",
      "popularity": 0
    },
    {
      "slug": "vob",
      "extension": "vob",
      "name": "What are VOB files and how to open them",
      "category": "video",
      "summary": "Having problems opening a VOB file?",
      "popularity": 0
    },
    {
      "slug": "webm",
      "extension": "webm",
      "name": "WebM Video",
      "category": "video",
      "summary": "A WEBM file is a video saved in the WebM format, an open, royalty-free format designed for sharing video on the web. WebM uses a container structure similar to the Matroska (.MKV) video format, which stores both audio and video data. Video is compressed using a VP8 or VP9 codec, and audio is compressed with either the Vorbis or Opus audio codec.",
      "popularity": 0
    },
    {
      "slug": "wm",
      "extension": "wm",
      "name": "Windows Media File",
      "category": "video",
      "summary": "Windows Media audio or video file; may contain audio, video, or both types of data; formatted using the Windows Media Player codec.",
      "popularity": 0
    },
    {
      "slug": "wmv",
      "extension": "wmv",
      "name": "Windows Media Video",
      "category": "video",
      "summary": "A WMV file is a video saved in the Microsoft Advanced Systems Format (ASF) and compressed with Windows Media Video (WMV) compression. It may store an animation, video clip, TV episode, or movie and supports high-definition (HD) video. WMV files also support encryption for use with Digital Rights Management (DRM) systems.",
      "popularity": 0
    },
    {
      "slug": "wmx",
      "extension": "wmx",
      "name": "What are WMX files and how to open them",
      "category": "video",
      "summary": "Having problems opening a WMX file?",
      "popularity": 0
    },
    {
      "slug": "wvx",
      "extension": "wvx",
      "name": "Windows Media Video Redirector",
      "category": "video",
      "summary": "File used by Windows Media Player, Microsoft's default player for Windows; saves a link to a .WMV video file, but doesn't contain the audio data itself; used as a video file shortcut.",
      "popularity": 0
    }
  ]
}