[{"slug":"7z","extension":"7z","name":"7-Zip Compressed File","summary":"A 7Z file is a compressed archive created by various file compression utilities, most notably, Igor Pavlov's 7-Zip. It is compressed with open-source LZMA compression, which features a high compression ratio and may include AES-256 (256-bit) encryption. 7Z files may contain multiple directories or files compressed to save space for storage or transportation purposes.","developer":"Igor Pavlov","developer_slug":"igor-pavlov","category":"Compressed Files","category_slug":"compressed-files","rating":4.1,"votes":561,"last_updated":"May 25, 2022","how_to_open":{"instructions":["You can extract files contained in a 7Z archive with various decompression utilities, such as 7-Zip (Windows), Corel WinZip (Windows), Apple Archive Utility (bundled with Macs), Corel WinZip Mac (Mac), and B1 Free Archiver (multiplatform).","If your 7Z archive is split into a multi-volume archive (e.g., you possess a .7Z.001 file, a .7Z.002 file, and so on), you can extract all the files included within the multi-volume archive by opening the archive's 7Z.001 file in a decompression utility. For this to work, all the multi-volume archive's files must be stored in the same folder. Also, you must possess every file included in the archive. For example, if you have a .7Z.003 file and .7Z.005 file, but not a .7Z.004 file, you may have trouble extracting your files. (Some utilities that can decompress single-volume 7Z archives cannot decompress multi-volume archives. For example, Apple Archive Utility cannot decompress multi-volume 7Z archives.)","NOTE: Some 7Z archives may be password-protected. To open these archives, you must enter the password used to create the archive when prompted."]},"scraped_at":"2025-08-09T21:58:54.866908","source":{"url":"https://fileinfo.com/extension/7z","file":"7z.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"bz2","extension":"bz2","name":"Bzip2 Compressed File","summary":"A BZ2 file is a file that has been compressed by bzip2, a compression program often found on Unix-based systems. Unlike compressed archives , BZ2 files always contain only a single compressed file. BZ2 files often contain compressed software packages, used to install Linux programs.","developer":"Julian Seward","developer_slug":"julian-seward","category":"Compressed Files","category_slug":"compressed-files","rating":4,"votes":78,"last_updated":"October 5, 2022","how_to_open":{"instructions":["You can use bzip2 (multiplatform), Apple Archive Utility (Mac), 7-Zip (Windows), or PeaZip (multiplatform) to extract the compressed file a BZ2 file contains."]},"scraped_at":"2025-08-09T21:58:54.887068","source":{"url":"https://fileinfo.com/extension/bz2","file":"bz2.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"deb","extension":"deb","name":"Debian Software Package","summary":"A DEB file is a software package used by the Debian Linux distribution and its variants, such as Ubuntu. DEB files are used primarily to install or update Unix applications. Each DEB file is a standard Unix archive that contains two .TAR archives: one for installer control information and another for installable data.","developer":"Debian Project","developer_slug":"debian-project","category":"Compressed Files","category_slug":"compressed-files","rating":4,"votes":453,"last_updated":"February 2, 2022","how_to_open":{"instructions":["You can install the software stored in a DEB file in a supported Linux distribution, such as Debian or Ubuntu, using the dpkg command. For example, to install an example.deb file, enter dpkg -i /path/to/example.deb on the Linux command line.","iOS device users who have jailbroken their device can install the software a DEB file contains using Cydia (iOS) or iFunbox (Windows, Mac).","You can also extract the contents of a DEB file with decompression utility, such as 7-Zip (Windows), B1 Free Archiver (multiplatform), or PeaZip (Windows, Linux)."]},"scraped_at":"2025-08-09T21:58:54.917933","source":{"url":"https://fileinfo.com/extension/deb","file":"deb.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"gz","extension":"gz","name":"Gnu Zipped Archive","summary":"A GZ file is an archive file compressed by the standard GNU zip (gzip) compression algorithm. It typically contains a single compressed file but may also store multiple compressed files. gzip is primarily used on Unix operating systems for file compression.","developer":"The GNU Project","developer_slug":"the-gnu-project","category":"Compressed Files","category_slug":"compressed-files","rating":3.7,"votes":540,"last_updated":"March 7, 2022","how_to_open":{"instructions":["You can open GZ files with the GNU zip (gzip) compression utility. You can also decompress GZ files and extract their files with other decompression utilities, such as Corel WinZip (Windows and macOS), Smith Micro Stuffit Deluxe (Windows and macOS), 7-Zip (Windows), and Apple Archive Utility (bundled with macOS)."]},"scraped_at":"2025-08-09T21:58:54.881465","source":{"url":"https://fileinfo.com/extension/gz","file":"gz.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"rar","extension":"rar","name":"WinRAR Compressed Archive","summary":"A RAR file is an archive that contains one or more files compressed with RAR compression. It is compressed with a higher compression ratio than typical ZIP compression and incorporates a proprietary compression algorithm utilized by other compressors, including 7-Zip for its .7Z files. Since RAR archives store files in a reduced size, users often compress files to transfer or store them.","developer":"Eugene Roshal","developer_slug":"eugene-roshal","category":"Compressed Files","category_slug":"compressed-files","rating":4.2,"votes":4482,"last_updated":"November 16, 2023","how_to_open":{"instructions":["You can open RAR files with RARLAB WinRAR (Windows) and RARLAB RAR (Android). For example, to open a RAR file with RARLAB WinRAR, select File → Open archive .","Various third-party decompression utilities also support RAR files, including the following applications:","If your RAR archive is split into a multi-volume archive (e.g. you possess a .rar file, an .r01 file, an .r02 file, and so on), you can extract all the files included within the multi-volume archive by opening the archive's primary RAR file with a decompression utility. Note that, for this to work, all the files contained within the multi-volume archive must be stored in the same folder. Also, you must possess every file included in the archive (e.g. if you have an .r03 file and an .r05 file but not an .r04 file, you may have trouble extracting your files).","Some RAR archives may be password-protected. To open these archives, you must enter the password used to create the archive when prompted."],"programs":[{"name":"Corel WinZip","url":"../software/corel/winzip.html"},{"name":"Corel WinZip Mac","url":"../software/corel/winzip_mac.html"},{"name":"B1 Free Archiver","url":"../software/catalina_group/b1_free_archiver.html"},{"name":"PeaZip","url":"../software/peazip/peazip.html"}]},"scraped_at":"2025-08-09T21:58:54.860639","source":{"url":"https://fileinfo.com/extension/rar","file":"rar.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"rpm","extension":"rpm","name":"Red Hat Package Manager File","summary":"An RPM file is an installation package originally developed for the Red Hat Linux operating system, but now used by many other Linux distributions as well. RPM files are commonly used for installing programs on Linux systems.","developer":"Red Hat","developer_slug":"red-hat","category":"Compressed Files","category_slug":"compressed-files","rating":3.8,"votes":136,"last_updated":"March 14, 2019","scraped_at":"2025-08-09T21:58:54.923516","source":{"url":"https://fileinfo.com/extension/rpm","file":"rpm.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"zip","extension":"zip","name":"Zipped File","summary":"A ZIP file is an archive that contains one or more files compressed or \"zipped\" with Zip compression . It stores files separately from each other, allowing the files to be compressed using different methods and extracted without compressing or decompressing the entire archive.","developer":"Phil Katz","developer_slug":"phil-katz","category":"Compressed Files","category_slug":"compressed-files","rating":3.9,"votes":2897,"last_updated":"December 12, 2022","how_to_open":{"instructions":["In Windows, you can open a ZIP file with File Explorer, also known as \"Windows Explorer,\" simply by double-clicking the file. You can then choose one, multiple, or all of the files to extract from the Zip archive. In macOS, you can open a ZIP file with Apple Archive Utility by double-clicking the file.","You can also open ZIP files with other compression utilities, such as Corel WinZip (Windows), Corel WinZip Mac (macOS), RARLAB WinRAR (Windows), and 7-Zip (Windows)."]},"scraped_at":"2025-08-09T21:58:54.854339","source":{"url":"https://fileinfo.com/extension/zip","file":"zip.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false}]