[{"slug":"apk","extension":"apk","name":"Android Package File","summary":"An APK file is an app created for Android, Google's mobile operating system. Some apps come pre-installed on Android devices, while other apps can be downloaded from Google Play. Apps downloaded from Google Play are automatically installed on your device, while those downloaded from other sources must be installed manually.","developer":"Google","developer_slug":"google","category":"Executable Files","category_slug":"executable-files","rating":4.3,"votes":109495,"last_updated":"April 27, 2023","how_to_open":{"instructions":["In Alpine Linux, you can use Alpine Package Keeper ( apk ) to install the software package an APK file contains. For example, you can use the following command to install an APK file:","apk add --allow-untrusted /Path/To/YourFile.apk","Note that Alpine Linux APK files are not the same as Android APK files. You cannot install Alpine Linux APK files on Android devices (and vice versa)."]},"scraped_at":"2025-08-09T21:58:54.934536","source":{"url":"https://fileinfo.com/extension/apk","file":"apk.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"bat","extension":"bat","name":"DOS Batch File","summary":"A BAT file is a DOS batch file used to execute commands with the Windows Command Prompt ( cmd.exe ). It contains a series of line commands in plain text that are executed to perform various tasks, such as starting programs or running maintenance utilities within Windows.","developer":"Microsoft","developer_slug":"microsoft","category":"Executable Files","category_slug":"executable-files","rating":4.1,"votes":309,"last_updated":"February 4, 2020","scraped_at":"2025-08-09T21:58:55.078479","source":{"url":"https://fileinfo.com/extension/bat","file":"bat.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"exe","extension":"exe","name":"Windows Executable File","summary":"An EXE file is an executable program that runs in Microsoft Windows. It contains an application, like notepad.exe or msedge.exe , that opens when you double-click the file. Some EXE files, such as installers downloaded from the internet, will install a program on your Windows computer when opened.","developer":"Microsoft","developer_slug":"microsoft","category":"Executable Files","category_slug":"executable-files","rating":4.1,"votes":6832,"last_updated":"November 30, 2023","how_to_open":{"instructions":["In Windows, you can run the program an EXE file contains by double-clicking the file. However, do not double-click the file unless you can verify its legitimacy.","Advanced users can also extract an EXE file's contents without running the program it contains, using archive expansion tools like 7-Zip or RARLAB WinRAR .","The EXE file format is designed specifically for use with Windows. Non-Windows operating systems (OS), such as macOS and Linux, cannot natively run programs saved as EXE files. However, macOS, Linux, and other non-Windows users can run Windows programs on their PCs by creating a Windows virtual machine .","In macOS, you can use a Windows virtual machine created by Parallels Desktop or VMware Fusion to run the program an EXE file contains. You can also install Windows on a Mac with the Boot Camp utility bundled with the OS.","In Linux, you can use a Windows virtual machine created by Oracle VM VirtualBox to run the program an EXE file contains. You can also use Wine, an application designed specifically to allow users to run Windows applications without installing Windows.","In Android, you can use the Android version of Wine to run Windows applications. However, Wine for Android is limited by Android devices' architecture, and it can run only some Windows programs. In iOS, you can use the iOS version of Turing Software UTM to run Windows applications."]},"scraped_at":"2025-08-09T21:58:54.893333","source":{"url":"https://fileinfo.com/extension/exe","file":"exe.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"ps1","extension":"ps1","name":"Windows PowerShell Cmdlet File","summary":"A PS1 file is a script , or \"cmdlet,\" used by Windows PowerShell, a Windows shell program built on Microsoft's .NET Framework. It contains a series of commands written in the PowerShell scripting language. PS1 files are similar to .BAT and .CMD files, except that they are executed in Windows PowerShell instead of the Windows CMD.EXE and COMMAND.COM programs.","developer":"Microsoft","developer_slug":"microsoft","category":"Executable Files","category_slug":"executable-files","rating":3.9,"votes":49,"last_updated":"July 2, 2020","how_to_open":{"instructions":["Because a PS1 file is a plain text file, you can open and view it using any text editor, including:","On Windows, you can open and execute PS1 scripts in Windows PowerShell. However, you should be careful when executing PS1 scripts, as they might contain commands that access and alter critical Windows operating system components. Do not execute a PS1 script unless you can verify its legitimacy and source."],"programs":[{"name":"Notepad","url":"../software/microsoft/notepad.html"},{"name":"TextEdit","url":"../software/apple/textedit.html"},{"name":"Atom","url":"../software/github/atom.html"}]},"scraped_at":"2025-08-09T21:58:55.084583","source":{"url":"https://fileinfo.com/extension/ps1","file":"ps1.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"sh","extension":"sh","name":"Bash Shell Script","summary":"An SH file is a script that can be run with the Bash Unix shell . It contains instructions written in the Bash command language. Users can execute the commands an SH file contains by calling the file in a Bash shell.","developer":"N/A","developer_slug":"n-a","category":"Executable Files","category_slug":"executable-files","rating":3.9,"votes":214,"last_updated":"September 6, 2022","how_to_open":{"instructions":["You can open an SH file and view or edit the script it contains in Microsoft Notepad (Windows), Apple TextEdit (Mac), Vim (Linux), or any other text editor .","To execute the script an SH file contains, open the Bash shell, navigate to the directory that contains your file, and enter bash YourFileName.sh ."]},"scraped_at":"2025-08-09T21:58:55.073681","source":{"url":"https://fileinfo.com/extension/sh","file":"sh.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false}]