[{"slug":"indd","extension":"indd","name":"Adobe InDesign Document","summary":"An INDD file is a page layout project created with Adobe InDesign, a professional desktop publishing application. It includes page formatting information, content, linked files, styles, and swatches. INDD files commonly store books, magazines, newspapers, flyers, brochures, and mobile & webpage mockups.","developer":"Adobe","developer_slug":"adobe","category":"Page Layout Files","category_slug":"page-layout-files","rating":3.5,"votes":188,"last_updated":"January 19, 2023","how_to_open":{"instructions":["You can open an INDD file with Adobe InDesign in Windows and macOS. To open it with InDesign, select File → Open... or double-click the file if it is associated with InDesign.","You can also open INDD files with Adobe's professional writing program, InCopy, and QuarkXpress."]},"scraped_at":"2025-08-09T21:58:55.140225","source":{"url":"https://fileinfo.com/extension/indd","file":"indd.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"pdf","extension":"pdf","name":"Portable Document Format File","summary":"A PDF file is a widely used document type that maintains the original layout and formatting across different devices and operating systems. It is often used for sharing documents, such as reports, contracts, manuals, or forms, ensuring that the content appears the same for all users. PDF files can include text, images, annotations, and even interactive elements (e.g., buttons and checkboxes), and users typically create them from other file formats, such as Word .DOCX documents, Excel .XLSX spreadsheets, and images.","developer":"Adobe","developer_slug":"adobe","category":"Page Layout Files","category_slug":"page-layout-files","rating":4,"votes":4842,"last_updated":"February 24, 2022","how_to_open":{"instructions":["You can open and view PDF files with a large number of applications, most notably, Adobe Acrobat Reader (multiplatform) and Adobe Acrobat (multiplatform), which can also edit them. Nitro Pro (Windows) and Smile PDFpenPro (macOS) are other applications that provide PDF viewing and editing capabilities.","Other options for viewing PDF files include Microsoft Word (Windows and macOS), Apple Preview (bundled with macOS), Foxit Reader, and web browsers, such as Google Chrome (multiplatform) and Microsoft Edge (multiplatform), which includes annotation capabilities.","On mobile devices, you can view PDF files with Adobe Reader (Android and iOS), Apple Books (iOS), Apple Pages (iOS), Google Play Books (Android), and in web browsers, such as Chrome and Safari."]},"scraped_at":"2025-08-09T21:58:54.617332","source":{"url":"https://fileinfo.com/extension/pdf","file":"pdf.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false}]