[{"slug":"bmp","extension":"bmp","name":"Bitmap Image","summary":"A BMP file is an image saved in the Bitmap (BMP) raster image format developed by Microsoft. It contains uncompressed image data that supports monochrome and color images at variable color bit depths and image metadata . Users commonly save digital photos as BMP files.","developer":"Microsoft","developer_slug":"microsoft","category":"Raster Image Files","category_slug":"raster-image-files","rating":3.8,"votes":455,"last_updated":"April 19, 2022","how_to_open":{"instructions":["You can open BMP files with various programs, including Microsoft Photos , which is bundled with Windows, and Apple Preview or Apple Photos , which are both bundled with macOS.","A large number of other image and graphics applications can be used to open BMP files:","NOTE: Many of these programs can also export images as BMP files."],"programs":[{"name":"Adobe Photoshop","url":"../software/adobe/photoshop.html"},{"name":"Adobe Illustrator","url":"../software/adobe/photoshop.html"},{"name":"CorelDRAW","url":"../software/corel/coreldraw_graphics_suite.html"},{"name":"ACD Systems Canvas","url":"../software/acd_systems/canvas.html"}]},"scraped_at":"2025-08-09T21:58:54.740150","source":{"url":"https://fileinfo.com/extension/bmp","file":"bmp.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"gif","extension":"gif","name":"Graphical Interchange Format File","summary":"A GIF file is an image saved in the Graphical Interchange Format (GIF). It may contain up to 256 indexed colors, with a color palette that may be a predefined set of colors or adapted to the colors in the image. GIF files are saved in a lossless format, meaning that the GIF compression does not degrade the image's clarity.","developer":"CompuServe","developer_slug":"compuserve","category":"Raster Image Files","category_slug":"raster-image-files","rating":4.2,"votes":735,"last_updated":"April 27, 2022","how_to_open":{"instructions":["You can open a GIF file in a variety of image viewing and editing applications, including Microsoft Photos (Windows), Apple Preview (macOS), Adobe Photoshop (Windows, Mac), and GIMP (cross-platform).","If your GIF file contains an animated GIF, some applications may show the file as a series of still images (which correspond to the animation's frames). For example, Apple Preview shows animated GIFs as a series of images, and Adobe Photoshop shows animated GIFs as a collection of layers."]},"scraped_at":"2025-08-09T21:58:54.733736","source":{"url":"https://fileinfo.com/extension/gif","file":"gif.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"jpeg","extension":"jpeg","name":"JPEG Image","summary":"A JPEG file is an image saved in a compressed graphic format standardized by the Joint Photographic Experts Group ( JPEG ). It supports up to 24-bit color and utilizes lossy compression, which may noticeably reduce the image quality if high amounts are applied. Users commonly save digital photos and web graphics as JPEG files.","developer":"Joint Photographic Experts Group","developer_slug":"joint-photographic-experts-group","category":"Raster Image Files","category_slug":"raster-image-files","rating":4,"votes":610,"last_updated":"April 19, 2022","how_to_open":{"instructions":["You can open a JPEG file with a large number of free and commercial image viewing and editing applications available for desktop and mobile platforms. Some options include:","NOTE: You can also view a JPEG file with a web browser by dragging and dropping it into the browser window."],"programs":[{"name":"Microsoft Photos","url":"../software/microsoft/photos.html"},{"name":"Apple Preview","url":"../software/apple/preview.html"},{"name":"Adobe Photoshop","url":"../software/adobe/photoshop.html"},{"name":"Corel PaintShop Pro","url":"../software/corel/paintshop_pro.html"},{"name":"Google Photos","url":"../software/google/photos.html"}]},"scraped_at":"2025-08-09T21:58:54.716626","source":{"url":"https://fileinfo.com/extension/jpeg","file":"jpeg.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"jpg","extension":"jpg","name":"JPEG Image","summary":"A JPG file is an image saved in the JPEG format. JPG files commonly contain digital photographs, drawings, or graphics. On most devices, you can double-click or double-tap a JPG file to open it in your default image viewer.","developer":"Joint Photographic Experts Group","developer_slug":"joint-photographic-experts-group","category":"Raster Image Files","category_slug":"raster-image-files","rating":4,"votes":3868,"last_updated":"November 2, 2023","how_to_open":{"instructions":["You can open a JPG file, and view the image it contains, with any image viewer. Common image viewers that support JPG files include:","You can also view a JPG image with any web browser, such as Google Chrome , Microsoft Edge , or Apple Safari , by dragging and dropping the file into your browser window.","Many image viewers that can open JPG files also contain simple image editing tools, such as the ability to crop and rotate an image and perform color adjustments. For example, Microsoft Photos , Apple Photos , and XnViewMP all contain basic image editing tools.","However, if you want to make more extensive edits to a JPG image, you should likely open and edit the image in a dedicated image editor. Some popular image editors include:"],"programs":[{"name":"Microsoft Photos","url":"../software/microsoft/photos.html"},{"name":"Apple Preview","url":"../software/apple/preview.html"},{"name":"XnViewMP","url":"../software/xnsoft/xnviewmp.html"},{"name":"ImageMagick","url":"../software/imagemagick/imagemagick.html"},{"name":"Adobe Photoshop","url":"../software/adobe/photoshop.html"},{"name":"GIMP","url":"../software/gimp/gimp.html"},{"name":"Inmagine Pixlr"}]},"scraped_at":"2025-08-09T21:58:54.709007","source":{"url":"https://fileinfo.com/extension/jpg","file":"jpg.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"png","extension":"png","name":"Portable Network Graphic","summary":"A PNG file is an image saved in the Portable Network Graphic ( PNG ) format, commonly used to store web graphics, digital photographs, and images with transparent backgrounds. It is a raster graphic similar to a .JPG image but is compressed with lossless compression and supports transparency.","developer":"PNG Development Group","developer_slug":"png-development-group","category":"Raster Image Files","category_slug":"raster-image-files","rating":4.1,"votes":1764,"last_updated":"April 20, 2023","how_to_open":{"instructions":["You can open PNG images with many free and commercial programs, including most image editors, video editors, and web browsers. Windows and macOS also come bundled with programs that support PNG images, such as Microsoft Photos and Apple Preview ."]},"scraped_at":"2025-08-09T21:58:54.726967","source":{"url":"https://fileinfo.com/extension/png","file":"png.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"psd","extension":"psd","name":"Adobe Photoshop Document","summary":"A PSD file is the native image format used by Adobe Photoshop, a professional image-editing program used for enhancing digital photos and creating web graphics. PSD files may include image layers, adjustment layers, annotations, file information, keywords, and other Photoshop-specific elements. They are commonly created and shared among graphics professionals.","developer":"Adobe","developer_slug":"adobe","category":"Raster Image Files","category_slug":"raster-image-files","rating":4.2,"votes":708,"last_updated":"April 24, 2025","how_to_open":{"instructions":["You can open PSD files with Adobe Photoshop in Windows and macOS. To open a PSD file in Photoshop, select File → Open .","While PSD files are saved in a proprietary format, you can also open them with other multi-platform applications, such as Adobe Illustrator , Corel Painter , GIMP , and Photopea (in a web browser).","In Windows, you can open PSD files with the built-in Microsoft Photos app. In macOS, you can view them with Apple Preview , which is bundled with the operating system."]},"scraped_at":"2025-08-09T21:58:55.122234","source":{"url":"https://fileinfo.com/extension/psd","file":"psd.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"webp","extension":"webp","name":"WebP Image","summary":"A WEBP file is an image saved in the WebP (pronounced \"Weppy\") raster image format developed by Google for web graphics. The WebP format reduces file size more than standard JPEG compression while maintaining similar or better image quality. It supports both lossy and lossless compression and includes an alpha channel for transparency, similar to the PNG format.","developer":"Google","developer_slug":"google","category":"Raster Image Files","category_slug":"raster-image-files","rating":3.9,"votes":628,"last_updated":"April 21, 2022","how_to_open":{"instructions":["You can open a WEBP file with various image editors, such as Image Magick (multiplatform) and XnViewMP (multiplatform). In addition, most major web browsers support WEBP files, including Google Chrome (multiplatform), Microsoft Edge (multiplatform), and Mozilla Firefox (multiplatform).","You can also open WEBP files with applications bundled with the Windows and macOS operating systems:","If you are an Android, iOS, or Chrome OS user, you can open WEBP files with Google Photos . You can also upload WebP images to Google Photos to view them with the web application."],"programs":[{"name":"In Windows , Microsoft Paint supports WebP images and you may also be able to open WebP images with Microsoft Photos by renaming their file extension to .jpg (this allows Photos to recognize the file as an image; it does not alter the internal formatting)."},{"name":"Apple Preview","url":"../software/apple/preview.html"}]},"scraped_at":"2025-08-09T21:58:54.756972","source":{"url":"https://fileinfo.com/extension/webp","file":"webp.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false}]