[{"slug":"doc","extension":"doc","name":"Microsoft Word Document (Legacy)","summary":"A DOC file is a word processing document created by Microsoft Word or exported by another word processing program, such as OpenOffice Writer or Apple Pages. It may contain formatted text, images, tables, graphs, charts, page formatting, and print settings.","developer":"Microsoft","developer_slug":"microsoft","category":"Text Files","category_slug":"text-files","rating":4,"votes":2110,"last_updated":"March 3, 2022","how_to_open":{"instructions":["You can open DOC files with Microsoft Word in Windows and macOS. Word is the best application for opening DOC files because it fully supports the formatting of Word documents, which includes text spacing and alignment, images, charts, and tables. The word processor is also available for Android and iOS devices.","You can also open DOC files with other word processors, but some of the formatting of the original documents may be altered or lost. Some word processors that support DOC files include Corel WordPerfect (Windows), Apple Pages (Mac), and LibreOffice Writer (multiplatform).","You can also open DOC files with various web programs. Google Docs is a free web application that allows you to upload a DOC file and view, edit, save, and convert the document."]},"scraped_at":"2025-08-09T21:58:54.598203","source":{"url":"https://fileinfo.com/extension/doc","file":"doc.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"docx","extension":"docx","name":"Microsoft Word Document","summary":"A DOCX file is a document created by Microsoft Word or exported by another word processing program, such as OpenOffice Writer or Apple Pages. It contains formatted text and may also include images, tables, charts, and other document elements. DOCX files are widely used in home, academic, and business environments for letters, resumes, invitations, newsletters, and other documents.","developer":"Microsoft","developer_slug":"microsoft","category":"Text Files","category_slug":"text-files","rating":3.8,"votes":1789,"last_updated":"March 3, 2022","how_to_open":{"instructions":["You can open a DOCX file with Microsoft Word in Windows and macOS. Word is the best option for opening DOCX files because it fully supports the formatting of Word documents, which includes images, charts, tables, and text spacing and alignment. Word is also available for Android and iOS devices.","You can also open DOCX files with other word processors, but some of the formatting of the original documents may be lost. Alternative word processors that support DOCX files include Corel WordPerfect (Windows), Apple Pages (Mac), and LibreOffice Writer (multiplatform).","You can open DOCX files with various programs online. Google Docs is a free web application that allows you to upload, view, edit, and save DOCX files."]},"scraped_at":"2025-08-09T21:58:54.607701","source":{"url":"https://fileinfo.com/extension/docx","file":"docx.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"odt","extension":"odt","name":"OpenDocument Text Document","summary":"An ODT file is a text document saved in the OpenDocument Text (ODT) format, which is primarily used by the LibreOffice Writer and Apache OpenOffice Writer word processors . It contains formatted text and may include images, tables, charts, and drawn objects. ODT files are an open alternative to Microsoft Word's .DOCX format and commonly save resumes, research papers, essays, reports, and other text-based documents.","developer":"OASIS","developer_slug":"oasis","category":"Text Files","category_slug":"text-files","rating":3.5,"votes":465,"last_updated":"January 29, 2025","how_to_open":{"instructions":["You can open ODT files with various word processors, including:","If you open an ODT file with a program other than LibreOffice Writer or OpenOffice Writer, it may lose some formatting."],"programs":[{"name":"LibreOffice Writer","url":"../software/libreoffice/libreoffice.html"},{"name":"OpenOffice Writer","url":"../software/apache/openoffice.html"},{"name":"Microsoft Word","url":"../software/microsoft/word.html"},{"name":"Google Docs","url":"../software/google/docs.html"}]},"scraped_at":"2025-08-09T21:58:54.643134","source":{"url":"https://fileinfo.com/extension/odt","file":"odt.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"rst","extension":"rst","name":"reStructuredText File","summary":"An RST file is a text file that contains code written in the reStructuredText markup language . reStructuredText is used to apply basic styles and formatting to plain text documents. RST files most commonly contain technical documentation for Python programs, though they may also contain text that is meant to be converted into an eBook, simple webpage, or other document.","developer":"David Goodger","developer_slug":"david-goodger","category":"Text Files","category_slug":"text-files","rating":3.5,"votes":36,"last_updated":"April 20, 2021","how_to_open":{"instructions":["Because RST files are plain text files, you can open and edit them in any text editor, including:"],"programs":[{"name":"GitHub Atom","url":"../software/github/atom.html"},{"name":"GNU Emacs","url":"../software/gnu/emacs.html"},{"name":"Microsoft Notepad","url":"../software/microsoft/notepad.html"},{"name":"Apple TextEdit","url":"../software/apple/textedit.html"},{"name":"Vim","url":"../software/vim/vim.html"}]},"scraped_at":"2025-08-09T21:58:55.226162","source":{"url":"https://fileinfo.com/extension/rst","file":"rst.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"rtf","extension":"rtf","name":"Rich Text Format File","summary":"An RTF file is a text document that supports font styling known as \" rich text .\" Examples include bold, italicized, and underlined text, as well as different typefaces and font sizes. Rich text files also support page formatting options, such as custom line spacing, tab width, and document margins. Modern versions of the RTF format can also contain images, such as .JPG and .PNG files.","developer":"Microsoft","developer_slug":"microsoft","category":"Text Files","category_slug":"text-files","rating":3.5,"votes":529,"last_updated":"April 6, 2023","how_to_open":{"instructions":["You can open an RTF file with most word processing programs, including:"],"programs":[{"name":"Microsoft WordPad","url":"../software/microsoft/wordpad.html"},{"name":"Apple TextEdit","url":"../software/apple/textedit.html"},{"name":"Microsoft Word","url":"../software/microsoft/word.html"},{"name":"OpenOffice Writer","url":"../software/apache/openoffice.html"},{"name":"Google Docs","url":"../software/google/docs.html"}]},"scraped_at":"2025-08-09T21:58:54.632662","source":{"url":"https://fileinfo.com/extension/rtf","file":"rtf.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"tex","extension":"tex","name":"LaTeX Source Document","summary":"A TEX file is a source document prepared by LaTeX, a high-quality typesetting system. It may include text, symbols, mathematical expressions, and graphics. Academic and professional users in computer science, electrical engineering, statistics, economics, and physics often utilize TEX files when typesetting articles, books, and other publications.","developer":"Donald Knuth","developer_slug":"donald-knuth","category":"Text Files","category_slug":"text-files","rating":3.7,"votes":128,"last_updated":"June 23, 2022","how_to_open":{"instructions":["You can open TEX files with various LaTeX applications, such as TeXworks (multiplatform), MiKTeX (multiplatform), and Texmaker (multiplatform).","Since TEX files store documents in plain text, you can also open and edit the files with a text editor, such as Microsoft Notepad (bundled with Windows) or Apple TextEdit (bundled with macOS). However, these text editors do not provide helpful LaTeX syntax highlighting features available with LaTeX applications."]},"scraped_at":"2025-08-09T21:58:55.233892","source":{"url":"https://fileinfo.com/extension/tex","file":"tex.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false},{"slug":"txt","extension":"txt","name":"Plain Text File","summary":"A TXT file is a standard text document that contains plain text . It can be opened and edited in any text-editing or word-processing program. TXT files are most often created by Microsoft Notepad and Apple TextEdit, which are basic text editors that come bundled with Windows and macOS, respectively.","developer":"N/A","developer_slug":"n-a","category":"Text Files","category_slug":"text-files","rating":3.7,"votes":3267,"last_updated":"May 2, 2022","how_to_open":{"instructions":["You can open a TXT file with any text editor and most popular web browsers. For example, Microsoft Notepad (Windows) and Apple TextEdit (macOS) can open TXT files, and they come bundled with their respective operating systems.","The Google Chrome , Mozilla Firefox , and Microsoft Edge web browsers all allow users to open TXT files. Keep in mind, however, that you will not be able to edit your TXT file in a web browser.","In Chrome and Firefox, you can simply drag and drop your file into a browser window to open it. In Microsoft Edge, you must copy and paste your file's location into Edge's address bar to open the file."]},"scraped_at":"2025-08-09T21:58:54.625061","source":{"url":"https://fileinfo.com/extension/txt","file":"txt.html"},"hasMoreInfo":true,"hasTechnicalInfo":false,"hasPrograms":false,"hasImages":false}]