{
  "slug": "7z",
  "extension": "7z",
  "name": "7-Zip Compressed File",
  "summary": "A 7Z file is a compressed archive created by various file compression utilities, most notably, Igor Pavlov's 7-Zip. It is compressed with open-source LZMA compression, which features a high compression ratio and may include AES-256 (256-bit) encryption. 7Z files may contain multiple directories or files compressed to save space for storage or transportation purposes.",
  "developer": "Igor Pavlov",
  "developer_slug": "igor-pavlov",
  "category": "Compressed Files",
  "category_slug": "compressed-files",
  "rating": 4.1,
  "votes": 561,
  "last_updated": "May 25, 2022",
  "more_information": {
    "content": [
      "The 7z format was initially released in 1999 and utilized by 7-Zip, a free, open-source application used to archive and compress data. It was eventually placed in the public domain in December 2008 and is still maintained.",
      "7z compression uses the LZMA method by default. The 7z format also supports the PPMD, BCJ, BCJ2, BZip2, and Deflate compression methods. Additionally, the file type supports Unicode file names, multi-part archives, archive header compression, and file sizes up to 16,000,000,000 GB."
    ],
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/7z_452.png",
      "srcset": "https://fileinfo.com/img/ss/md/7z_452.png 760w, https://fileinfo.com/img/ss/sm/7z_452.png 380w",
      "alt": "Screenshot of a .7z file in 7-Zip 19",
      "width": "380",
      "height": "253",
      "caption": "7Z file open in 7-Zip 19"
    }
  },
  "how_to_open": {
    "instructions": [
      "You can extract files contained in a 7Z archive with various decompression utilities, such as 7-Zip (Windows), Corel WinZip (Windows), Apple Archive Utility (bundled with Macs), Corel WinZip Mac (Mac), and B1 Free Archiver (multiplatform).",
      "If your 7Z archive is split into a multi-volume archive (e.g., you possess a .7Z.001 file, a .7Z.002 file, and so on), you can extract all the files included within the multi-volume archive by opening the archive's 7Z.001 file in a decompression utility. For this to work, all the multi-volume archive's files must be stored in the same folder. Also, you must possess every file included in the archive. For example, if you have a .7Z.003 file and .7Z.005 file, but not a .7Z.004 file, you may have trouble extracting your files. (Some utilities that can decompress single-volume 7Z archives cannot decompress multi-volume archives. For example, Apple Archive Utility cannot decompress multi-volume 7Z archives.)",
      "NOTE: Some 7Z archives may be password-protected. To open these archives, you must enter the password used to create the archive when prompted."
    ]
  },
  "scraped_at": "2025-08-09T21:58:54.866908",
  "source": {
    "url": "https://fileinfo.com/extension/7z",
    "file": "7z.html"
  }
}