{
  "slug": "amf",
  "extension": "amf",
  "name": "Additive Manufacturing File",
  "category": "additive-manufacturing-file",
  "summary": "",
  "developer_org": "origin-systems",
  "developer_name": "ORIGIN Systems",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/amf_10318.png",
      "alt": "Screenshot of a .amf file in Autodesk Meshmixer 3",
      "caption": "AMF file open in Autodesk Meshmixer 3"
    },
    "description": [
      "Since the 1980s, the .STL format has been the industry standard for storing and transferring information between CAD programs and additive manufacturing tools. However, with the rise of 3D printing, more capable formats are needed to store and transfer all the necessary 3D object information for 3D printing. This need has led to the increased popularity of the .3MF and AMF formats.",
      "The American Society for Testing and Materials (ASTM) developed and released the open AMF format in 2013. ASTM designed AMF to be a unifying solution for storing 3D object information, similar to the .PDF format for storing documents.",
      "AMF stores information similarly to the XML standard and is simple, scalable, and backward and future compatible. The format uses triangle meshes to describe surfaces, whether curved or non-planar edges, on 3D surfaces. Colors are specified using RGBA (red, green, blue, and alpha channels) values.",
      "You can export 3D object information to the AMF format using programs such as Dassault Systemes SOLIDWORKS and Autodesk applications. 3D printers that support the format include Materialise and Shapeways."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/amf_10318.png",
      "alt": "Screenshot of a .amf file in Autodesk Meshmixer 3",
      "caption": "AMF file open in Autodesk Meshmixer 3"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/amf_12449.png",
      "alt": "Screenshot of a .amf file in VideoLAN VLC media player",
      "caption": "AMF file open in VideoLAN VLC media player"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "amf.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}