{
  "slug": "aspx",
  "extension": "aspx",
  "name": "Active Server Page Extended Webpage",
  "category": "active-server-page-extended-webpage",
  "summary": "",
  "developer_org": "microsoft",
  "developer_name": "Microsoft",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/aspx_9.png",
      "alt": "Screenshot of a .aspx file in Microsoft Visual Studio Code",
      "caption": "ASPX file open in Microsoft Visual Studio Code"
    },
    "description": [
      "ASP.NET is a web application framework that developers use to create dynamic websites and webpages. For example, a web developer might use ASP.NET to create a web app that consists of several, interconnected fillable forms.",
      "Primarily, developers create and save ASP.NET webpages as ASPX files. They then place these files on web servers that support the ASP.NET framework. When a user's web browser requests the webpage an ASPX file describes, the web server first translates the markup and scripts the file contains into HTML content. The user's web browser then displays this content as it would any other HTML webpage.",
      "Typical internet users are most likely to encounter ASPX files as webpages displayed in their web browser. These ASPX files have already been translated into HTML content. While viewing one of these webpages, you can right-click and select View/Show Page Source to view the HTML version of the ASPX webpage.",
      "Some web developers may want to download the untranslated version of an ASPX file from another user's web server. (For example, to view the markup and scripts another developer used to create a webpage.) Unfortunately, unless you have login credentials for the associated web server, there is no way to download the untranslated version of an ASPX file."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/aspx_9.png",
      "alt": "Screenshot of a .aspx file in Microsoft Visual Studio Code",
      "caption": "ASPX file open in Microsoft Visual Studio Code"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "aspx.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}