{
  "slug": "avhdx",
  "extension": "avhdx",
  "name": "Automatic Virtual Hard Drive File",
  "category": "automatic-virtual-hard-drive-file",
  "summary": "",
  "developer_org": "microsoft",
  "developer_name": "Microsoft",
  "more_information": {
    "description": [
      "AVHDX files are known as referencing disks because they use other disks to create a differencing disk chain. Each AVHDX file contains a point in time, which is used to make up a timeline with the other AVHDX files in the chain. These files enable a virtual machine to revert to a previous state, which allows you to create a specific condition for troubleshooting a problem.",
      "You may run into an issue where a checkpoint cannot be applied in Windows Server to revert to a save state. This may be due to a broken checkpoint chain or corrupt file. You may manually merge the AVHDX files to fix this issue, although, this should be your last option. One option is to to merge checkpoints by creating a new checkpoint and then delting it, which forces Hyper-V to automatically sort your checkpoints. You may also export your VM and import it back into Hyper-V Manager. Before you attempt to merge your files you should create a backup.",
      "Microsoft Hyper-V allows you to create and manage a virtualized computing environment using virtualization technology built into Windows Server. Hyper-V comes with management tools and any required components."
    ]
  },
  "common_filenames": [
    {
      "filename": "[name of VHDX file]_(series of letters and numbers separated by dashes].avhdx",
      "description": "[name of VHDX file]_(series of letters and numbers separated by dashes].avhdx - This is the naming convention of AVHDX files. They begin with the name of the VHDX file they are created from and which they contain the checkpoint. AVHDX files are located in the same folder as the VHDX file which is the \"Virtual Machines\" folder."
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "avhdx.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}