{
  "slug": "crx",
  "extension": "crx",
  "name": "Chromium Extension",
  "category": "chromium-extension",
  "summary": "",
  "developer_org": "google",
  "developer_name": "Google",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/crx_3761.png",
      "alt": "CRX files installed in Google Chrome",
      "caption": "CRX files installed in Google Chrome"
    },
    "description": [
      "Many popular web browsers, including Google Chrome and Microsoft Edge, are based on the open-source Chromium browser. Chromium-based browsers allow users to install add-ons , more commonly referred to as extensions. (Only the PC versions of Chrome and Edge allow users to install extensions.)",
      "Typically, users install extensions by opening their browser's Extensions window, going to the Chrome Web Store (or another extension hub), and browsing and installing extensions. In this case, the Chrome Web Store (or other extension hub) automatically downloads, unpacks, and installs the extension, and users never see or interact with a CRX file.",
      "However, users searching for extensions outside their browser's extension hub may encounter and need to install a CRX file. For example, a user who downloads an unofficial Chromium extension from a forum may receive that extension as a CRX file. Each CRX file is a compressed archive that contains all of an extension's constituent files. For example, a CRX file might contain .JS , .JSON , image, and executable files, which together comprise the extension.",
      "NOTE: CRX files use .ZIP formatting. However, they contain custom file headers, so you may not be able to decompress them with standard Zip decompression utilities."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/crx_3761.png",
      "alt": "CRX files installed in Google Chrome",
      "caption": "CRX files installed in Google Chrome"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "crx.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}