{
  "slug": "doc",
  "extension": "doc",
  "name": "Microsoft Word Document (Legacy)",
  "summary": "A DOC file is a word processing document created by Microsoft Word or exported by another word processing program, such as OpenOffice Writer or Apple Pages. It may contain formatted text, images, tables, graphs, charts, page formatting, and print settings.",
  "developer": "Microsoft",
  "developer_slug": "microsoft",
  "category": "Text Files",
  "category_slug": "text-files",
  "rating": 4.0,
  "votes": 2110,
  "last_updated": "March 3, 2022",
  "more_information": {
    "content": [
      "DOC files are created to save various documents, including letters, resumes, essays, and invitations. When you create a document in Word, you can choose to save it in the DOC file format. The program then creates a DOC file to store the document's contents, which can be closed and opened again for further editing. When you are done editing your DOC file you can print it or save it as another file, such as a .PDF or .DOT document.",
      "The DOC file was designated as Microsoft Word's primary format in 1983. Word used the same format until Word 97 when Microsoft released an updated version of the binary format. In 2006, Microsoft replaced the updated DOC file format with the .DOCX file format when it released Word 2007. DOCX files store documents in the Open XML format.",
      "NOTE: Word is the most popular word processing application in the world. It comes with every edition of the Microsoft Office suite and is used in home, academic, and business environments."
    ],
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/doc_25.png",
      "srcset": "https://fileinfo.com/img/ss/md/doc_25.png 760w, https://fileinfo.com/img/ss/sm/doc_25.png 380w",
      "alt": "Screenshot of a .doc file in Microsoft Word 365",
      "width": "380",
      "height": "253",
      "caption": "DOC file open in Microsoft Word 365"
    }
  },
  "how_to_open": {
    "instructions": [
      "You can open DOC files with Microsoft Word in Windows and macOS. Word is the best application for opening DOC files because it fully supports the formatting of Word documents, which includes text spacing and alignment, images, charts, and tables. The word processor is also available for Android and iOS devices.",
      "You can also open DOC files with other word processors, but some of the formatting of the original documents may be altered or lost. Some word processors that support DOC files include Corel WordPerfect (Windows), Apple Pages (Mac), and LibreOffice Writer (multiplatform).",
      "You can also open DOC files with various web programs. Google Docs is a free web application that allows you to upload a DOC file and view, edit, save, and convert the document."
    ]
  },
  "scraped_at": "2025-08-09T21:58:54.598203",
  "source": {
    "url": "https://fileinfo.com/extension/doc",
    "file": "doc.html"
  }
}