{
  "slug": "dotx",
  "extension": "dotx",
  "name": "Microsoft Word Template",
  "category": "microsoft-word-template",
  "summary": "",
  "developer_org": "microsoft",
  "developer_name": "Microsoft",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/dotx_1756.png",
      "alt": "Screenshot of a .dotx file in Microsoft Word 365",
      "caption": "DOTX file open in Microsoft Word 365"
    },
    "description": [
      "Most computer users are familiar with the DOCX file, the primary file type created by Word and one of the most popular document types opened and saved by word processors. DOTX files are very similar to DOCX files but are used to store templates.",
      "The templates contain much of the same information DOCX files contain, including text, styles, and images. They may also be password-protected, which is helpful for securing content in templates that multiple people open and edit.",
      "DOTX files are convenient for users who need to make multiple Word documents with the same formatting and similar content, such as resumes, business plans, or newsletters.",
      "Word also comes with pre-loaded DOTX templates that allow you to create a document with many page layout elements, fonts, and styles in place. Then, depending on your need to customize the document, you can open the DOTX file and place your new text.",
      "NOTE: DOTX files replaced .DOT files when Microsoft released Office 2007. DOT files are saved in a binary format, while DOTX files are saved in the newer Open XML-based Word document format, which stores data as separate files and folders in a compressed Zip package."
    ]
  },
  "common_filenames": [
    {
      "filename": "Normal.dotx",
      "description": "Normal.dotx - The Normal template is the default template opened when users open Word. It is stored in the file Normal.dotx and can be modified to create custom default template settings."
    },
    {
      "filename": "Normal.dotx",
      "description": "Normal.dotx - The Normal template is the default template opened when users open Word. It is stored in the file Normal.dotx and can be modified to create custom default template settings."
    }
  ],
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/dotx_1756.png",
      "alt": "Screenshot of a .dotx file in Microsoft Word 365",
      "caption": "DOTX file open in Microsoft Word 365"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "dotx.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}