{
  "slug": "dwi",
  "extension": "dwi",
  "name": "Dance With Intensity Step File",
  "category": "dance-with-intensity-step-file",
  "summary": "",
  "developer_org": "simwolf",
  "developer_name": "SimWolf",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/dwi_3078.png",
      "alt": "Screenshot of a .dwi file in Dance With Intensity",
      "caption": "DWI file open in Dance With Intensity"
    },
    "description": [
      "Dance With Intensity (DWI) is a Dance Dance Revolution (DDR) clone available for Windows. Just like in DDR, DWI players complete levels by pressing buttons or performing dance steps in time to music.",
      "Each DWI level is comprised of multiple files: an .MP3 or other audio file containing the level's song, .PNG images specifying the level's background and artist image, and a DWI file specifying the level's steps. When DWI loads a level, it uses that level's DWI file to show arrow prompts on-screen and judge whether a player successfully responded to the prompts.",
      "Players often share and download DWI levels online. These levels are usually packaged as .ZIP files, which contain all the level files detailed above. To use one of these levels with DWI, players must expand the ZIP file and place the resulting directory in DWI's Songs → Default directory. Players can also import DWI levels, and thus DWI files, into some other DDR clones.",
      "NOTE: Some DWI files also contain animations shown in place of a level's typical PNG background."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/dwi_3078.png",
      "alt": "Screenshot of a .dwi file in Dance With Intensity",
      "caption": "DWI file open in Dance With Intensity"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/dwi_3078-2.png",
      "alt": "DWI file open with Microsoft Notepad",
      "caption": "DWI file open with Microsoft Notepad"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "dwi.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}