{
  "slug": "for",
  "extension": "for",
  "name": "Fortran Source Code File",
  "category": "fortran-source-code-file",
  "summary": "",
  "developer_org": "iso-iec",
  "developer_name": "ISO/IEC",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/for_1120.png",
      "alt": "Screenshot of a .for file in Microsoft Visual Studio Code 1.9",
      "caption": "FOR file open in Microsoft Visual Studio Code 1.9"
    },
    "description": [
      "IBM (specifically employee John Backus) initially developed the FORmula TRANslation (Fortran) language and released it in 1957. It is a general-purpose programming language often used for performing scientific and numerical computations. For example, developers may write code in Fortran and then compile it to build a program that computes numerical data to predict weather systems.",
      "Various versions have been released since 1957, with numbers representing the years they were proposed (e.g., F77 was proposed in 1977). Notably, F77 includes support for structured programming and character-based data, while the original Fortran language did not.",
      "Most developers save their F77 source code as FOR or .F files, which are easily recognizable as Fortran-based source code files. However, some save their code in .F77 files to denote that the files contain F77 source code specifically and not code written using some other Fortran variant. Later versions of Fortran, such as Fortran 90 or Fortran 2003 (that support free-form Fortran source code), are typically saved as .F90 and .F2K files.",
      "NOTE: The International Organization for Standardization (ISO) and the International Electrotechnical Commission (IEC) are currently developing Fortran."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/for_1120.png",
      "alt": "Screenshot of a .for file in Microsoft Visual Studio Code 1.9",
      "caption": "FOR file open in Microsoft Visual Studio Code 1.9"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "for.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}