{
  "slug": "gp",
  "extension": "gp",
  "name": "Guitar Pro 7 Document",
  "category": "guitar-pro-7-document",
  "summary": "",
  "developer_org": "arobas-music",
  "developer_name": "Arobas Music",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/gp_12547.png",
      "alt": "Screenshot of a .gp file in Arobas Music Guitar Pro 7.6",
      "caption": "GP file open in Arobas Music Guitar Pro 7.6"
    },
    "description": [
      "Guitar Pro is a music score application that enables you to create and modify stringed instrument tablatures and scores for other instruments. Arobas Music originally developed Guitar Pro to be a guitar and bass tablature editor but added features since its release to make it a comprehensive music sheet editor.",
      "The Guitar Pro 7 Document (GP) format debuted in version 7 of Guitar Pro when Arobas Music released the software in April 2017. The format replaced the Guitar Pro 6 Document ( .GPX ) format introduced in April 2010.",
      "To create a GP file with Guitar Pro 7:",
      "To export a GP file to other file formats with Guitar Pro 7, select File → Export , then choose the export format. Options include: GPX - Guitar Pro 6 Format GP5 - Guitar Pro 5 Format MIDI - Musical Instrument Digital Interface Format WAV - WAVE Audio Format MP3 - MP3 Audio Format PNG - Portable Network Graphic Format XML - MusicXML Format PDF - Portable Document Format NOTE: GP files do not contain actual audio data. Instead, they store instruments and musical notes simulated as music by the Guitar Pro engine in the software.",
      "NOTE: GP files do not contain actual audio data. Instead, they store instruments and musical notes simulated as music by the Guitar Pro engine in the software."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/gp_12547.png",
      "alt": "Screenshot of a .gp file in Arobas Music Guitar Pro 7.6",
      "caption": "GP file open in Arobas Music Guitar Pro 7.6"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "gp.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}