{
  "slug": "idx",
  "extension": "idx",
  "name": "VobSub Subtitles Index File",
  "category": "vobsub-subtitles-index-file",
  "summary": "",
  "developer_org": "n-a",
  "developer_name": "N/A",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/idx_5119.png",
      "alt": "Screenshot of a .idx file in GitHub Atom",
      "caption": "IDX file open in GitHub Atom"
    },
    "description": [
      "VobSub is a free program that allows users to extract and play the subtitles stored on DVDs. When VobSub extracts subtitles from a DVD, it creates two subtitles files: a SUB file and an IDX file. The SUB file contains images that are shown as subtitle text. The IDX file contains metadata that tells a media player what color the subtitle text should appear in, where the subtitles should appear on-screen, and when and in what order to show the images the SUB file contains. Subtitle settings typically appear at the beginning of an IDX file, on lines that begin with # , and timestamps and image references appear later in the file, on lines that begin with timestamp: .",
      "Using VobSub's DirectVobSub component or a media player that supports the SUB / IDX subtitle format, users can play back DVD-format subtitles alongside the movie they were meant to be used with. This can be useful if, for example, you acquire an .MP4 copy of a movie and want to watch the movie with subtitles. If you can locate a SUB and IDX file for the movie, you can load and play them as subtitles. SUB and IDX files can also be used to embed subtitles in .MKV files."
    ]
  },
  "common_filenames": [
    {
      "filename": "qdata.idx",
      "description": "qdata.idx - An IDX file used by Intuit Quicken."
    }
  ],
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/idx_5119.png",
      "alt": "Screenshot of a .idx file in GitHub Atom",
      "caption": "IDX file open in GitHub Atom"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "idx.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}