{
  "slug": "mat",
  "extension": "mat",
  "name": "MATLAB MAT-file",
  "category": "matlab-mat-file",
  "summary": "",
  "developer_org": "chaos-group",
  "developer_name": "Chaos Group",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/mat_1791.png",
      "alt": "Screenshot of a .mat file in The MathWorks MATLAB R2023a",
      "caption": "MAT file open in The MathWorks MATLAB R2023a"
    },
    "description": [
      "Scientists and engineers primarily use MATLAB to analyze data, develop algorithms, create models, build apps, and more. With the many tools included in the software, MATLAB provides a workspace that stores data you have imported into MATLAB from data files or other supported programs. Since MATLAB automatically clears the workspace when you close the program, saving your workspace as a MAT file helps you save time and preserves your environment.",
      "To create a MAT file with MATLAB, select Save Workspace in the \"HOME\" tab. You can also click the arrow in the \"Workspace\" pane, then select Save . Then, name the file, choose the save location, and select Save .",
      "Additionally, MAT files support various format versions, which means you may encounter files with the same .mat extension saved in different formats providing different capabilities. Some examples of differences include compression to reduce file size (starting with version 7 of the MAT-file format) and saving and loading parts of variables (starting with version 7.3). You can choose the format in which MATLAB saves MAT files by selecting MATLAB → Settings... → General → MAT-Files ."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/mat_1791.png",
      "alt": "Screenshot of a .mat file in The MathWorks MATLAB R2023a",
      "caption": "MAT file open in The MathWorks MATLAB R2023a"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "mat.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}