{
  "slug": "psd",
  "extension": "psd",
  "name": "Adobe Photoshop Document",
  "summary": "A PSD file is the native image format used by Adobe Photoshop, a professional image-editing program used for enhancing digital photos and creating web graphics. PSD files may include image layers, adjustment layers, annotations, file information, keywords, and other Photoshop-specific elements. They are commonly created and shared among graphics professionals.",
  "developer": "Adobe",
  "developer_slug": "adobe",
  "category": "Raster Image Files",
  "category_slug": "raster-image-files",
  "rating": 4.2,
  "votes": 708,
  "last_updated": "April 24, 2025",
  "more_information": {
    "content": [
      "The PSD format is a fully editable, uncompressed format, ideal for editing raster images. You can modify individual elements within a PSD file, such as images, shapes, text, and effects. New versions of Photoshop (2024 and later) allow you to create and insert AI-generated graphics.",
      "PSD files support RGB , CMYK , grayscale, monochrome, duotone, indexed color, Lab color, and multichannel color modes. You can change the color mode by selecting the Image → Mode in Photoshop.",
      "The Photoshop file format is comprised of five sections:",
      "NOTE: Photoshop supports PSD files up to 30,000 x 30,000 pixels or 2 GB in size. Images larger than these limits must be saved in the .PSB (Photoshop Big) Large Document format."
    ],
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/psd_83.jpg",
      "srcset": "https://fileinfo.com/img/ss/md/psd_83.jpg 760w, https://fileinfo.com/img/ss/sm/psd_83.jpg 380w",
      "alt": "Screenshot of a .psd file in Adobe Photoshop 2025",
      "width": "380",
      "height": "253",
      "caption": "PSD file open in Adobe Photoshop 2025"
    }
  },
  "how_to_open": {
    "instructions": [
      "You can open PSD files with Adobe Photoshop in Windows and macOS. To open a PSD file in Photoshop, select File → Open .",
      "While PSD files are saved in a proprietary format, you can also open them with other multi-platform applications, such as Adobe Illustrator , Corel Painter , GIMP , and Photopea (in a web browser).",
      "In Windows, you can open PSD files with the built-in Microsoft Photos app. In macOS, you can view them with Apple Preview , which is bundled with the operating system."
    ]
  },
  "scraped_at": "2025-08-09T21:58:55.122234",
  "source": {
    "url": "https://fileinfo.com/extension/psd",
    "file": "psd.html"
  }
}