{
  "slug": "sc2replay",
  "extension": "sc2replay",
  "name": "Blizzard StarCraft 2 Replay File",
  "category": "blizzard-starcraft-2-replay-file",
  "summary": "",
  "developer_org": "blizzard-entertainment",
  "developer_name": "Blizzard Entertainment",
  "more_information": {
    "description": [
      "To open a downloaded SC2REPLAY file, you can either double-click the file and open it manually, or you can first place the file in one of the following directories and then open it from the Replay menu in StarCraft II:",
      "Windows SC2 replay folder:",
      "[user]\\​Documents\\​StarCraft II\\​Accounts\\​...\\​Replays\\​",
      "macOS SC2 replay folder (updated by Blizzard in September 2010):",
      "[user]/​Documents/​Blizzard/​StarCraft II/​Accounts/​.../​Replays/​",
      "To create a replay file, select \"Save Replay\" in StarCraft II after a single or multiplayer game is complete. There are multiple subdirectories for different saved replay types. For example, VersusAI is for replays against the computer. Each subdirectory can be browsed from inside the program.",
      "To play back a replay, click on the Replay menu in the user's game profile. Replays are split into Recent, Multiplayer, Versus A.I., and Challenge categories. In the Multiplayer, Versus A.I., and Challenge categories, users can create new subfolders to organize their replays. StarCraft II automatically stores the last ten games played in the Recent folder.",
      "While viewing an SC2 replay, you can speed up or slow down the playback, as well as jump backward to anywhere on the replay timeline (NOTE: you can't jump forward since the replay must sequentially move through the steps of play). You can also view the replay from each player's perspective, which includes the \"fog of war.\" Users can also navigate the map, select units, and turn on statistics, such as how many units, what level of technological advancement, or what APM (actions per minute) rating each player has.",
      "NOTE: SC2REPLAY files are not backward compatible with earlier software versions. For example, replays saved with the beta testing version of StarCraft II are not playable with the official released version. Therefore, to play older replays, you must use the appropriate version of the software. StarCraft, the predecessor to StarCraft II, stores replay files with an .REP extension."
    ]
  },
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "sc2replay.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}