{
  "slug": "sh",
  "extension": "sh",
  "name": "Bash Shell Script",
  "summary": "An SH file is a script that can be run with the Bash Unix shell . It contains instructions written in the Bash command language. Users can execute the commands an SH file contains by calling the file in a Bash shell.",
  "developer": "N/A",
  "developer_slug": "n-a",
  "category": "Executable Files",
  "category_slug": "executable-files",
  "rating": 3.9,
  "votes": 214,
  "last_updated": "September 6, 2022",
  "more_information": {
    "content": [
      "Bash, or Bourne-Again SHell, is a Unix shell that replaced the Bourne shell (thus Bash's full name). Many Linux distributions include the Bash shell. Bash was also previously macOS's default login shell. (It has since been replaced by zsh. MacOS users can still manually set their shell to Bash.)",
      "With the Bash shell, users can execute default Bash commands or execute scripts written in the Bash command language. Bash scripts are typically saved as SH files.",
      "Some other Unix shells, such as Bourne, C shell, and Korn, also use scripts saved as SH files. One way to recognize a Bash script is to look for the string #!/bin/bash in the script's first line. Most Bash SH files include this string, which tells the shell that the script the file contains should be executed using the Bash interpreter ."
    ],
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/sh_1517.png",
      "srcset": "https://fileinfo.com/img/ss/md/sh_1517.png 760w, https://fileinfo.com/img/ss/sm/sh_1517.png 380w",
      "alt": "Screenshot of a .sh file in Microsoft Visual Studio Code",
      "width": "380",
      "height": "253",
      "caption": "SH file open in Microsoft Visual Studio Code"
    }
  },
  "how_to_open": {
    "instructions": [
      "You can open an SH file and view or edit the script it contains in Microsoft Notepad (Windows), Apple TextEdit (Mac), Vim (Linux), or any other text editor .",
      "To execute the script an SH file contains, open the Bash shell, navigate to the directory that contains your file, and enter bash YourFileName.sh ."
    ]
  },
  "scraped_at": "2025-08-09T21:58:55.073681",
  "source": {
    "url": "https://fileinfo.com/extension/sh",
    "file": "sh.html"
  }
}