{
  "slug": "targa",
  "extension": "targa",
  "name": "Targa Graphic",
  "category": "targa-graphic",
  "summary": "",
  "developer_org": "avid-technology",
  "developer_name": "Avid Technology",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/targa_10261.png",
      "alt": "Screenshot of a .targa file in Apple Preview 10.1",
      "caption": "TARGA file open in Apple Preview 10.1"
    },
    "description": [
      "The Targa format, which stands for Truevision Advanced Raster Graphics Adapter, was designed by Truevision and later acquired by Avid Technology. The format was first released in 1984 with Truevision video software.",
      "The original Targa format consisted of a \"TGA File Header\" and \"Image/Color Map Data.\" The \"Developer Area,\" \"Extension Area,\" and \"TGA File Footer\" sections were then added in 1989.",
      "The 1989 version is known as the \"New TGA Format\" and consists of the following 5 areas: TGA File Header Image/ColorMap Data Developer Area Extension Area TGA File Footer Truevision also introduced new extensions to the Targa format in 1989 to meet the needs of graphics professionals. Examples of the extra extensions include: Author name and comments Date and time the file was created Pixel aspect ratio Alpha channel type Gamma value A scaled-down postage stamp copy of the image (a \"thumbnail\" image) NOTE: TARGA files are more commonly saved as .TGA files",
      "Truevision also introduced new extensions to the Targa format in 1989 to meet the needs of graphics professionals. Examples of the extra extensions include: Author name and comments Date and time the file was created Pixel aspect ratio Alpha channel type Gamma value A scaled-down postage stamp copy of the image (a \"thumbnail\" image) NOTE: TARGA files are more commonly saved as .TGA files",
      "NOTE: TARGA files are more commonly saved as .TGA files"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/targa_10261.png",
      "alt": "Screenshot of a .targa file in Apple Preview 10.1",
      "caption": "TARGA file open in Apple Preview 10.1"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "targa.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}