{
  "slug": "tax2016",
  "extension": "tax2016",
  "name": "TurboTax 2016 Tax Return",
  "category": "turbotax-2016-tax-return",
  "summary": "",
  "developer_org": "intuit",
  "developer_name": "Intuit",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/tax2016_10390.jpg",
      "alt": "Screenshot of a .tax2016 file in Intuit TurboTax 2016",
      "caption": "TAX2016 file open in Intuit TurboTax 2016"
    },
    "description": [
      "To save time on your taxes, TurboTax allows you to import data from your previous tax return into a new TAX2016 document. You can select \"Use a tax return that's on my computer\" when prompted at the beginning of the tax return process. If you want to import data from a 2015 TurboTax return, select the file with the .TAX2015 extension. You can import data from 2015 TaxACT and H&R Block .PDF tax files as well.",
      "You will most likely only see a TAX2016 file if you are using the desktop version of TurboTax, which is available for both Windows and Mac. However, the TAX2016 file may also be exported from TurboTax Online. To export a TAX2016 file from TurboTax Online, click \"Tools,\" then select \"Save your 2016 return to your computer.\" You can then open the return in the desktop version of TurboTax.",
      "Once you have completed your return in TurboTax, you can either print and mail the tax forms or file the 2016 tax return electronically. The \"e-file\" process is free for federal returns, but usually requires a fee to file state returns electronically.",
      "NOTE: Most TAX2016 files are created in 2017 since annual tax returns are filed for the previous year."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/tax2016_10390.jpg",
      "alt": "Screenshot of a .tax2016 file in Intuit TurboTax 2016",
      "caption": "TAX2016 file open in Intuit TurboTax 2016"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "tax2016.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}