{
  "slug": "texture",
  "extension": "texture",
  "name": "Trainz Auran Texture File",
  "category": "trainz-auran-texture-file",
  "summary": "",
  "developer_org": "grin",
  "developer_name": "Grin",
  "more_information": {
    "description": [
      "The Texture format was introduced in 2000 by Auran with the release of version 0.9 (beta) of Trainz. Auran still holds the rights to the Texture format, but it licenses it to N3V Games, which develops installments in the Trainz series. While the format is old, it is still supported by newer releases of Trainz (due to its backward compatibility), such as Trainz: A New Era (TANE), which was released in 2015, and Trainz Railroad Simulator 2019 (TRS19).",
      "TEXTURE files typically depict a 3D wrapper for all or part of an object in the Trainz game. A complex object, such as a shopping mall with several stores with differing appearances, could require dozens of textures for the asset. Or a common boxcar, with hitches, wheels, truck, frame, and body would have at least one texture for each mesh used by the object.",
      "Some TEXTURE files may be used by more than one mesh. For example, an office complex with differently shaped and configured buildings that all feature the same brick exterior.",
      "When creating an asset in Trainz, a user places a texture.txt file and the original JPG, BMP, or TGA texture image files used to texture the asset in the asset's home folder. The texture.txt file contains information about the texture in key-value pairs. The asset also requires a config.txt configuration file that includes instructions to direct Trainz on how to process the asset.",
      "As a user creates an asset, he commits it to the Trainz database with the Content Manager (CM) utility included with the Trainz installation. The CM utility combines the texture.txt file with the related texture images into a TEXTURE file in the binary Auran format to save space and decrease loading time.",
      "CM also packages the TEXTURE file into a CHUMP data file, which is a Trainz data format optimized for speed and referenced at runtime. The TEXTURE file is packaged in the CHUMP file with other asset files related to the object, such as animations (spinning wheels, swaying, smoke and vapor emissions, etc.) and sound effects attributes.",
      "TEXTURE files are compressed in CHUMP data files, most TRAINZ users will not encounter them. Trainz users looking to modify objects that appear during gameplay are typically the only users who will encounter TEXTURE files. When a user opens an asset that was previously entered into the database with CM, the utility unpacks the files packaged in the CHUMP data file, which includes the TEXTURE file."
    ]
  },
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "texture.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}