{
  "slug": "tga",
  "extension": "tga",
  "name": "Targa Graphic",
  "category": "targa-graphic",
  "summary": "",
  "developer_org": "avid-technology",
  "developer_name": "Avid Technology",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/tga_107.png",
      "alt": "Screenshot of a .tga file in Apple Preview 10.1",
      "caption": "TGA file open in Apple Preview 10.1"
    },
    "description": [
      "The Targa format, which stands for Truevision Advanced Raster Graphics Adapter, was designed by Truevision (now Avid Technology) in 1984 for use with its first video software programs. The original format consisted of 2 areas: TGA File Header Image/Color Map Data While these two sections were included in the original 1984 specification of the Targa format, \"Developer Area,\" \"Extension Area,\" and \"TGA File Footer\" sections were added in 1989. This specification is known as the \"New TGA Format\" and consists of the following 5 areas: TGA File Header Image/ColorMap Data Developer Area Extension Area TGA File Footer Besides the three new sections of the image format, Truevision also introduced several new extensions to the Targa format in 1989 to meet the needs of graphics professionals. Examples of the extra extensions include: Date and time the file was created Author name and comments Alpha channel type Pixel aspect ratio Gamma value A scaled-down postage stamp copy of the image (a \"thumbnail\" image)",
      "While these two sections were included in the original 1984 specification of the Targa format, \"Developer Area,\" \"Extension Area,\" and \"TGA File Footer\" sections were added in 1989. This specification is known as the \"New TGA Format\" and consists of the following 5 areas: TGA File Header Image/ColorMap Data Developer Area Extension Area TGA File Footer Besides the three new sections of the image format, Truevision also introduced several new extensions to the Targa format in 1989 to meet the needs of graphics professionals. Examples of the extra extensions include: Date and time the file was created Author name and comments Alpha channel type Pixel aspect ratio Gamma value A scaled-down postage stamp copy of the image (a \"thumbnail\" image)",
      "Besides the three new sections of the image format, Truevision also introduced several new extensions to the Targa format in 1989 to meet the needs of graphics professionals. Examples of the extra extensions include: Date and time the file was created Author name and comments Alpha channel type Pixel aspect ratio Gamma value A scaled-down postage stamp copy of the image (a \"thumbnail\" image)"
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/tga_107.png",
      "alt": "Screenshot of a .tga file in Apple Preview 10.1",
      "caption": "TGA file open in Apple Preview 10.1"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "tga.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}