{
  "slug": "tsv",
  "extension": "tsv",
  "name": "Tab-Separated Values File",
  "category": "tab-separated-values-file",
  "summary": "",
  "developer_org": "n-a",
  "developer_name": "N/A",
  "more_information": {
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/tsv_310-4.png",
      "alt": "Screenshot of a .tsv file in Google Sheets",
      "caption": "TSV file open in Google Sheets"
    },
    "description": [
      "TSV is a standard, widely-supported format used primarily for transferring data between applications and databases. For example, a researcher whose results are saved in a proprietary database format may export those results as a TSV file. They can then share this TSV file with others, who will be able to open it in any spreadsheet application.",
      "Each TSV file contains one or more data tables. These tables are structured using tabs, which delineate columns, and line breaks, which delineate rows. Typically, each table begins with a header row, which describes the data that follows.",
      "TSV files are similar to and used in much the same way as .CSV (Comma-Separated Values) files. (The primary difference between the two formats is that CSV files use commas, rather than tabs, to separate columns.) Most applications that support the TSV format also support the CSV format, and vice-versa.",
      "NOTE: On occasion, TSV files may be saved with the .TAB extension.",
      "Most spreadsheet and database applications that allow you to export datasets allow you to export in the TSV format. For example, Google Sheets and the desktop versions of Microsoft Excel and Apple Numbers allow you to export spreadsheets as TSV files.",
      "If necessary, you can also manually create a TSV file using Microsoft Notepad , Apple TextEdit , or any other text editor (though doing so may take a lot of work if your dataset includes a lot of data)."
    ]
  },
  "images": [
    {
      "url": "https://fileinfo.com/img/ss/sm/tsv_310-4.png",
      "alt": "Screenshot of a .tsv file in Google Sheets",
      "caption": "TSV file open in Google Sheets"
    },
    {
      "url": "https://fileinfo.com/img/ss/sm/tsv_310-3.png",
      "alt": "TSV file open in Apple TextEdit",
      "caption": "TSV file open in Apple TextEdit"
    }
  ],
  "updated_at": "2025-08-09",
  "sources": [
    {
      "url": "tsv.html",
      "retrieved_at": "2025-08-09"
    }
  ]
}