{
  "slug": "wav",
  "extension": "wav",
  "name": "WAVE Audio",
  "summary": "A WAV file is an audio file saved in the Waveform Audio (WAVE) format. It contains a song, interview, voice memo, or other piece of digital audio. Because WAV files are quite common, you can play them with most media players, including those bundled with Windows, macOS, and other operating systems.",
  "developer": "Microsoft & IBM",
  "developer_slug": "microsoft-ibm",
  "category": "Audio Files",
  "category_slug": "audio-files",
  "rating": 3.8,
  "votes": 482,
  "last_updated": "July 13, 2023",
  "more_information": {
    "content": [
      "Microsoft and IBM developed the WAVE format in the early 1990s. It is based on the Resource Interchange File Format (RIFF), which is a container format that can be used to store both video and audio. WAV files, however, contain only audio.",
      "The audio a WAV file contains may be compressed or uncompressed, depending on how the file was created. Audio professionals, such as music and radio producers, often save and share high-quality recordings as uncompressed WAV files. Because these files are uncompressed, their file sizes can be quite large. For this reason, most WAV files shared via the internet are compressed, reducing both their file size and audio quality.",
      "The WAVE format supports several types of compression, and it also supports a variety of sampling rates and bitrates . However, WAVE audio is most often saved in a 44.1 kHz, 16-bit stereo format, which is the standard format used for CD audio."
    ],
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/wav_113.png",
      "srcset": "https://fileinfo.com/img/ss/md/wav_113.png 760w, https://fileinfo.com/img/ss/sm/wav_113.png 380w",
      "alt": "Screenshot of a .wav file in VideoLAN VLC media player",
      "width": "380",
      "height": "253",
      "caption": "WAV file open in VideoLAN VLC media player"
    }
  },
  "how_to_open": {
    "instructions": [
      "You can open a WAV file with any of the following media players, to play the audio it contains:",
      "If you want to edit the audio a WAV file contains, you should open it with a dedicated audio-editing program, such as Audacity or Adobe Audition ."
    ],
    "programs": [
      {
        "name": "Microsoft Media Player",
        "url": "../software/microsoft/media_player.html"
      },
      {
        "name": "Apple Music",
        "url": "../software/apple/music.html"
      },
      {
        "name": "VideoLAN VLC media player",
        "url": "../software/videolan/vlc_media_player.html"
      },
      {
        "name": "Clementine",
        "url": "../software/clementine/clementine.html"
      }
    ]
  },
  "scraped_at": "2025-08-09T21:58:54.814686",
  "source": {
    "url": "https://fileinfo.com/extension/wav",
    "file": "wav.html"
  }
}