{
  "slug": "wma",
  "extension": "wma",
  "name": "Windows Media Audio",
  "summary": "A WMA file is an audio file saved in the Advanced Systems Format (ASF) container format developed by Microsoft. It stores audio data encoded in the Windows Media Audio (WMA), WMA Pro, WMA Lossless, or WMA Voice codecs . WMA files also include metadata objects such as the title, artist, album, and track genre.",
  "developer": "Microsoft",
  "developer_slug": "microsoft",
  "category": "Audio Files",
  "category_slug": "audio-files",
  "rating": 3.7,
  "votes": 182,
  "last_updated": "June 3, 2022",
  "more_information": {
    "content": [
      "WMA files are similar to .MP3 files and are primarily used for streaming music on the web. However, they may also store other types of audio besides music, including voice narration and sound effects.",
      "WMA files utilize Microsoft's proprietary ASF container format, which supports audio and video data. A file utilizing the ASF container format that contains video and audio data, may bear the .asf file extension ( .ASF file).",
      "However, WMA and .WMV files, which feature the ASF container format, are more common than ASF files. Typically, files that only store audio data encoded in one of the WMA codecs in the ASF container format have the .wma file extension (WMA files). Furthermore, a file that stores video and audio data in the ASF container format often bears the .wmv file extension (WMV file)."
    ],
    "screenshot": {
      "url": "https://fileinfo.com/img/ss/sm/wma_115.png",
      "srcset": "https://fileinfo.com/img/ss/md/wma_115.png 760w, https://fileinfo.com/img/ss/sm/wma_115.png 380w",
      "alt": "Screenshot of a .wma file in VideoLAN VLC media player",
      "width": "380",
      "height": "253",
      "caption": "WMA file open in VideoLAN VLC media player"
    }
  },
  "how_to_open": {
    "instructions": [
      "You can open WMA files with various audio players, including Microsoft Media Player , VideoLAN VLC media player , Audacious, or Nullsoft Winamp .",
      "Several mobile apps can also play WMA files, including WMA Music Player (Android) and olimsoft OPlayer (iOS)."
    ]
  },
  "scraped_at": "2025-08-09T21:58:54.844470",
  "source": {
    "url": "https://fileinfo.com/extension/wma",
    "file": "wma.html"
  }
}